@extends('home.main')
@section('content')
    @include('home.common.crumb')
    <div class="about_con">
        <h3>平台功能</h3>
        <p>功能初衷介绍：</p>
        <p>产品样片：设计师和视频制作公司发布的产品。</p>
        <p>在线作品：平台发布的在线作品(设计师和制作公司也可以发布)。</p>
        <p>供应企业：包含视频制作的企业和设计师信息。</p>
        <p>需求信息：普通用户发布的需求信息，目前视频为主。</p>
        <p>娱乐频道：类似经纪公司，御用形象代言的演员、模特等资源信息。</p>
        <p>租赁频道：拍摄设备租赁信息。</p>
        <p>设计频道：平面、建筑、效果图等设计产品信息。</p>
        <p>创意点子：脚本创意信息。</p>
        <p>用户意见：用户对本平台的建议。</p>
        <p>话题：用户对公司、设计师、个人、演员等等信息的看法评。</p>
        <div style="border-bottom:1px dashed darkgrey;"></div>
        <p>本站准备对用户填写和上传的资料，负责，要审核其准确性</p>
        <p>
            本网站发起人--九哥，微信946493655，特此邀请艺术创作者、CG(平面/视频制作)从业者、IT(网站设计/开发/维护)从业者中拥有志同道合的人入盟合伙，一起协商事业。
        </p>
    </div>
    <div style="height:300px;">{{--空白--}}</div>
@stop