-- MySQL dump 10.13  Distrib 5.6.27, for Linux (i686)
--
-- Host: localhost    Database: cul_business
-- ------------------------------------------------------
-- Server version	5.6.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `ba_action待处理`
--

DROP TABLE IF EXISTS `ba_action待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ba_action待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '权限名称',
  `intro` varchar(255) DEFAULT NULL COMMENT '权限说明',
  `namespace` varchar(255) NOT NULL COMMENT '命名空间',
  `controller_prefix` varchar(255) NOT NULL DEFAULT '' COMMENT '控制器名称',
  `url` varchar(255) NOT NULL COMMENT '访问路径的部分 url',
  `action` varchar(255) NOT NULL COMMENT '操作方法名称',
  `style_class` varchar(255) NOT NULL COMMENT 'class样式名称',
  `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '上级ID',
  `sort` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '排序，数字越大越靠前面',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '2' COMMENT '是否显示：1不显示，2显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8 COMMENT='系统管理员权限表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ba_action待处理`
--

LOCK TABLES `ba_action待处理` WRITE;
/*!40000 ALTER TABLE `ba_action待处理` DISABLE KEYS */;
INSERT INTO `ba_action待处理` VALUES (1,'首页','','App\\Http\\Controllers\\Admin','Home','home','index','am-cf',0,0,2,20160109,0),(2,'权限管理','','App\\Http\\Controllers\\Admin','Action','action','index','am-cf',0,0,2,20160109,0),(3,'操作管理','','App\\Http\\Controllers\\Admin','Action','action','index','am-cf',2,0,2,20160110,20160112),(4,'资料审核','','App\\Http\\Controllers\\Admin','Action','action','index','am-cf',0,0,2,0,20160110),(5,'供求管理','企业，设计师的','App\\Http\\Controllers\\Admin','Goods','goods','index','am-cf',0,0,2,0,20160409),(6,'角色管理','','App\\Http\\Controllers\\Admin','Role','role','index','am-cf',2,0,2,0,20160112),(7,'管理员管理','','App\\Http\\Controllers\\Admin','Admin','admin','index','am-cf',2,0,2,20160112,20160112),(8,'在线创作','','App\\Http\\Controllers\\Admin','Product','action','index','am-cf',0,0,2,20160112,20160216),(9,'系统管理','','App\\Http\\Controllers\\Admin','Action','action','index','am-cf',0,0,2,20160112,0),(10,'话题管理','','App\\Http\\Controllers\\Admin','Action','action','index','am-cf',0,0,2,20160112,0),(11,'企业功能管理','','App\\Http\\Controllers\\Admin','ComInfo','cominfo','index','am-cf',0,0,2,20160112,20160426),(12,'基本管理','','App\\Http\\Controllers\\Admin','Action','action','index','am-cf',0,0,2,20160112,20160404),(13,'消息管理','','App\\Http\\Controllers\\Admin','Message','message','index','am-cf',12,0,2,20160112,0),(14,'链接管理','','App\\Http\\Controllers\\Admin','Link','link','index','am-cf',12,0,2,20160112,0),(15,'心声管理','','App\\Http\\Controllers\\Admin','UserVoice','uservoice','index','am-cf',12,0,2,20160112,20160409),(16,'创作定制','','App\\Http\\Controllers\\Admin','OrderVideo','orderVideo','index','am-cf',45,0,1,20160113,1476606406),(17,'图片管理','','App\\Http\\Controllers\\Admin','Pic','pic','index','am-cf',12,0,2,20160113,20160411),(18,'广告管理','','App\\Http\\Controllers\\Admin','Ad','ad','index','am-cf',0,0,2,20160215,0),(19,'广告管理','','App\\Http\\Controllers\\Admin','Ad','ad','index','am-cf',18,0,2,20160215,0),(20,'广告位管理','','App\\Http\\Controllers\\Admin','AdPlace','place','index','am-cf',18,0,2,20160215,0),(21,'在线动画','','App\\Http\\Controllers\\Admin','Product','product','index','',8,0,2,20160216,1476606253),(22,'视频管理','','App\\Http\\Controllers\\Admin','Video','video','index','',12,0,2,20160216,1475741829),(23,'视频作品','制作公司，设计师的','App\\Http\\Controllers\\Admin','Goods','goods','index','',5,0,2,20160216,20160409),(24,'账务管理','','App\\Http\\Controllers\\Admin','Wallet','wallet','index','',0,0,2,20160216,1476178848),(25,'租赁管理','','App\\Http\\Controllers\\Admin','Rent','rent','index','',5,0,2,20160216,0),(26,'娱乐管理','','App\\Http\\Controllers\\Admin','Entertain','entertain','index','',5,0,2,20160216,0),(27,'设计管理','','App\\Http\\Controllers\\Admin','Design','design','index','',5,0,2,20160217,0),(28,'用户权限','','App\\Http\\Controllers\\Admin','Auths','auth','index','',2,0,1,20160217,1476845834),(29,'功能权限','','App\\Http\\Controllers\\Admin','Auths','auth','index','',2,0,2,20160217,1476948045),(30,'前台功能','','App\\Http\\Controllers\\Admin','Menus','menus','index','',2,0,2,20160229,1476861647),(31,'意见管理','','App\\Http\\Controllers\\Admin','Opinions','opinions','index','',12,0,2,20160404,0),(32,'用户日志','','App\\Http\\Controllers\\Admin','Userlog','userlog','index','',9,0,2,20160407,20160411),(33,'会员管理','','App\\Http\\Controllers\\Admin','User','user','index','',4,0,2,20160411,0),(34,'地区管理','','App\\Http\\Controllers\\Admin','Area','area','index','',12,0,2,20160411,0),(35,'系统首页','','App\\Http\\Controllers\\Admin','Home','home','index','',1,0,2,20160415,1476954935),(36,'创意管理','','App\\Http\\Controllers\\Admin','Idea','idea','index','',5,0,2,20160416,0),(37,'话题列表','','App\\Http\\Controllers\\Admin','Talk','talk','index','',10,0,2,20160417,0),(38,'人员管理','','App\\Http\\Controllers\\Admin','Staff','staff','index','',5,0,2,20160423,0),(39,'企业模块','','App\\Http\\Controllers\\Admin','ComModule','commodule','index','',11,0,2,20160426,20160426),(40,'企业主体','','App\\Http\\Controllers\\Admin','ComMain','commain','index','',11,0,2,20160426,0),(41,'企业功能','','App\\Http\\Controllers\\Admin','ComFunc','comfunc','index','',11,0,2,20160426,0),(42,'访问管理','','App\\Http\\Controllers\\Admin','Visitlog','visit','index','',11,0,2,20160501,0),(43,'离线动画','','App\\Http\\Controllers\\Admin','ProductVideo','proVideo','index','',8,0,2,20160502,1476606298),(44,'会员钱包','','App\\Http\\Controllers\\Admin','Wallet','wallet','index','',24,0,2,20160511,1476187152),(45,'订单管理','','App\\Http\\Controllers\\Admin','Order','order','index','',0,0,2,20160524,0),(46,'订单管理','','App\\Http\\Controllers\\Admin','Order','order','index','',45,0,2,20160524,0),(47,'售后服务','','App\\Http\\Controllers\\Admin','OrderFirm','orderfirm','index','',45,0,1,20160524,0),(48,'创作订单','','App\\Http\\Controllers\\Admin','OrderProduct','orderpro','index','',45,4,2,20160524,0),(49,'分镜管理','','App\\Http\\Controllers\\Admin','StoryBoard','storyboard','index','',5,0,2,20160524,20160524);
/*!40000 ALTER TABLE `ba_action待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ba_admin待处理`
--

DROP TABLE IF EXISTS `ba_admin待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ba_admin待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL COMMENT '管理员名称',
  `realname` varchar(50) NOT NULL COMMENT '真实名字',
  `password` varchar(255) NOT NULL COMMENT '加密过得密码',
  `pwd` varchar(50) NOT NULL COMMENT '登陆原始密码',
  `role_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '管理员组别，关联ba_role',
  `intro` varchar(255) NOT NULL COMMENT '管理员介绍',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='系统后台管理员表（登陆者）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ba_admin待处理`
--

LOCK TABLES `ba_admin待处理` WRITE;
/*!40000 ALTER TABLE `ba_admin待处理` DISABLE KEYS */;
INSERT INTO `ba_admin待处理` VALUES (1,'jiuge','jiuge','$2y$10$P9SN9.5CySu6AKGqSig0SO0M4cE5NMptcA8gr1GW7JfCBzEHrCiQO','jiuge',1,'',1470909119,1472215772);
/*!40000 ALTER TABLE `ba_admin待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ba_log待处理`
--

DROP TABLE IF EXISTS `ba_log待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ba_log待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '管理员id',
  `uname` varchar(100) NOT NULL COMMENT '用户名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '1用户记录，2管理员记录',
  `serial` varchar(20) NOT NULL COMMENT '序号，唯一标识',
  `ip` varchar(15) NOT NULL COMMENT 'ip地址',
  `ipaddress` varchar(100) NOT NULL COMMENT '管理员IP所在地',
  `action` varchar(100) NOT NULL COMMENT '访问的方法',
  `loginTime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登陆时间',
  `logoutTime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '退出时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=89 DEFAULT CHARSET=utf8 COMMENT='管理员日志表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ba_log待处理`
--

LOCK TABLES `ba_log待处理` WRITE;
/*!40000 ALTER TABLE `ba_log待处理` DISABLE KEYS */;
INSERT INTO `ba_log待处理` VALUES (1,1,'jiuge',1,'20160908075940137','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473292780,0),(2,1,'jiuge',1,'201609100906318268','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473469591,0),(3,1,'jiuge',1,'201609101339029262','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473485942,0),(4,1,'jiuge',1,'201609110851236265','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473555083,0),(5,1,'jiuge',1,'201609120752378324','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473637957,0),(6,1,'jiuge',1,'20160912135742704','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473659862,0),(7,1,'jiuge',1,'201609121405091197','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473660309,0),(8,1,'jiuge',1,'201609130751197676','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473724279,0),(9,1,'jiuge',2,'20160913170458395','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1473757498,0),(10,1,'jiuge',2,'2016091409015949','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1473814919,0),(11,1,'jiuge',2,'201609150820596747','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1473898859,0),(12,1,'jiuge',2,'201609151505435076','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1473923143,0),(13,1,'jiuge',1,'201609151740117655','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1473932411,0),(14,1,'jiuge',1,'201609160853344212','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473987214,1473992233),(15,2,'jiuge2',1,'201609161017314217','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1473992251,0),(16,1,'jiuge',1,'201609161738121898','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1474018692,0),(17,1,'jiuge',1,'201609191007557056','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1474250875,0),(18,1,'jiuge',1,'201609191759138230','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1474279153,0),(19,1,'jiuge',1,'20160920070913436','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1474326553,1474352679),(20,1,'jiuge',2,'201609200909427023','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1474333782,0),(21,1,'jiuge',2,'201609211100499646','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1474426849,0),(22,1,'jiuge',2,'201609220743138043','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1474501393,0),(23,1,'jiuge',1,'201609221736199194','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1474536979,0),(24,1,'jiuge',2,'201609230805417001','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1474589141,0),(25,1,'jiuge',2,'201609231340524843','192.168.2.111','浙江省 杭州市 滨江区','/admin/login',1474609252,0),(26,1,'jiuge',2,'201609232010071968','192.168.2.111','浙江省 杭州市 滨江区','/admin/login',1474632607,0),(27,1,'jiuge',2,'201609240817297850','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1474676249,0),(28,1,'jiuge',2,'201609250939037501','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1474767543,0),(29,1,'jiuge',2,'20160926075745465','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1474847865,0),(30,1,'jiuge',2,'201609270809444425','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1474934984,0),(31,1,'jiuge',1,'201609280755351702','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1475020535,0),(32,1,'jiuge',1,'201609290800268044','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1475107226,0),(33,1,'jiuge',1,'201610031445229872','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1475477122,0),(34,1,'jiuge',1,'201610041334405374','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1475559280,0),(35,1,'jiuge',1,'201610050916365410','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1475630196,0),(36,1,'jiuge',2,'201610052134316436','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1475674471,0),(37,1,'jiuge',2,'201610060945564572','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1475718356,0),(38,1,'jiuge',2,'201610070806469392','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1475798806,0),(39,1,'jiuge',1,'201610071145423919','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1475811942,0),(40,1,'jiuge',1,'201610100921332998','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1476062493,0),(41,1,'jiuge',1,'201610101448322604','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1476082112,0),(42,1,'jiuge',1,'201610102042582810','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1476103378,0),(43,1,'jiuge',1,'201610111603305622','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1476173010,1476173647),(44,1,'jiuge',1,'201610111619557356','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1476173995,0),(45,1,'jiuge',2,'20161011173509162','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1476178509,0),(46,1,'jiuge',1,'201610121120363879','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1476242436,0),(47,1,'jiuge',2,'201610121405201768','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1476252320,0),(48,1,'jiuge',1,'20161014181759165','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1476440279,0),(49,1,'jiuge',2,'201610141826039532','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1476440763,0),(50,1,'jiuge',1,'201610160855544222','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1476579354,0),(51,1,'jiuge',2,'201610161615116184','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1476605711,0),(52,1,'jiuge',2,'201610170845039963','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1476665103,0),(53,1,'jiuge',1,'201610171151245960','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1476676284,0),(54,1,'jiuge',1,'201610171442432201','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1476686563,0),(55,1,'jiuge',2,'201610171442461730','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1476686566,0),(56,1,'jiuge',1,'201610180939282936','192.168.2.102','浙江省 杭州市 滨江区','/login/dologin',1476754768,0),(57,1,'jiuge',2,'201610181051527859','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476759112,0),(58,1,'jiuge',2,'201610181439027907','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476772742,0),(59,1,'jiuge',2,'201610191055553757','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476845755,0),(60,1,'jiuge',2,'201610191433408995','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476858820,0),(61,1,'jiuge',2,'201610200810319930','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476922231,1476936505),(62,1,'jiuge',2,'201610201208327956','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476936512,1476936584),(63,1,'jiuge',2,'201610201209458430','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476936585,1476936614),(64,1,'jiuge',2,'201610201210156927','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1476936615,0),(65,2,'jiuge2',1,'201611071411059067','192.168.2.102','浙江省 杭州市 滨江区','/login/dologin',1478499065,1478499468),(66,1,'jiuge',1,'201611071418043904','192.168.2.102','浙江省 杭州市 滨江区','/login/dologin',1478499484,0),(67,1,'jiuge',2,'201611092008328291','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1478693312,0),(68,1,'jiuge',2,'201611100916442558','192.168.2.102','浙江省 杭州市 滨江区','/admin/login',1478740604,0),(69,1,'jiuge',1,'201611102007533127','192.168.2.102','浙江省 杭州市 滨江区','/login/dologin',1478779673,0),(70,1,'jiuge',1,'201611110926025709','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1478827562,0),(71,1,'jiuge',1,'201611111853501017','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1478861630,0),(72,1,'jiuge',1,'201611121021011613','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1478917261,0),(73,1,'jiuge',1,'201611122020373523','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1478953237,0),(74,1,'jiuge',1,'201611131639074','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479026347,0),(75,1,'jiuge',2,'201611131926578756','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1479036417,0),(76,1,'jiuge',1,'201611141618004605','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479111480,0),(77,1,'jiuge',1,'201611151021221201','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479176482,0),(78,1,'jiuge',1,'201611160950479883','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1479261047,0),(79,1,'jiuge',1,'201611170909356082','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1479344975,0),(80,1,'jiuge',1,'201611171615465151','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1479370546,0),(81,1,'jiuge',1,'201611180841271581','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1479429687,0),(82,1,'jiuge',2,'201611180901395067','192.168.2.101','浙江省 杭州市 滨江区','/admin/login',1479430899,0),(83,1,'jiuge',1,'20161122203954583','192.168.2.101','浙江省 杭州市 滨江区','/login/dologin',1479818394,0),(84,1,'jiuge',1,'201611231607558134','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479888475,0),(85,1,'jiuge',1,'201611240850339604','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479948633,1479950107),(86,1,'jiuge',2,'201611240851031985','192.168.2.100','浙江省 杭州市 滨江区','/admin/login',1479948663,0),(87,1,'jiuge',1,'201611240915232932','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479950123,1479950369),(88,1,'jiuge',1,'201611240923048849','192.168.2.100','浙江省 杭州市 滨江区','/login/dologin',1479950584,0);
/*!40000 ALTER TABLE `ba_log待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ba_role待处理`
--

DROP TABLE IF EXISTS `ba_role待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ba_role待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布人adminid',
  `name` varchar(255) NOT NULL COMMENT '角色名称',
  `intro` varchar(255) NOT NULL COMMENT '角色简介',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='系统后台角色表（管理组别）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ba_role待处理`
--

LOCK TABLES `ba_role待处理` WRITE;
/*!40000 ALTER TABLE `ba_role待处理` DISABLE KEYS */;
INSERT INTO `ba_role待处理` VALUES (1,1,'超级管理员','最高权限，本站创始人',20160405,1472213198),(2,0,'普通管理员','一般管理',1472213596,0);
/*!40000 ALTER TABLE `ba_role待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ba_role_action待处理`
--

DROP TABLE IF EXISTS `ba_role_action待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ba_role_action待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `role_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '角色ID',
  `action_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '权限ID',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8 COMMENT='管理组与权限对应表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ba_role_action待处理`
--

LOCK TABLES `ba_role_action待处理` WRITE;
/*!40000 ALTER TABLE `ba_role_action待处理` DISABLE KEYS */;
INSERT INTO `ba_role_action待处理` VALUES (4,1,4,1476935102,0),(5,1,5,1476935102,0),(6,1,8,1476935102,0),(7,1,9,1476935102,0),(8,1,10,1476935102,0),(9,1,11,1476935102,0),(10,1,12,1476935102,0),(11,1,18,1476935102,0),(12,1,24,1476935102,0),(13,1,45,1476935102,0),(14,1,2,1476935172,0),(15,1,1,1476945532,0),(16,1,3,1476946367,0),(17,1,6,1476946367,0),(18,1,7,1476946367,0),(19,1,28,1476946367,0),(20,1,29,1476946367,0),(21,1,30,1476946367,0),(22,1,33,1476946367,0),(23,1,23,1476946367,0),(24,1,25,1476946367,0),(25,1,26,1476946367,0),(26,1,27,1476946367,0),(27,1,36,1476946367,0),(28,1,38,1476946367,0),(29,1,49,1476946367,0),(30,1,21,1476946367,0),(31,1,43,1476946367,0),(32,1,32,1476946367,0),(33,1,35,1476946367,0),(34,1,37,1476946367,0),(35,1,39,1476946367,0),(36,1,40,1476946367,0),(37,1,41,1476946367,0),(38,1,42,1476946368,0),(39,1,13,1476946368,0),(40,1,14,1476946368,0),(41,1,15,1476946368,0),(42,1,17,1476946368,0),(43,1,22,1476946368,0),(44,1,31,1476946368,0),(45,1,34,1476946368,0),(46,1,19,1476946368,0),(47,1,20,1476946368,0),(48,1,44,1476946368,0),(49,1,16,1476946368,0),(50,1,46,1476946368,0),(51,1,47,1476946368,0),(52,1,48,1476946368,0);
/*!40000 ALTER TABLE `ba_role_action待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_ad_places`
--

DROP TABLE IF EXISTS `bs_ad_places`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_ad_places` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL COMMENT '广告位名称',
  `plat` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '广告位的板块：1网站前台，2公司前台',
  `intro` varchar(255) NOT NULL COMMENT '广告位简介 ',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `width` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '广告位宽度，单位px',
  `height` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '广告位高度，单位px',
  `price` float(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '广告位价格，单位元/月',
  `number` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '广告数量',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='类型表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_ad_places`
--

LOCK TABLES `bs_ad_places` WRITE;
/*!40000 ALTER TABLE `bs_ad_places` DISABLE KEYS */;
INSERT INTO `bs_ad_places` VALUES (1,'前台首页横幅',1,'前台首页上面宽横幅广告位',0,1500,400,1.00,9,1472217158,1472303435),(2,'前台供应右侧',1,'前台供应的公司列表右侧广告栏',0,270,300,1.00,2,1472288234,1472303383),(3,'前台需求右侧',1,'前台需求页面广告栏',0,270,300,1.00,2,1472303080,1472303369),(4,'前台娱乐右侧',1,'前台娱乐频道右侧广告栏',0,270,500,1.00,1,1472303732,0),(5,'前台租赁右侧',1,'前台租赁页面右侧广告栏',0,270,300,1.00,3,1472304513,0),(6,'前台设计右侧',1,'前台设计页面右侧广告栏',0,260,500,1.00,2,1472345776,0),(7,'公司首页横幅',2,'公司页面的首页横幅广告位',0,1000,300,1.00,5,1473758944,0);
/*!40000 ALTER TABLE `bs_ad_places` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_ads`
--

DROP TABLE IF EXISTS `bs_ads`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_ads` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '广告名称',
  `adplace_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '广告位id，关联bs_ad_place',
  `intro` varchar(500) NOT NULL COMMENT '广告内容',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片链接id，关联bs_pics',
  `link` varchar(255) NOT NULL COMMENT '广告链接',
  `fromTime` int(10) unsigned NOT NULL COMMENT '投放开始时间',
  `toTime` int(10) unsigned NOT NULL COMMENT '投放结束时间',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布会员id',
  `isauth` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '审核状态：0未审核，1未通过审核，2通过审核',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '前台是否显示：0不显示，1显示，默认1',
  `isuse` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '控制开关：0关闭，1开启，默认1',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序，值越大越靠前',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='类型表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_ads`
--

LOCK TABLES `bs_ads` WRITE;
/*!40000 ALTER TABLE `bs_ads` DISABLE KEYS */;
INSERT INTO `bs_ads` VALUES (1,'前台横幅001',1,'1111111111111111111111',1,'/',1469980800,1472659199,0,0,1,1,10,1472269325,1472277145),(2,'前台横幅002',1,'',2,'/',1470067200,1472659199,0,0,1,1,10,1472285541,0),(3,'前台供应右侧',2,'前台供应公司列表右侧广告栏',3,'/',1469980800,1475251199,0,0,1,1,10,1472289344,0);
/*!40000 ALTER TABLE `bs_ads` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_citys`
--

DROP TABLE IF EXISTS `bs_citys`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_citys` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `parentid` int(11) NOT NULL COMMENT '父级省市ID',
  `cityname` varchar(60) NOT NULL COMMENT '城市名称',
  `nocode` int(6) NOT NULL DEFAULT '0' COMMENT '城市编号,身份证前6位,全国统一编号',
  `zipcode` int(6) NOT NULL DEFAULT '0' COMMENT '对应的邮政编码',
  `weathercode` int(9) NOT NULL DEFAULT '0' COMMENT '中国天气网对应的城市ID',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=3050 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_citys`
--

LOCK TABLES `bs_citys` WRITE;
/*!40000 ALTER TABLE `bs_citys` DISABLE KEYS */;
INSERT INTO `bs_citys` VALUES (1,0,'北京市',110000,0,0,0,0),(2,0,'天津市',120000,0,0,0,0),(3,0,'河北省',130000,0,0,0,0),(4,0,'山西省',140000,0,0,0,0),(5,0,'内蒙古',150000,0,0,0,0),(6,0,'辽宁省',210000,0,0,0,0),(7,0,'吉林省',220000,0,0,0,0),(8,0,'黑龙江省',230000,0,0,0,0),(9,0,'上海市',310000,0,0,0,0),(10,0,'江苏省',320000,0,0,0,0),(11,0,'浙江省',330000,0,0,0,0),(12,0,'安徽省',340000,0,0,0,0),(13,0,'福建省',350000,0,0,0,0),(14,0,'江西省',360000,0,0,0,0),(15,0,'山东省',370000,0,0,0,0),(16,0,'河南省',410000,0,0,0,0),(17,0,'湖北省',420000,0,0,0,0),(18,0,'湖南省',430000,0,0,0,0),(19,0,'广东省',440000,0,0,0,0),(20,0,'广西',450000,0,0,0,0),(21,0,'海南省',460000,0,0,0,0),(22,0,'重庆市',500000,0,0,0,0),(23,0,'四川省',510000,0,0,0,0),(24,0,'贵州省',520000,0,0,0,0),(25,0,'云南省',530000,0,0,0,0),(26,0,'西藏',540000,0,0,0,0),(27,0,'陕西省',610000,0,0,0,0),(28,0,'甘肃省',620000,0,0,0,0),(29,0,'青海省',630000,0,0,0,0),(30,0,'宁夏',640000,0,0,0,0),(31,0,'新疆维吾尔',650000,0,0,0,0),(32,0,'香港',810000,0,0,0,0),(33,0,'澳门',820000,0,0,0,0),(34,1,'东城区',110101,0,0,0,0),(35,1,'西城区',110102,0,0,0,0),(36,1,'朝阳区',110105,0,0,0,0),(37,1,'丰台区',110106,0,0,0,0),(38,1,'石景山区',110107,0,0,0,0),(39,1,'海淀区',110108,0,0,0,0),(40,1,'门头沟区',110109,0,0,0,0),(41,1,'房山区',110111,0,0,0,0),(42,1,'通州区',110112,0,0,0,0),(43,1,'顺义区',110113,0,0,0,0),(44,1,'昌平区',110114,0,0,0,0),(45,1,'大兴区',110115,0,0,0,0),(46,1,'怀柔区',110116,0,0,0,0),(47,1,'平谷区',110117,0,0,0,0),(48,1,'密云县',110228,0,0,0,0),(49,1,'延庆县',110229,0,0,0,0),(50,2,'和平区',120101,0,0,0,0),(51,2,'河东区',120102,0,0,0,0),(52,2,'河西区',120103,0,0,0,0),(53,2,'南开区',120104,0,0,0,0),(54,2,'河北区',120105,0,0,0,0),(55,2,'红桥区',120106,0,0,0,0),(56,2,'东丽区',120110,0,0,0,0),(57,2,'西青区',120111,0,0,0,0),(58,2,'津南区',120112,0,0,0,0),(59,2,'北辰区',120113,0,0,0,0),(60,2,'武清区',120114,0,0,0,0),(61,2,'宝坻区',120115,0,0,0,0),(62,2,'滨海新区',120116,0,0,0,0),(63,2,'宁河县',120221,0,0,0,0),(64,2,'静海县',120223,0,0,0,0),(65,2,'蓟县',120225,0,0,0,0),(66,3,'石家庄市',130100,0,0,0,0),(67,3,'唐山市',130200,0,0,0,0),(68,3,'秦皇岛市',130300,0,0,0,0),(69,3,'邯郸市',130400,0,0,0,0),(70,3,'邢台市',130500,0,0,0,0),(71,3,'保定市',130600,0,0,0,0),(72,3,'张家口市',130700,0,0,0,0),(73,3,'承德市',130800,0,0,0,0),(74,3,'沧州市',130900,0,0,0,0),(75,3,'廊坊市',131000,0,0,0,0),(76,3,'衡水市',131100,0,0,0,0),(77,4,'太原市',140100,0,0,0,0),(78,4,'大同市',140200,0,0,0,0),(79,4,'阳泉市',140300,0,0,0,0),(80,4,'长治市',140400,0,0,0,0),(81,4,'晋城市',140500,0,0,0,0),(82,4,'朔州市',140600,0,0,0,0),(83,4,'晋中市',140700,0,0,0,0),(84,4,'运城市',140800,0,0,0,0),(85,4,'忻州市',140900,0,0,0,0),(86,4,'临汾市',141000,0,0,0,0),(87,4,'吕梁市',141100,0,0,0,0),(88,5,'呼和浩特市',150100,0,0,0,0),(89,5,'包头市',150200,0,0,0,0),(90,5,'乌海市',150300,0,0,0,0),(91,5,'赤峰市',150400,0,0,0,0),(92,5,'通辽市',150500,0,0,0,0),(93,5,'鄂尔多斯市',150600,0,0,0,0),(94,5,'呼伦贝尔市',150700,0,0,0,0),(95,5,'巴彦淖尔市',150800,0,0,0,0),(96,5,'乌兰察布市',150900,0,0,0,0),(97,5,'兴安盟',152200,0,0,0,0),(98,5,'锡林郭勒盟',152500,0,0,0,0),(99,5,'阿拉善盟',152900,0,0,0,0),(100,6,'沈阳市',210100,0,0,0,0),(101,6,'大连市',210200,0,0,0,0),(102,6,'鞍山市',210300,0,0,0,0),(103,6,'抚顺市',210400,0,0,0,0),(104,6,'本溪市',210500,0,0,0,0),(105,6,'丹东市',210600,0,0,0,0),(106,6,'锦州市',210700,0,0,0,0),(107,6,'营口市',210800,0,0,0,0),(108,6,'阜新市',210900,0,0,0,0),(109,6,'辽阳市',211000,0,0,0,0),(110,6,'盘锦市',211100,0,0,0,0),(111,6,'铁岭市',211200,0,0,0,0),(112,6,'朝阳市',211300,0,0,0,0),(113,6,'葫芦岛市',211400,0,0,0,0),(114,7,'长春市',220100,0,0,0,0),(115,7,'吉林市',220200,0,0,0,0),(116,7,'四平市',220300,0,0,0,0),(117,7,'辽源市',220400,0,0,0,0),(118,7,'通化市',220500,0,0,0,0),(119,7,'白山市',220600,0,0,0,0),(120,7,'松原市',220700,0,0,0,0),(121,7,'白城市',220800,0,0,0,0),(122,7,'延边朝鲜族',222400,0,0,0,0),(123,8,'哈尔滨市',230100,0,0,0,0),(124,8,'齐齐哈尔市',230200,0,0,0,0),(125,8,'鸡西市',230300,0,0,0,0),(126,8,'鹤岗市',230400,0,0,0,0),(127,8,'双鸭山市',230500,0,0,0,0),(128,8,'大庆市',230600,0,0,0,0),(129,8,'伊春市',230700,0,0,0,0),(130,8,'佳木斯市',230800,0,0,0,0),(131,8,'七台河市',230900,0,0,0,0),(132,8,'牡丹江市',231000,0,0,0,0),(133,8,'黑河市',231100,0,0,0,0),(134,8,'绥化市',231200,0,0,0,0),(135,8,'大兴安岭地区',232700,0,0,0,0),(136,9,'黄浦区',310101,0,0,0,0),(137,9,'徐汇区',310104,0,0,0,0),(138,9,'长宁区',310105,0,0,0,0),(139,9,'静安区',310106,0,0,0,0),(140,9,'普陀区',310107,0,0,0,0),(141,9,'闸北区',310108,0,0,0,0),(142,9,'虹口区',310109,0,0,0,0),(143,9,'杨浦区',310110,0,0,0,0),(144,9,'闵行区',310112,0,0,0,0),(145,9,'宝山区',310113,0,0,0,0),(146,9,'嘉定区',310114,0,0,0,0),(147,9,'浦东新区',310115,0,0,0,0),(148,9,'金山区',310116,0,0,0,0),(149,9,'松江区',310117,0,0,0,0),(150,9,'青浦区',310118,0,0,0,0),(151,9,'奉贤区',310120,0,0,0,0),(152,9,'崇明县',310230,0,0,0,0),(153,10,'南京市',320100,0,0,0,0),(154,10,'无锡市',320200,0,0,0,0),(155,10,'徐州市',320300,0,0,0,0),(156,10,'常州市',320400,0,0,0,0),(157,10,'苏州市',320500,0,0,0,0),(158,10,'南通市',320600,0,0,0,0),(159,10,'连云港市',320700,0,0,0,0),(160,10,'淮安市',320800,0,0,0,0),(161,10,'盐城市',320900,0,0,0,0),(162,10,'扬州市',321000,0,0,0,0),(163,10,'镇江市',321100,0,0,0,0),(164,10,'泰州市',321200,0,0,0,0),(165,10,'宿迁市',321300,0,0,0,0),(166,11,'杭州市',330100,0,0,0,0),(167,11,'宁波市',330200,0,0,0,0),(168,11,'温州市',330300,0,0,0,0),(169,11,'嘉兴市',330400,0,0,0,0),(170,11,'湖州市',330500,0,0,0,0),(171,11,'绍兴市',330600,0,0,0,0),(172,11,'金华市',330700,0,0,0,0),(173,11,'衢州市',330800,0,0,0,0),(174,11,'舟山市',330900,0,0,0,0),(175,11,'台州市',331000,0,0,0,0),(176,11,'丽水市',331100,0,0,0,0),(177,12,'合肥市',340100,0,0,0,0),(178,12,'芜湖市',340200,0,0,0,0),(179,12,'蚌埠市',340300,0,0,0,0),(180,12,'淮南市',340400,0,0,0,0),(181,12,'马鞍山市',340500,0,0,0,0),(182,12,'淮北市',340600,0,0,0,0),(183,12,'铜陵市',340700,0,0,0,0),(184,12,'安庆市',340800,0,0,0,0),(185,12,'黄山市',341000,0,0,0,0),(186,12,'滁州市',341100,0,0,0,0),(187,12,'阜阳市',341200,0,0,0,0),(188,12,'宿州市',341300,0,0,0,0),(189,12,'六安市',341500,0,0,0,0),(190,12,'亳州市',341600,0,0,0,0),(191,12,'池州市',341700,0,0,0,0),(192,12,'宣城市',341800,0,0,0,0),(193,13,'福州市',350100,0,0,0,0),(194,13,'厦门市',350200,0,0,0,0),(195,13,'莆田市',350300,0,0,0,0),(196,13,'三明市',350400,0,0,0,0),(197,13,'泉州市',350500,0,0,0,0),(198,13,'漳州市',350600,0,0,0,0),(199,13,'南平市',350700,0,0,0,0),(200,13,'龙岩市',350800,0,0,0,0),(201,13,'宁德市',350900,0,0,0,0),(202,14,'南昌市',360100,0,0,0,0),(203,14,'景德镇市',360200,0,0,0,0),(204,14,'萍乡市',360300,0,0,0,0),(205,14,'九江市',360400,0,0,0,0),(206,14,'新余市',360500,0,0,0,0),(207,14,'鹰潭市',360600,0,0,0,0),(208,14,'赣州市',360700,0,0,0,0),(209,14,'吉安市',360800,0,0,0,0),(210,14,'宜春市',360900,0,0,0,0),(211,14,'抚州市',361000,0,0,0,0),(212,14,'上饶市',361100,0,0,0,0),(213,15,'济南市',370100,0,0,0,0),(214,15,'青岛市',370200,0,0,0,0),(215,15,'淄博市',370300,0,0,0,0),(216,15,'枣庄市',370400,0,0,0,0),(217,15,'东营市',370500,0,0,0,0),(218,15,'烟台市',370600,0,0,0,0),(219,15,'潍坊市',370700,0,0,0,0),(220,15,'济宁市',370800,0,0,0,0),(221,15,'泰安市',370900,0,0,0,0),(222,15,'威海市',371000,0,0,0,0),(223,15,'日照市',371100,0,0,0,0),(224,15,'莱芜市',371200,0,0,0,0),(225,15,'临沂市',371300,0,0,0,0),(226,15,'德州市',371400,0,0,0,0),(227,15,'聊城市',371500,0,0,0,0),(228,15,'滨州市',371600,0,0,0,0),(229,15,'菏泽市',371700,0,0,0,0),(230,16,'郑州市',410100,0,0,0,0),(231,16,'开封市',410200,0,0,0,0),(232,16,'洛阳市',410300,0,0,0,0),(233,16,'平顶山市',410400,0,0,0,0),(234,16,'安阳市',410500,0,0,0,0),(235,16,'鹤壁市',410600,0,0,0,0),(236,16,'新乡市',410700,0,0,0,0),(237,16,'焦作市',410800,0,0,0,0),(238,16,'濮阳市',410900,0,0,0,0),(239,16,'许昌市',411000,0,0,0,0),(240,16,'漯河市',411100,0,0,0,0),(241,16,'三门峡市',411200,0,0,0,0),(242,16,'南阳市',411300,0,0,0,0),(243,16,'商丘市',411400,0,0,0,0),(244,16,'信阳市',411500,0,0,0,0),(245,16,'周口市',411600,0,0,0,0),(246,16,'驻马店市',411700,0,0,0,0),(247,16,'济源市',419001,0,0,0,0),(248,17,'武汉市',420100,0,0,0,0),(249,17,'黄石市',420200,0,0,0,0),(250,17,'十堰市',420300,0,0,0,0),(251,17,'宜昌市',420500,0,0,0,0),(252,17,'襄阳市',420600,0,0,0,0),(253,17,'鄂州市',420700,0,0,0,0),(254,17,'荆门市',420800,0,0,0,0),(255,17,'孝感市',420900,0,0,0,0),(256,17,'荆州市',421000,0,0,0,0),(257,17,'黄冈市',421100,0,0,0,0),(258,17,'咸宁市',421200,0,0,0,0),(259,17,'随州市',421300,0,0,0,0),(260,17,'恩施土家族苗族',422800,0,0,0,0),(261,17,'仙桃市',429004,0,0,0,0),(262,17,'潜江市',429005,0,0,0,0),(263,17,'天门市',429006,0,0,0,0),(264,17,'神农架林区',429021,0,0,0,0),(265,18,'长沙市',430100,0,0,0,0),(266,18,'株洲市',430200,0,0,0,0),(267,18,'湘潭市',430300,0,0,0,0),(268,18,'衡阳市',430400,0,0,0,0),(269,18,'邵阳市',430500,0,0,0,0),(270,18,'岳阳市',430600,0,0,0,0),(271,18,'常德市',430700,0,0,0,0),(272,18,'张家界市',430800,0,0,0,0),(273,18,'益阳市',430900,0,0,0,0),(274,18,'郴州市',431000,0,0,0,0),(275,18,'永州市',431100,0,0,0,0),(276,18,'怀化市',431200,0,0,0,0),(277,18,'娄底市',431300,0,0,0,0),(278,18,'湘西土家族苗族',433100,0,0,0,0),(279,19,'广州市',440100,0,0,0,0),(280,19,'韶关市',440200,0,0,0,0),(281,19,'深圳市',440300,0,0,0,0),(282,19,'珠海市',440400,0,0,0,0),(283,19,'汕头市',440500,0,0,0,0),(284,19,'佛山市',440600,0,0,0,0),(285,19,'江门市',440700,0,0,0,0),(286,19,'湛江市',440800,0,0,0,0),(287,19,'茂名市',440900,0,0,0,0),(288,19,'肇庆市',441200,0,0,0,0),(289,19,'惠州市',441300,0,0,0,0),(290,19,'梅州市',441400,0,0,0,0),(291,19,'汕尾市',441500,0,0,0,0),(292,19,'河源市',441600,0,0,0,0),(293,19,'阳江市',441700,0,0,0,0),(294,19,'清远市',441800,0,0,0,0),(295,19,'东莞市',441900,0,0,0,0),(296,19,'中山市',442000,0,0,0,0),(297,19,'潮州市',445100,0,0,0,0),(298,19,'揭阳市',445200,0,0,0,0),(299,19,'云浮市',445300,0,0,0,0),(300,20,'南宁市',450100,0,0,0,0),(301,20,'柳州市',450200,0,0,0,0),(302,20,'桂林市',450300,0,0,0,0),(303,20,'梧州市',450400,0,0,0,0),(304,20,'北海市',450500,0,0,0,0),(305,20,'防城港市',450600,0,0,0,0),(306,20,'钦州市',450700,0,0,0,0),(307,20,'贵港市',450800,0,0,0,0),(308,20,'玉林市',450900,0,0,0,0),(309,20,'百色市',451000,0,0,0,0),(310,20,'贺州市',451100,0,0,0,0),(311,20,'河池市',451200,0,0,0,0),(312,20,'来宾市',451300,0,0,0,0),(313,20,'崇左市',451400,0,0,0,0),(314,21,'海口市',460100,0,0,0,0),(315,21,'三亚市',460200,0,0,0,0),(316,21,'三沙市',460300,0,0,0,0),(317,21,'儋州市',460400,0,0,0,0),(318,21,'五指山市',469001,0,0,0,0),(319,21,'琼海市',469002,0,0,0,0),(320,21,'文昌市',469005,0,0,0,0),(321,21,'万宁市',469006,0,0,0,0),(322,21,'东方市',469007,0,0,0,0),(323,21,'定安县',469021,0,0,0,0),(324,21,'屯昌县',469022,0,0,0,0),(325,21,'澄迈县',469023,0,0,0,0),(326,21,'临高县',469024,0,0,0,0),(327,21,'白沙黎族',469025,0,0,0,0),(328,21,'昌江黎族',469026,0,0,0,0),(329,21,'乐东黎族',469027,0,0,0,0),(330,21,'陵水黎族',469028,0,0,0,0),(331,21,'保亭黎族苗族',469029,0,0,0,0),(332,21,'琼中黎族苗族',469030,0,0,0,0),(333,22,'万州区',500101,0,0,0,0),(334,22,'涪陵区',500102,0,0,0,0),(335,22,'渝中区',500103,0,0,0,0),(336,22,'大渡口区',500104,0,0,0,0),(337,22,'江北区',500105,0,0,0,0),(338,22,'沙坪坝区',500106,0,0,0,0),(339,22,'九龙坡区',500107,0,0,0,0),(340,22,'南岸区',500108,0,0,0,0),(341,22,'北碚区',500109,0,0,0,0),(342,22,'綦江区',500110,0,0,0,0),(343,22,'大足区',500111,0,0,0,0),(344,22,'渝北区',500112,0,0,0,0),(345,22,'巴南区',500113,0,0,0,0),(346,22,'黔江区',500114,0,0,0,0),(347,22,'长寿区',500115,0,0,0,0),(348,22,'江津区',500116,0,0,0,0),(349,22,'合川区',500117,0,0,0,0),(350,22,'永川区',500118,0,0,0,0),(351,22,'南川区',500119,0,0,0,0),(352,22,'璧山区',500120,0,0,0,0),(353,22,'铜梁区',500151,0,0,0,0),(354,22,'潼南区',500223,0,0,0,0),(355,22,'荣昌区',500226,0,0,0,0),(356,22,'梁平县',500228,0,0,0,0),(357,22,'城口县',500229,0,0,0,0),(358,22,'丰都县',500230,0,0,0,0),(359,22,'垫江县',500231,0,0,0,0),(360,22,'武隆县',500232,0,0,0,0),(361,22,'忠县',500233,0,0,0,0),(362,22,'开县',500234,0,0,0,0),(363,22,'云阳县',500235,0,0,0,0),(364,22,'奉节县',500236,0,0,0,0),(365,22,'巫山县',500237,0,0,0,0),(366,22,'巫溪县',500238,0,0,0,0),(367,22,'石柱土家族',500240,0,0,0,0),(368,22,'秀山土家族苗族',500241,0,0,0,0),(369,22,'酉阳土家族苗族',500242,0,0,0,0),(370,22,'彭水苗族土家族',500243,0,0,0,0),(371,24,'贵阳市',520100,0,0,0,0),(372,24,'六盘水市',520200,0,0,0,0),(373,24,'遵义市',520300,0,0,0,0),(374,24,'安顺市',520400,0,0,0,0),(375,24,'毕节市',520500,0,0,0,0),(376,24,'铜仁市',520600,0,0,0,0),(377,24,'黔西南布依族苗族',522300,0,0,0,0),(378,24,'黔东南苗族侗族',522600,0,0,0,0),(379,24,'黔南布依族苗族',522700,0,0,0,0),(380,25,'昆明市',530100,0,0,0,0),(381,25,'曲靖市',530300,0,0,0,0),(382,25,'玉溪市',530400,0,0,0,0),(383,25,'保山市',530500,0,0,0,0),(384,25,'昭通市',530600,0,0,0,0),(385,25,'丽江市',530700,0,0,0,0),(386,25,'普洱市',530800,0,0,0,0),(387,25,'临沧市',530900,0,0,0,0),(388,25,'楚雄彝族',532300,0,0,0,0),(389,25,'红河哈尼族彝族',532500,0,0,0,0),(390,25,'文山壮族苗族',532600,0,0,0,0),(391,25,'西双版纳傣族',532800,0,0,0,0),(392,25,'大理白族',532900,0,0,0,0),(393,25,'德宏傣族景颇族',533100,0,0,0,0),(394,25,'怒江傈僳族',533300,0,0,0,0),(395,25,'迪庆藏族',533400,0,0,0,0),(396,26,'拉萨市',540100,0,0,0,0),(397,26,'日喀则市',540200,0,0,0,0),(398,26,'昌都市',540300,0,0,0,0),(399,26,'山南地区',542200,0,0,0,0),(400,26,'那曲地区',542400,0,0,0,0),(401,26,'阿里地区',542500,0,0,0,0),(402,26,'林芝市',542600,0,0,0,0),(403,27,'西安市',610100,0,0,0,0),(404,27,'铜川市',610200,0,0,0,0),(405,27,'宝鸡市',610300,0,0,0,0),(406,27,'咸阳市',610400,0,0,0,0),(407,27,'渭南市',610500,0,0,0,0),(408,27,'延安市',610600,0,0,0,0),(409,27,'汉中市',610700,0,0,0,0),(410,27,'榆林市',610800,0,0,0,0),(411,27,'安康市',610900,0,0,0,0),(412,27,'商洛市',611000,0,0,0,0),(413,28,'兰州市',620100,0,0,0,0),(414,28,'嘉峪关市',620200,0,0,0,0),(415,28,'金昌市',620300,0,0,0,0),(416,28,'白银市',620400,0,0,0,0),(417,28,'天水市',620500,0,0,0,0),(418,28,'武威市',620600,0,0,0,0),(419,28,'张掖市',620700,0,0,0,0),(420,28,'平凉市',620800,0,0,0,0),(421,28,'酒泉市',620900,0,0,0,0),(422,28,'庆阳市',621000,0,0,0,0),(423,28,'定西市',621100,0,0,0,0),(424,28,'陇南市',621200,0,0,0,0),(425,28,'临夏回族',622900,0,0,0,0),(426,28,'甘南藏族',623000,0,0,0,0),(427,29,'西宁市',630100,0,0,0,0),(428,29,'海东市',630200,0,0,0,0),(429,29,'海北藏族',632200,0,0,0,0),(430,29,'黄南藏族',632300,0,0,0,0),(431,29,'海南藏族',632500,0,0,0,0),(432,29,'果洛藏族',632600,0,0,0,0),(433,29,'玉树藏族',632700,0,0,0,0),(434,29,'海西蒙古族藏族',632800,0,0,0,0),(435,30,'银川市',640100,0,0,0,0),(436,30,'石嘴山市',640200,0,0,0,0),(437,30,'吴忠市',640300,0,0,0,0),(438,30,'固原市',640400,0,0,0,0),(439,30,'中卫市',640500,0,0,0,0),(440,31,'乌鲁木齐市',650100,0,0,0,0),(441,31,'克拉玛依市',650200,0,0,0,0),(442,31,'吐鲁番市',652100,0,0,0,0),(443,31,'哈密地区',652200,0,0,0,0),(444,31,'昌吉回族',652300,0,0,0,0),(445,31,'博尔塔拉蒙古',652700,0,0,0,0),(446,31,'巴音郭楞蒙古',652800,0,0,0,0),(447,31,'阿克苏地区',652900,0,0,0,0),(448,31,'克孜勒苏柯尔克孜',653000,0,0,0,0),(449,31,'喀什地区',653100,0,0,0,0),(450,31,'和田地区',653200,0,0,0,0),(451,31,'伊犁哈萨克',654000,0,0,0,0),(452,31,'塔城地区',654200,0,0,0,0),(453,31,'阿勒泰地区',654300,0,0,0,0),(454,31,'石河子市',659001,0,0,0,0),(455,31,'阿拉尔市',659002,0,0,0,0),(456,31,'图木舒克市',659003,0,0,0,0),(457,31,'五家渠市',659004,0,0,0,0),(458,31,'北屯市',659005,0,0,0,0),(459,31,'铁门关市',659006,0,0,0,0),(460,31,'双河市',659007,0,0,0,0),(461,31,'可克达拉市',659008,0,0,0,0),(462,32,'中西区',810001,0,0,0,0),(463,32,'湾仔区',810002,0,0,0,0),(464,32,'东区',810003,0,0,0,0),(465,32,'南区',810004,0,0,0,0),(466,32,'油尖旺区',810005,0,0,0,0),(467,32,'深水埗区',810006,0,0,0,0),(468,32,'九龙城区',810007,0,0,0,0),(469,32,'黄大仙区',810008,0,0,0,0),(470,32,'观塘区',810009,0,0,0,0),(471,32,'荃湾区',810010,0,0,0,0),(472,32,'屯门区',810011,0,0,0,0),(473,32,'元朗区',810012,0,0,0,0),(474,32,'北区',810013,0,0,0,0),(475,32,'大埔区',810014,0,0,0,0),(476,32,'西贡区',810015,0,0,0,0),(477,32,'沙田区',810016,0,0,0,0),(478,32,'葵青区',810017,0,0,0,0),(479,32,'离岛区',810018,0,0,0,0),(480,33,'花地玛堂区',820001,0,0,0,0),(481,33,'花王堂区',820002,0,0,0,0),(482,33,'望德堂区',820003,0,0,0,0),(483,33,'大堂区',820004,0,0,0,0),(484,33,'风顺堂区',820005,0,0,0,0),(485,33,'嘉模堂区',820006,0,0,0,0),(486,33,'路氹填海区',820007,0,0,0,0),(487,33,'聖方濟各堂区',820008,0,0,0,0),(488,66,'长安区',130102,0,0,0,0),(489,66,'桥西区',130104,0,0,0,0),(490,66,'新华区',130105,0,0,0,0),(491,66,'井陉矿区',130107,0,0,0,0),(492,66,'裕华区',130108,0,0,0,0),(493,66,'藁城区',130109,0,0,0,0),(494,66,'鹿泉区',130110,0,0,0,0),(495,66,'栾城区',130111,0,0,0,0),(496,66,'井陉县',130121,0,0,0,0),(497,66,'正定县',130123,0,0,0,0),(498,66,'行唐县',130125,0,0,0,0),(499,66,'灵寿县',130126,0,0,0,0),(500,66,'高邑县',130127,0,0,0,0),(501,66,'深泽县',130128,0,0,0,0),(502,66,'赞皇县',130129,0,0,0,0),(503,66,'无极县',130130,0,0,0,0),(504,66,'平山县',130131,0,0,0,0),(505,66,'元氏县',130132,0,0,0,0),(506,66,'赵县',130133,0,0,0,0),(507,66,'辛集市',130181,0,0,0,0),(508,66,'晋州市',130183,0,0,0,0),(509,66,'新乐市',130184,0,0,0,0),(510,67,'路南区',130202,0,0,0,0),(511,67,'路北区',130203,0,0,0,0),(512,67,'古冶区',130204,0,0,0,0),(513,67,'开平区',130205,0,0,0,0),(514,67,'丰南区',130207,0,0,0,0),(515,67,'丰润区',130208,0,0,0,0),(516,67,'曹妃甸区',130209,0,0,0,0),(517,67,'滦县',130223,0,0,0,0),(518,67,'滦南县',130224,0,0,0,0),(519,67,'乐亭县',130225,0,0,0,0),(520,67,'迁西县',130227,0,0,0,0),(521,67,'玉田县',130229,0,0,0,0),(522,67,'遵化市',130281,0,0,0,0),(523,67,'迁安市',130283,0,0,0,0),(524,68,'海港区',130302,0,0,0,0),(525,68,'山海关区',130303,0,0,0,0),(526,68,'北戴河区',130304,0,0,0,0),(527,68,'青龙满族',130321,0,0,0,0),(528,68,'昌黎县',130322,0,0,0,0),(529,68,'抚宁县',130323,0,0,0,0),(530,68,'卢龙县',130324,0,0,0,0),(531,69,'邯山区',130402,0,0,0,0),(532,69,'丛台区',130403,0,0,0,0),(533,69,'复兴区',130404,0,0,0,0),(534,69,'峰峰矿区',130406,0,0,0,0),(535,69,'邯郸县',130421,0,0,0,0),(536,69,'临漳县',130423,0,0,0,0),(537,69,'成安县',130424,0,0,0,0),(538,69,'大名县',130425,0,0,0,0),(539,69,'涉县',130426,0,0,0,0),(540,69,'磁县',130427,0,0,0,0),(541,69,'肥乡县',130428,0,0,0,0),(542,69,'永年县',130429,0,0,0,0),(543,69,'邱县',130430,0,0,0,0),(544,69,'鸡泽县',130431,0,0,0,0),(545,69,'广平县',130432,0,0,0,0),(546,69,'馆陶县',130433,0,0,0,0),(547,69,'魏县',130434,0,0,0,0),(548,69,'曲周县',130435,0,0,0,0),(549,69,'武安市',130481,0,0,0,0),(550,70,'桥东区',130502,0,0,0,0),(551,70,'桥西区',130503,0,0,0,0),(552,70,'邢台县',130521,0,0,0,0),(553,70,'临城县',130522,0,0,0,0),(554,70,'内丘县',130523,0,0,0,0),(555,70,'柏乡县',130524,0,0,0,0),(556,70,'隆尧县',130525,0,0,0,0),(557,70,'任县',130526,0,0,0,0),(558,70,'南和县',130527,0,0,0,0),(559,70,'宁晋县',130528,0,0,0,0),(560,70,'巨鹿县',130529,0,0,0,0),(561,70,'新河县',130530,0,0,0,0),(562,70,'广宗县',130531,0,0,0,0),(563,70,'平乡县',130532,0,0,0,0),(564,70,'威县',130533,0,0,0,0),(565,70,'清河县',130534,0,0,0,0),(566,70,'临西县',130535,0,0,0,0),(567,70,'南宫市',130581,0,0,0,0),(568,70,'沙河市',130582,0,0,0,0),(569,71,'竞秀区',130602,0,0,0,0),(570,71,'莲池区',130603,0,0,0,0),(571,71,'满城区',130621,0,0,0,0),(572,71,'清苑区',130622,0,0,0,0),(573,71,'涞水县',130623,0,0,0,0),(574,71,'阜平县',130624,0,0,0,0),(575,71,'徐水区',130625,0,0,0,0),(576,71,'定兴县',130626,0,0,0,0),(577,71,'唐县',130627,0,0,0,0),(578,71,'高阳县',130628,0,0,0,0),(579,71,'容城县',130629,0,0,0,0),(580,71,'涞源县',130630,0,0,0,0),(581,71,'望都县',130631,0,0,0,0),(582,71,'安新县',130632,0,0,0,0),(583,71,'易县',130633,0,0,0,0),(584,71,'曲阳县',130634,0,0,0,0),(585,71,'蠡县',130635,0,0,0,0),(586,71,'顺平县',130636,0,0,0,0),(587,71,'博野县',130637,0,0,0,0),(588,71,'雄县',130638,0,0,0,0),(589,71,'涿州市',130681,0,0,0,0),(590,71,'定州市',130682,0,0,0,0),(591,71,'安国市',130683,0,0,0,0),(592,71,'高碑店市',130684,0,0,0,0),(593,72,'桥东区',130702,0,0,0,0),(594,72,'桥西区',130703,0,0,0,0),(595,72,'宣化区',130705,0,0,0,0),(596,72,'下花园区',130706,0,0,0,0),(597,72,'宣化县',130721,0,0,0,0),(598,72,'张北县',130722,0,0,0,0),(599,72,'康保县',130723,0,0,0,0),(600,72,'沽源县',130724,0,0,0,0),(601,72,'尚义县',130725,0,0,0,0),(602,72,'蔚县',130726,0,0,0,0),(603,72,'阳原县',130727,0,0,0,0),(604,72,'怀安县',130728,0,0,0,0),(605,72,'万全县',130729,0,0,0,0),(606,72,'怀来县',130730,0,0,0,0),(607,72,'涿鹿县',130731,0,0,0,0),(608,72,'赤城县',130732,0,0,0,0),(609,72,'崇礼县',130733,0,0,0,0),(610,73,'双桥区',130802,0,0,0,0),(611,73,'双滦区',130803,0,0,0,0),(612,73,'鹰手营子矿区',130804,0,0,0,0),(613,73,'承德县',130821,0,0,0,0),(614,73,'兴隆县',130822,0,0,0,0),(615,73,'平泉县',130823,0,0,0,0),(616,73,'滦平县',130824,0,0,0,0),(617,73,'隆化县',130825,0,0,0,0),(618,73,'丰宁满族',130826,0,0,0,0),(619,73,'宽城满族',130827,0,0,0,0),(620,73,'围场满族蒙古族',130828,0,0,0,0),(621,74,'新华区',130902,0,0,0,0),(622,74,'运河区',130903,0,0,0,0),(623,74,'沧县',130921,0,0,0,0),(624,74,'青县',130922,0,0,0,0),(625,74,'东光县',130923,0,0,0,0),(626,74,'海兴县',130924,0,0,0,0),(627,74,'盐山县',130925,0,0,0,0),(628,74,'肃宁县',130926,0,0,0,0),(629,74,'南皮县',130927,0,0,0,0),(630,74,'吴桥县',130928,0,0,0,0),(631,74,'献县',130929,0,0,0,0),(632,74,'孟村回族',130930,0,0,0,0),(633,74,'泊头市',130981,0,0,0,0),(634,74,'任丘市',130982,0,0,0,0),(635,74,'黄骅市',130983,0,0,0,0),(636,74,'河间市',130984,0,0,0,0),(637,75,'安次区',131002,0,0,0,0),(638,75,'广阳区',131003,0,0,0,0),(639,75,'固安县',131022,0,0,0,0),(640,75,'永清县',131023,0,0,0,0),(641,75,'香河县',131024,0,0,0,0),(642,75,'大城县',131025,0,0,0,0),(643,75,'文安县',131026,0,0,0,0),(644,75,'大厂回族',131028,0,0,0,0),(645,75,'霸州市',131081,0,0,0,0),(646,75,'三河市',131082,0,0,0,0),(647,76,'桃城区',131102,0,0,0,0),(648,76,'枣强县',131121,0,0,0,0),(649,76,'武邑县',131122,0,0,0,0),(650,76,'武强县',131123,0,0,0,0),(651,76,'饶阳县',131124,0,0,0,0),(652,76,'安平县',131125,0,0,0,0),(653,76,'故城县',131126,0,0,0,0),(654,76,'景县',131127,0,0,0,0),(655,76,'阜城县',131128,0,0,0,0),(656,76,'冀州市',131181,0,0,0,0),(657,76,'深州市',131182,0,0,0,0),(658,77,'小店区',140105,0,0,0,0),(659,77,'迎泽区',140106,0,0,0,0),(660,77,'杏花岭区',140107,0,0,0,0),(661,77,'尖草坪区',140108,0,0,0,0),(662,77,'万柏林区',140109,0,0,0,0),(663,77,'晋源区',140110,0,0,0,0),(664,77,'清徐县',140121,0,0,0,0),(665,77,'阳曲县',140122,0,0,0,0),(666,77,'娄烦县',140123,0,0,0,0),(667,77,'古交市',140181,0,0,0,0),(668,78,'城区',140202,0,0,0,0),(669,78,'矿区',140203,0,0,0,0),(670,78,'南郊区',140211,0,0,0,0),(671,78,'新荣区',140212,0,0,0,0),(672,78,'阳高县',140221,0,0,0,0),(673,78,'天镇县',140222,0,0,0,0),(674,78,'广灵县',140223,0,0,0,0),(675,78,'灵丘县',140224,0,0,0,0),(676,78,'浑源县',140225,0,0,0,0),(677,78,'左云县',140226,0,0,0,0),(678,78,'大同县',140227,0,0,0,0),(679,79,'城区',140302,0,0,0,0),(680,79,'矿区',140303,0,0,0,0),(681,79,'郊区',140311,0,0,0,0),(682,79,'平定县',140321,0,0,0,0),(683,79,'盂县',140322,0,0,0,0),(684,80,'城区',140402,0,0,0,0),(685,80,'郊区',140411,0,0,0,0),(686,80,'长治县',140421,0,0,0,0),(687,80,'襄垣县',140423,0,0,0,0),(688,80,'屯留县',140424,0,0,0,0),(689,80,'平顺县',140425,0,0,0,0),(690,80,'黎城县',140426,0,0,0,0),(691,80,'壶关县',140427,0,0,0,0),(692,80,'长子县',140428,0,0,0,0),(693,80,'武乡县',140429,0,0,0,0),(694,80,'沁县',140430,0,0,0,0),(695,80,'沁源县',140431,0,0,0,0),(696,80,'潞城市',140481,0,0,0,0),(697,81,'城区',140502,0,0,0,0),(698,81,'沁水县',140521,0,0,0,0),(699,81,'阳城县',140522,0,0,0,0),(700,81,'陵川县',140524,0,0,0,0),(701,81,'泽州县',140525,0,0,0,0),(702,81,'高平市',140581,0,0,0,0),(703,82,'朔城区',140602,0,0,0,0),(704,82,'平鲁区',140603,0,0,0,0),(705,82,'山阴县',140621,0,0,0,0),(706,82,'应县',140622,0,0,0,0),(707,82,'右玉县',140623,0,0,0,0),(708,82,'怀仁县',140624,0,0,0,0),(709,83,'榆次区',140702,0,0,0,0),(710,83,'榆社县',140721,0,0,0,0),(711,83,'左权县',140722,0,0,0,0),(712,83,'和顺县',140723,0,0,0,0),(713,83,'昔阳县',140724,0,0,0,0),(714,83,'寿阳县',140725,0,0,0,0),(715,83,'太谷县',140726,0,0,0,0),(716,83,'祁县',140727,0,0,0,0),(717,83,'平遥县',140728,0,0,0,0),(718,83,'灵石县',140729,0,0,0,0),(719,83,'介休市',140781,0,0,0,0),(720,84,'盐湖区',140802,0,0,0,0),(721,84,'临猗县',140821,0,0,0,0),(722,84,'万荣县',140822,0,0,0,0),(723,84,'闻喜县',140823,0,0,0,0),(724,84,'稷山县',140824,0,0,0,0),(725,84,'新绛县',140825,0,0,0,0),(726,84,'绛县',140826,0,0,0,0),(727,84,'垣曲县',140827,0,0,0,0),(728,84,'夏县',140828,0,0,0,0),(729,84,'平陆县',140829,0,0,0,0),(730,84,'芮城县',140830,0,0,0,0),(731,84,'永济市',140881,0,0,0,0),(732,84,'河津市',140882,0,0,0,0),(733,85,'忻府区',140902,0,0,0,0),(734,85,'定襄县',140921,0,0,0,0),(735,85,'五台县',140922,0,0,0,0),(736,85,'代县',140923,0,0,0,0),(737,85,'繁峙县',140924,0,0,0,0),(738,85,'宁武县',140925,0,0,0,0),(739,85,'静乐县',140926,0,0,0,0),(740,85,'神池县',140927,0,0,0,0),(741,85,'五寨县',140928,0,0,0,0),(742,85,'岢岚县',140929,0,0,0,0),(743,85,'河曲县',140930,0,0,0,0),(744,85,'保德县',140931,0,0,0,0),(745,85,'偏关县',140932,0,0,0,0),(746,85,'原平市',140981,0,0,0,0),(747,86,'尧都区',141002,0,0,0,0),(748,86,'曲沃县',141021,0,0,0,0),(749,86,'翼城县',141022,0,0,0,0),(750,86,'襄汾县',141023,0,0,0,0),(751,86,'洪洞县',141024,0,0,0,0),(752,86,'古县',141025,0,0,0,0),(753,86,'安泽县',141026,0,0,0,0),(754,86,'浮山县',141027,0,0,0,0),(755,86,'吉县',141028,0,0,0,0),(756,86,'乡宁县',141029,0,0,0,0),(757,86,'大宁县',141030,0,0,0,0),(758,86,'隰县',141031,0,0,0,0),(759,86,'永和县',141032,0,0,0,0),(760,86,'蒲县',141033,0,0,0,0),(761,86,'汾西县',141034,0,0,0,0),(762,86,'侯马市',141081,0,0,0,0),(763,86,'霍州市',141082,0,0,0,0),(764,87,'离石区',141102,0,0,0,0),(765,87,'文水县',141121,0,0,0,0),(766,87,'交城县',141122,0,0,0,0),(767,87,'兴县',141123,0,0,0,0),(768,87,'临县',141124,0,0,0,0),(769,87,'柳林县',141125,0,0,0,0),(770,87,'石楼县',141126,0,0,0,0),(771,87,'岚县',141127,0,0,0,0),(772,87,'方山县',141128,0,0,0,0),(773,87,'中阳县',141129,0,0,0,0),(774,87,'交口县',141130,0,0,0,0),(775,87,'孝义市',141181,0,0,0,0),(776,87,'汾阳市',141182,0,0,0,0),(777,88,'新城区',150102,0,0,0,0),(778,88,'回民区',150103,0,0,0,0),(779,88,'玉泉区',150104,0,0,0,0),(780,88,'赛罕区',150105,0,0,0,0),(781,88,'土默特左旗',150121,0,0,0,0),(782,88,'托克托县',150122,0,0,0,0),(783,88,'和林格尔县',150123,0,0,0,0),(784,88,'清水河县',150124,0,0,0,0),(785,88,'武川县',150125,0,0,0,0),(786,89,'东河区',150202,0,0,0,0),(787,89,'昆都仑区',150203,0,0,0,0),(788,89,'青山区',150204,0,0,0,0),(789,89,'石拐区',150205,0,0,0,0),(790,89,'白云鄂博矿区',150206,0,0,0,0),(791,89,'九原区',150207,0,0,0,0),(792,89,'土默特右旗',150221,0,0,0,0),(793,89,'固阳县',150222,0,0,0,0),(794,89,'达尔罕茂明安联合旗',150223,0,0,0,0),(795,90,'海勃湾区',150302,0,0,0,0),(796,90,'海南区',150303,0,0,0,0),(797,90,'乌达区',150304,0,0,0,0),(798,91,'红山区',150402,0,0,0,0),(799,91,'元宝山区',150403,0,0,0,0),(800,91,'松山区',150404,0,0,0,0),(801,91,'阿鲁科尔沁旗',150421,0,0,0,0),(802,91,'巴林左旗',150422,0,0,0,0),(803,91,'巴林右旗',150423,0,0,0,0),(804,91,'林西县',150424,0,0,0,0),(805,91,'克什克腾旗',150425,0,0,0,0),(806,91,'翁牛特旗',150426,0,0,0,0),(807,91,'喀喇沁旗',150428,0,0,0,0),(808,91,'宁城县',150429,0,0,0,0),(809,91,'敖汉旗',150430,0,0,0,0),(810,92,'科尔沁区',150502,0,0,0,0),(811,92,'科尔沁左翼中旗',150521,0,0,0,0),(812,92,'科尔沁左翼后旗',150522,0,0,0,0),(813,92,'开鲁县',150523,0,0,0,0),(814,92,'库伦旗',150524,0,0,0,0),(815,92,'奈曼旗',150525,0,0,0,0),(816,92,'扎鲁特旗',150526,0,0,0,0),(817,92,'霍林郭勒市',150581,0,0,0,0),(818,93,'东胜区',150602,0,0,0,0),(819,93,'达拉特旗',150621,0,0,0,0),(820,93,'准格尔旗',150622,0,0,0,0),(821,93,'鄂托克前旗',150623,0,0,0,0),(822,93,'鄂托克旗',150624,0,0,0,0),(823,93,'杭锦旗',150625,0,0,0,0),(824,93,'乌审旗',150626,0,0,0,0),(825,93,'伊金霍洛旗',150627,0,0,0,0),(826,94,'海拉尔区',150702,0,0,0,0),(827,94,'扎赉诺尔区',150703,0,0,0,0),(828,94,'阿荣旗',150721,0,0,0,0),(829,94,'莫力达瓦达斡尔族',150722,0,0,0,0),(830,94,'鄂伦春',150723,0,0,0,0),(831,94,'鄂温克族',150724,0,0,0,0),(832,94,'陈巴尔虎旗',150725,0,0,0,0),(833,94,'新巴尔虎左旗',150726,0,0,0,0),(834,94,'新巴尔虎右旗',150727,0,0,0,0),(835,94,'满洲里市',150781,0,0,0,0),(836,94,'牙克石市',150782,0,0,0,0),(837,94,'扎兰屯市',150783,0,0,0,0),(838,94,'额尔古纳市',150784,0,0,0,0),(839,94,'根河市',150785,0,0,0,0),(840,95,'临河区',150802,0,0,0,0),(841,95,'五原县',150821,0,0,0,0),(842,95,'磴口县',150822,0,0,0,0),(843,95,'乌拉特前旗',150823,0,0,0,0),(844,95,'乌拉特中旗',150824,0,0,0,0),(845,95,'乌拉特后旗',150825,0,0,0,0),(846,95,'杭锦后旗',150826,0,0,0,0),(847,96,'集宁区',150902,0,0,0,0),(848,96,'卓资县',150921,0,0,0,0),(849,96,'化德县',150922,0,0,0,0),(850,96,'商都县',150923,0,0,0,0),(851,96,'兴和县',150924,0,0,0,0),(852,96,'凉城县',150925,0,0,0,0),(853,96,'察哈尔右翼前旗',150926,0,0,0,0),(854,96,'察哈尔右翼中旗',150927,0,0,0,0),(855,96,'察哈尔右翼后旗',150928,0,0,0,0),(856,96,'四子王旗',150929,0,0,0,0),(857,96,'丰镇市',150981,0,0,0,0),(858,97,'乌兰浩特市',152201,0,0,0,0),(859,97,'阿尔山市',152202,0,0,0,0),(860,97,'科尔沁右翼前旗',152221,0,0,0,0),(861,97,'科尔沁右翼中旗',152222,0,0,0,0),(862,97,'扎赉特旗',152223,0,0,0,0),(863,97,'突泉县',152224,0,0,0,0),(864,98,'二连浩特市',152501,0,0,0,0),(865,98,'锡林浩特市',152502,0,0,0,0),(866,98,'阿巴嘎旗',152522,0,0,0,0),(867,98,'苏尼特左旗',152523,0,0,0,0),(868,98,'苏尼特右旗',152524,0,0,0,0),(869,98,'东乌珠穆沁旗',152525,0,0,0,0),(870,98,'西乌珠穆沁旗',152526,0,0,0,0),(871,98,'太仆寺旗',152527,0,0,0,0),(872,98,'镶黄旗',152528,0,0,0,0),(873,98,'正镶白旗',152529,0,0,0,0),(874,98,'正蓝旗',152530,0,0,0,0),(875,98,'多伦县',152531,0,0,0,0),(876,99,'阿拉善左旗',152921,0,0,0,0),(877,99,'阿拉善右旗',152922,0,0,0,0),(878,99,'额济纳旗',152923,0,0,0,0),(879,100,'和平区',210102,0,0,0,0),(880,100,'沈河区',210103,0,0,0,0),(881,100,'大东区',210104,0,0,0,0),(882,100,'皇姑区',210105,0,0,0,0),(883,100,'铁西区',210106,0,0,0,0),(884,100,'苏家屯区',210111,0,0,0,0),(885,100,'浑南区',210112,0,0,0,0),(886,100,'沈北新区',210113,0,0,0,0),(887,100,'于洪区',210114,0,0,0,0),(888,100,'辽中县',210122,0,0,0,0),(889,100,'康平县',210123,0,0,0,0),(890,100,'法库县',210124,0,0,0,0),(891,100,'新民市',210181,0,0,0,0),(892,101,'中山区',210202,0,0,0,0),(893,101,'西岗区',210203,0,0,0,0),(894,101,'沙河口区',210204,0,0,0,0),(895,101,'甘井子区',210211,0,0,0,0),(896,101,'旅顺口区',210212,0,0,0,0),(897,101,'金州区',210213,0,0,0,0),(898,101,'长海县',210224,0,0,0,0),(899,101,'瓦房店市',210281,0,0,0,0),(900,101,'普兰店市',210282,0,0,0,0),(901,101,'庄河市',210283,0,0,0,0),(902,102,'铁东区',210302,0,0,0,0),(903,102,'铁西区',210303,0,0,0,0),(904,102,'立山区',210304,0,0,0,0),(905,102,'千山区',210311,0,0,0,0),(906,102,'台安县',210321,0,0,0,0),(907,102,'岫岩满族',210323,0,0,0,0),(908,102,'海城市',210381,0,0,0,0),(909,103,'新抚区',210402,0,0,0,0),(910,103,'东洲区',210403,0,0,0,0),(911,103,'望花区',210404,0,0,0,0),(912,103,'顺城区',210411,0,0,0,0),(913,103,'抚顺县',210421,0,0,0,0),(914,103,'新宾满族',210422,0,0,0,0),(915,103,'清原满族',210423,0,0,0,0),(916,104,'平山区',210502,0,0,0,0),(917,104,'溪湖区',210503,0,0,0,0),(918,104,'明山区',210504,0,0,0,0),(919,104,'南芬区',210505,0,0,0,0),(920,104,'本溪满族',210521,0,0,0,0),(921,104,'桓仁满族',210522,0,0,0,0),(922,105,'元宝区',210602,0,0,0,0),(923,105,'振兴区',210603,0,0,0,0),(924,105,'振安区',210604,0,0,0,0),(925,105,'宽甸满族',210624,0,0,0,0),(926,105,'东港市',210681,0,0,0,0),(927,105,'凤城市',210682,0,0,0,0),(928,106,'古塔区',210702,0,0,0,0),(929,106,'凌河区',210703,0,0,0,0),(930,106,'太和区',210711,0,0,0,0),(931,106,'黑山县',210726,0,0,0,0),(932,106,'义县',210727,0,0,0,0),(933,106,'凌海市',210781,0,0,0,0),(934,106,'北镇市',210782,0,0,0,0),(935,107,'站前区',210802,0,0,0,0),(936,107,'西市区',210803,0,0,0,0),(937,107,'鲅鱼圈区',210804,0,0,0,0),(938,107,'老边区',210811,0,0,0,0),(939,107,'盖州市',210881,0,0,0,0),(940,107,'大石桥市',210882,0,0,0,0),(941,108,'海州区',210902,0,0,0,0),(942,108,'新邱区',210903,0,0,0,0),(943,108,'太平区',210904,0,0,0,0),(944,108,'清河门区',210905,0,0,0,0),(945,108,'细河区',210911,0,0,0,0),(946,108,'阜新蒙古族',210921,0,0,0,0),(947,108,'彰武县',210922,0,0,0,0),(948,109,'白塔区',211002,0,0,0,0),(949,109,'文圣区',211003,0,0,0,0),(950,109,'宏伟区',211004,0,0,0,0),(951,109,'弓长岭区',211005,0,0,0,0),(952,109,'太子河区',211011,0,0,0,0),(953,109,'辽阳县',211021,0,0,0,0),(954,109,'灯塔市',211081,0,0,0,0),(955,110,'双台子区',211102,0,0,0,0),(956,110,'兴隆台区',211103,0,0,0,0),(957,110,'大洼县',211121,0,0,0,0),(958,110,'盘山县',211122,0,0,0,0),(959,111,'银州区',211202,0,0,0,0),(960,111,'清河区',211204,0,0,0,0),(961,111,'铁岭县',211221,0,0,0,0),(962,111,'西丰县',211223,0,0,0,0),(963,111,'昌图县',211224,0,0,0,0),(964,111,'调兵山市',211281,0,0,0,0),(965,111,'开原市',211282,0,0,0,0),(966,112,'双塔区',211302,0,0,0,0),(967,112,'龙城区',211303,0,0,0,0),(968,112,'朝阳县',211321,0,0,0,0),(969,112,'建平县',211322,0,0,0,0),(970,112,'喀喇沁左翼蒙古族',211324,0,0,0,0),(971,112,'北票市',211381,0,0,0,0),(972,112,'凌源市',211382,0,0,0,0),(973,113,'连山区',211402,0,0,0,0),(974,113,'龙港区',211403,0,0,0,0),(975,113,'南票区',211404,0,0,0,0),(976,113,'绥中县',211421,0,0,0,0),(977,113,'建昌县',211422,0,0,0,0),(978,113,'兴城市',211481,0,0,0,0),(979,114,'南关区',220102,0,0,0,0),(980,114,'宽城区',220103,0,0,0,0),(981,114,'朝阳区',220104,0,0,0,0),(982,114,'二道区',220105,0,0,0,0),(983,114,'绿园区',220106,0,0,0,0),(984,114,'双阳区',220112,0,0,0,0),(985,114,'九台区',220113,0,0,0,0),(986,114,'农安县',220122,0,0,0,0),(987,114,'榆树市',220182,0,0,0,0),(988,114,'德惠市',220183,0,0,0,0),(989,115,'昌邑区',220202,0,0,0,0),(990,115,'龙潭区',220203,0,0,0,0),(991,115,'船营区',220204,0,0,0,0),(992,115,'丰满区',220211,0,0,0,0),(993,115,'永吉县',220221,0,0,0,0),(994,115,'蛟河市',220281,0,0,0,0),(995,115,'桦甸市',220282,0,0,0,0),(996,115,'舒兰市',220283,0,0,0,0),(997,115,'磐石市',220284,0,0,0,0),(998,116,'铁西区',220302,0,0,0,0),(999,116,'铁东区',220303,0,0,0,0),(1000,116,'梨树县',220322,0,0,0,0),(1001,116,'伊通满族',220323,0,0,0,0),(1002,116,'公主岭市',220381,0,0,0,0),(1003,116,'双辽市',220382,0,0,0,0),(1004,117,'龙山区',220402,0,0,0,0),(1005,117,'西安区',220403,0,0,0,0),(1006,117,'东丰县',220421,0,0,0,0),(1007,117,'东辽县',220422,0,0,0,0),(1008,118,'东昌区',220502,0,0,0,0),(1009,118,'二道江区',220503,0,0,0,0),(1010,118,'通化县',220521,0,0,0,0),(1011,118,'辉南县',220523,0,0,0,0),(1012,118,'柳河县',220524,0,0,0,0),(1013,118,'梅河口市',220581,0,0,0,0),(1014,118,'集安市',220582,0,0,0,0),(1015,119,'浑江区',220602,0,0,0,0),(1016,119,'江源区',220605,0,0,0,0),(1017,119,'抚松县',220621,0,0,0,0),(1018,119,'靖宇县',220622,0,0,0,0),(1019,119,'长白朝鲜族',220623,0,0,0,0),(1020,119,'临江市',220681,0,0,0,0),(1021,120,'宁江区',220702,0,0,0,0),(1022,120,'前郭尔罗斯蒙古族',220721,0,0,0,0),(1023,120,'长岭县',220722,0,0,0,0),(1024,120,'乾安县',220723,0,0,0,0),(1025,120,'扶余市',220781,0,0,0,0),(1026,121,'洮北区',220802,0,0,0,0),(1027,121,'镇赉县',220821,0,0,0,0),(1028,121,'通榆县',220822,0,0,0,0),(1029,121,'洮南市',220881,0,0,0,0),(1030,121,'大安市',220882,0,0,0,0),(1031,122,'延吉市',222401,0,0,0,0),(1032,122,'图们市',222402,0,0,0,0),(1033,122,'敦化市',222403,0,0,0,0),(1034,122,'珲春市',222404,0,0,0,0),(1035,122,'龙井市',222405,0,0,0,0),(1036,122,'和龙市',222406,0,0,0,0),(1037,122,'汪清县',222424,0,0,0,0),(1038,122,'安图县',222426,0,0,0,0),(1039,123,'道里区',230102,0,0,0,0),(1040,123,'南岗区',230103,0,0,0,0),(1041,123,'道外区',230104,0,0,0,0),(1042,123,'平房区',230108,0,0,0,0),(1043,123,'松北区',230109,0,0,0,0),(1044,123,'香坊区',230110,0,0,0,0),(1045,123,'呼兰区',230111,0,0,0,0),(1046,123,'阿城区',230112,0,0,0,0),(1047,123,'双城区',230113,0,0,0,0),(1048,123,'依兰县',230123,0,0,0,0),(1049,123,'方正县',230124,0,0,0,0),(1050,123,'宾县',230125,0,0,0,0),(1051,123,'巴彦县',230126,0,0,0,0),(1052,123,'木兰县',230127,0,0,0,0),(1053,123,'通河县',230128,0,0,0,0),(1054,123,'延寿县',230129,0,0,0,0),(1055,123,'尚志市',230183,0,0,0,0),(1056,123,'五常市',230184,0,0,0,0),(1057,124,'龙沙区',230202,0,0,0,0),(1058,124,'建华区',230203,0,0,0,0),(1059,124,'铁锋区',230204,0,0,0,0),(1060,124,'昂昂溪区',230205,0,0,0,0),(1061,124,'富拉尔基区',230206,0,0,0,0),(1062,124,'碾子山区',230207,0,0,0,0),(1063,124,'梅里斯达斡尔族区',230208,0,0,0,0),(1064,124,'龙江县',230221,0,0,0,0),(1065,124,'依安县',230223,0,0,0,0),(1066,124,'泰来县',230224,0,0,0,0),(1067,124,'甘南县',230225,0,0,0,0),(1068,124,'富裕县',230227,0,0,0,0),(1069,124,'克山县',230229,0,0,0,0),(1070,124,'克东县',230230,0,0,0,0),(1071,124,'拜泉县',230231,0,0,0,0),(1072,124,'讷河市',230281,0,0,0,0),(1073,125,'鸡冠区',230302,0,0,0,0),(1074,125,'恒山区',230303,0,0,0,0),(1075,125,'滴道区',230304,0,0,0,0),(1076,125,'梨树区',230305,0,0,0,0),(1077,125,'城子河区',230306,0,0,0,0),(1078,125,'麻山区',230307,0,0,0,0),(1079,125,'鸡东县',230321,0,0,0,0),(1080,125,'虎林市',230381,0,0,0,0),(1081,125,'密山市',230382,0,0,0,0),(1082,126,'向阳区',230402,0,0,0,0),(1083,126,'工农区',230403,0,0,0,0),(1084,126,'南山区',230404,0,0,0,0),(1085,126,'兴安区',230405,0,0,0,0),(1086,126,'东山区',230406,0,0,0,0),(1087,126,'兴山区',230407,0,0,0,0),(1088,126,'萝北县',230421,0,0,0,0),(1089,126,'绥滨县',230422,0,0,0,0),(1090,127,'尖山区',230502,0,0,0,0),(1091,127,'岭东区',230503,0,0,0,0),(1092,127,'四方台区',230505,0,0,0,0),(1093,127,'宝山区',230506,0,0,0,0),(1094,127,'集贤县',230521,0,0,0,0),(1095,127,'友谊县',230522,0,0,0,0),(1096,127,'宝清县',230523,0,0,0,0),(1097,127,'饶河县',230524,0,0,0,0),(1098,128,'萨尔图区',230602,0,0,0,0),(1099,128,'龙凤区',230603,0,0,0,0),(1100,128,'让胡路区',230604,0,0,0,0),(1101,128,'红岗区',230605,0,0,0,0),(1102,128,'大同区',230606,0,0,0,0),(1103,128,'肇州县',230621,0,0,0,0),(1104,128,'肇源县',230622,0,0,0,0),(1105,128,'林甸县',230623,0,0,0,0),(1106,128,'杜尔伯特蒙古族',230624,0,0,0,0),(1107,129,'伊春区',230702,0,0,0,0),(1108,129,'南岔区',230703,0,0,0,0),(1109,129,'友好区',230704,0,0,0,0),(1110,129,'西林区',230705,0,0,0,0),(1111,129,'翠峦区',230706,0,0,0,0),(1112,129,'新青区',230707,0,0,0,0),(1113,129,'美溪区',230708,0,0,0,0),(1114,129,'金山屯区',230709,0,0,0,0),(1115,129,'五营区',230710,0,0,0,0),(1116,129,'乌马河区',230711,0,0,0,0),(1117,129,'汤旺河区',230712,0,0,0,0),(1118,129,'带岭区',230713,0,0,0,0),(1119,129,'乌伊岭区',230714,0,0,0,0),(1120,129,'红星区',230715,0,0,0,0),(1121,129,'上甘岭区',230716,0,0,0,0),(1122,129,'嘉荫县',230722,0,0,0,0),(1123,129,'铁力市',230781,0,0,0,0),(1124,130,'向阳区',230803,0,0,0,0),(1125,130,'前进区',230804,0,0,0,0),(1126,130,'东风区',230805,0,0,0,0),(1127,130,'郊区',230811,0,0,0,0),(1128,130,'桦南县',230822,0,0,0,0),(1129,130,'桦川县',230826,0,0,0,0),(1130,130,'汤原县',230828,0,0,0,0),(1131,130,'抚远县',230833,0,0,0,0),(1132,130,'同江市',230881,0,0,0,0),(1133,130,'富锦市',230882,0,0,0,0),(1134,131,'新兴区',230902,0,0,0,0),(1135,131,'桃山区',230903,0,0,0,0),(1136,131,'茄子河区',230904,0,0,0,0),(1137,131,'勃利县',230921,0,0,0,0),(1138,132,'东安区',231002,0,0,0,0),(1139,132,'阳明区',231003,0,0,0,0),(1140,132,'爱民区',231004,0,0,0,0),(1141,132,'西安区',231005,0,0,0,0),(1142,132,'东宁县',231024,0,0,0,0),(1143,132,'林口县',231025,0,0,0,0),(1144,132,'绥芬河市',231081,0,0,0,0),(1145,132,'海林市',231083,0,0,0,0),(1146,132,'宁安市',231084,0,0,0,0),(1147,132,'穆棱市',231085,0,0,0,0),(1148,133,'爱辉区',231102,0,0,0,0),(1149,133,'嫩江县',231121,0,0,0,0),(1150,133,'逊克县',231123,0,0,0,0),(1151,133,'孙吴县',231124,0,0,0,0),(1152,133,'北安市',231181,0,0,0,0),(1153,133,'五大连池市',231182,0,0,0,0),(1154,134,'北林区',231202,0,0,0,0),(1155,134,'望奎县',231221,0,0,0,0),(1156,134,'兰西县',231222,0,0,0,0),(1157,134,'青冈县',231223,0,0,0,0),(1158,134,'庆安县',231224,0,0,0,0),(1159,134,'明水县',231225,0,0,0,0),(1160,134,'绥棱县',231226,0,0,0,0),(1161,134,'安达市',231281,0,0,0,0),(1162,134,'肇东市',231282,0,0,0,0),(1163,134,'海伦市',231283,0,0,0,0),(1164,135,'加格达奇区',232701,0,0,0,0),(1165,135,'呼玛县',232721,0,0,0,0),(1166,135,'塔河县',232722,0,0,0,0),(1167,135,'漠河县',232723,0,0,0,0),(1168,153,'玄武区',320102,0,0,0,0),(1169,153,'秦淮区',320104,0,0,0,0),(1170,153,'建邺区',320105,0,0,0,0),(1171,153,'鼓楼区',320106,0,0,0,0),(1172,153,'浦口区',320111,0,0,0,0),(1173,153,'栖霞区',320113,0,0,0,0),(1174,153,'雨花台区',320114,0,0,0,0),(1175,153,'江宁区',320115,0,0,0,0),(1176,153,'六合区',320116,0,0,0,0),(1177,153,'溧水区',320117,0,0,0,0),(1178,153,'高淳区',320118,0,0,0,0),(1179,154,'崇安区',320202,0,0,0,0),(1180,154,'南长区',320203,0,0,0,0),(1181,154,'北塘区',320204,0,0,0,0),(1182,154,'锡山区',320205,0,0,0,0),(1183,154,'惠山区',320206,0,0,0,0),(1184,154,'滨湖区',320211,0,0,0,0),(1185,154,'江阴市',320281,0,0,0,0),(1186,154,'宜兴市',320282,0,0,0,0),(1187,155,'鼓楼区',320302,0,0,0,0),(1188,155,'云龙区',320303,0,0,0,0),(1189,155,'贾汪区',320305,0,0,0,0),(1190,155,'泉山区',320311,0,0,0,0),(1191,155,'铜山区',320312,0,0,0,0),(1192,155,'丰县',320321,0,0,0,0),(1193,155,'沛县',320322,0,0,0,0),(1194,155,'睢宁县',320324,0,0,0,0),(1195,155,'新沂市',320381,0,0,0,0),(1196,155,'邳州市',320382,0,0,0,0),(1197,156,'天宁区',320402,0,0,0,0),(1198,156,'钟楼区',320404,0,0,0,0),(1199,156,'新北区',320411,0,0,0,0),(1200,156,'武进区',320412,0,0,0,0),(1201,156,'溧阳市',320481,0,0,0,0),(1202,156,'金坛区',320482,0,0,0,0),(1203,157,'虎丘区',320505,0,0,0,0),(1204,157,'吴中区',320506,0,0,0,0),(1205,157,'相城区',320507,0,0,0,0),(1206,157,'姑苏区',320508,0,0,0,0),(1207,157,'吴江区',320509,0,0,0,0),(1208,157,'常熟市',320581,0,0,0,0),(1209,157,'张家港市',320582,0,0,0,0),(1210,157,'昆山市',320583,0,0,0,0),(1211,157,'太仓市',320585,0,0,0,0),(1212,158,'崇川区',320602,0,0,0,0),(1213,158,'港闸区',320611,0,0,0,0),(1214,158,'通州区',320612,0,0,0,0),(1215,158,'海安县',320621,0,0,0,0),(1216,158,'如东县',320623,0,0,0,0),(1217,158,'启东市',320681,0,0,0,0),(1218,158,'如皋市',320682,0,0,0,0),(1219,158,'海门市',320684,0,0,0,0),(1220,159,'连云区',320703,0,0,0,0),(1221,159,'海州区',320706,0,0,0,0),(1222,159,'赣榆区',320707,0,0,0,0),(1223,159,'东海县',320722,0,0,0,0),(1224,159,'灌云县',320723,0,0,0,0),(1225,159,'灌南县',320724,0,0,0,0),(1226,160,'清河区',320802,0,0,0,0),(1227,160,'淮安区',320803,0,0,0,0),(1228,160,'淮阴区',320804,0,0,0,0),(1229,160,'清浦区',320811,0,0,0,0),(1230,160,'涟水县',320826,0,0,0,0),(1231,160,'洪泽县',320829,0,0,0,0),(1232,160,'盱眙县',320830,0,0,0,0),(1233,160,'金湖县',320831,0,0,0,0),(1234,161,'亭湖区',320902,0,0,0,0),(1235,161,'盐都区',320903,0,0,0,0),(1236,161,'响水县',320921,0,0,0,0),(1237,161,'滨海县',320922,0,0,0,0),(1238,161,'阜宁县',320923,0,0,0,0),(1239,161,'射阳县',320924,0,0,0,0),(1240,161,'建湖县',320925,0,0,0,0),(1241,161,'东台市',320981,0,0,0,0),(1242,161,'大丰市',320982,0,0,0,0),(1243,162,'广陵区',321002,0,0,0,0),(1244,162,'邗江区',321003,0,0,0,0),(1245,162,'江都区',321012,0,0,0,0),(1246,162,'宝应县',321023,0,0,0,0),(1247,162,'仪征市',321081,0,0,0,0),(1248,162,'高邮市',321084,0,0,0,0),(1249,163,'京口区',321102,0,0,0,0),(1250,163,'润州区',321111,0,0,0,0),(1251,163,'丹徒区',321112,0,0,0,0),(1252,163,'丹阳市',321181,0,0,0,0),(1253,163,'扬中市',321182,0,0,0,0),(1254,163,'句容市',321183,0,0,0,0),(1255,164,'海陵区',321202,0,0,0,0),(1256,164,'高港区',321203,0,0,0,0),(1257,164,'姜堰区',321204,0,0,0,0),(1258,164,'兴化市',321281,0,0,0,0),(1259,164,'靖江市',321282,0,0,0,0),(1260,164,'泰兴市',321283,0,0,0,0),(1261,165,'宿城区',321302,0,0,0,0),(1262,165,'宿豫区',321311,0,0,0,0),(1263,165,'沭阳县',321322,0,0,0,0),(1264,165,'泗阳县',321323,0,0,0,0),(1265,165,'泗洪县',321324,0,0,0,0),(1266,166,'上城区',330102,0,0,0,0),(1267,166,'下城区',330103,0,0,0,0),(1268,166,'江干区',330104,0,0,0,0),(1269,166,'拱墅区',330105,0,0,0,0),(1270,166,'西湖区',330106,0,0,0,0),(1271,166,'滨江区',330108,0,0,0,0),(1272,166,'萧山区',330109,0,0,0,0),(1273,166,'余杭区',330110,0,0,0,0),(1274,166,'富阳区',330111,0,0,0,0),(1275,166,'桐庐县',330122,0,0,0,0),(1276,166,'淳安县',330127,0,0,0,0),(1277,166,'建德市',330182,0,0,0,0),(1278,166,'临安市',330185,0,0,0,0),(1279,167,'海曙区',330203,0,0,0,0),(1280,167,'江东区',330204,0,0,0,0),(1281,167,'江北区',330205,0,0,0,0),(1282,167,'北仑区',330206,0,0,0,0),(1283,167,'镇海区',330211,0,0,0,0),(1284,167,'鄞州区',330212,0,0,0,0),(1285,167,'象山县',330225,0,0,0,0),(1286,167,'宁海县',330226,0,0,0,0),(1287,167,'余姚市',330281,0,0,0,0),(1288,167,'慈溪市',330282,0,0,0,0),(1289,167,'奉化市',330283,0,0,0,0),(1290,168,'鹿城区',330302,0,0,0,0),(1291,168,'龙湾区',330303,0,0,0,0),(1292,168,'瓯海区',330304,0,0,0,0),(1293,168,'洞头县',330322,0,0,0,0),(1294,168,'永嘉县',330324,0,0,0,0),(1295,168,'平阳县',330326,0,0,0,0),(1296,168,'苍南县',330327,0,0,0,0),(1297,168,'文成县',330328,0,0,0,0),(1298,168,'泰顺县',330329,0,0,0,0),(1299,168,'瑞安市',330381,0,0,0,0),(1300,168,'乐清市',330382,0,0,0,0),(1301,169,'南湖区',330402,0,0,0,0),(1302,169,'秀洲区',330411,0,0,0,0),(1303,169,'嘉善县',330421,0,0,0,0),(1304,169,'海盐县',330424,0,0,0,0),(1305,169,'海宁市',330481,0,0,0,0),(1306,169,'平湖市',330482,0,0,0,0),(1307,169,'桐乡市',330483,0,0,0,0),(1308,170,'吴兴区',330502,0,0,0,0),(1309,170,'南浔区',330503,0,0,0,0),(1310,170,'德清县',330521,0,0,0,0),(1311,170,'长兴县',330522,0,0,0,0),(1312,170,'安吉县',330523,0,0,0,0),(1313,171,'越城区',330602,0,0,0,0),(1314,171,'柯桥区',330603,0,0,0,0),(1315,171,'上虞区',330604,0,0,0,0),(1316,171,'新昌县',330624,0,0,0,0),(1317,171,'诸暨市',330681,0,0,0,0),(1318,171,'嵊州市',330683,0,0,0,0),(1319,172,'婺城区',330702,0,0,0,0),(1320,172,'金东区',330703,0,0,0,0),(1321,172,'武义县',330723,0,0,0,0),(1322,172,'浦江县',330726,0,0,0,0),(1323,172,'磐安县',330727,0,0,0,0),(1324,172,'兰溪市',330781,0,0,0,0),(1325,172,'义乌市',330782,0,0,0,0),(1326,172,'东阳市',330783,0,0,0,0),(1327,172,'永康市',330784,0,0,0,0),(1328,173,'柯城区',330802,0,0,0,0),(1329,173,'衢江区',330803,0,0,0,0),(1330,173,'常山县',330822,0,0,0,0),(1331,173,'开化县',330824,0,0,0,0),(1332,173,'龙游县',330825,0,0,0,0),(1333,173,'江山市',330881,0,0,0,0),(1334,174,'定海区',330902,0,0,0,0),(1335,174,'普陀区',330903,0,0,0,0),(1336,174,'岱山县',330921,0,0,0,0),(1337,174,'嵊泗县',330922,0,0,0,0),(1338,175,'椒江区',331002,0,0,0,0),(1339,175,'黄岩区',331003,0,0,0,0),(1340,175,'路桥区',331004,0,0,0,0),(1341,175,'玉环县',331021,0,0,0,0),(1342,175,'三门县',331022,0,0,0,0),(1343,175,'天台县',331023,0,0,0,0),(1344,175,'仙居县',331024,0,0,0,0),(1345,175,'温岭市',331081,0,0,0,0),(1346,175,'临海市',331082,0,0,0,0),(1347,176,'莲都区',331102,0,0,0,0),(1348,176,'青田县',331121,0,0,0,0),(1349,176,'缙云县',331122,0,0,0,0),(1350,176,'遂昌县',331123,0,0,0,0),(1351,176,'松阳县',331124,0,0,0,0),(1352,176,'云和县',331125,0,0,0,0),(1353,176,'庆元县',331126,0,0,0,0),(1354,176,'景宁畲族',331127,0,0,0,0),(1355,176,'龙泉市',331181,0,0,0,0),(1356,177,'瑶海区',340102,0,0,0,0),(1357,177,'庐阳区',340103,0,0,0,0),(1358,177,'蜀山区',340104,0,0,0,0),(1359,177,'包河区',340111,0,0,0,0),(1360,177,'长丰县',340121,0,0,0,0),(1361,177,'肥东县',340122,0,0,0,0),(1362,177,'肥西县',340123,0,0,0,0),(1363,177,'庐江县',340124,0,0,0,0),(1364,177,'巢湖市',340181,0,0,0,0),(1365,178,'镜湖区',340202,0,0,0,0),(1366,178,'弋江区',340203,0,0,0,0),(1367,178,'鸠江区',340207,0,0,0,0),(1368,178,'三山区',340208,0,0,0,0),(1369,178,'芜湖县',340221,0,0,0,0),(1370,178,'繁昌县',340222,0,0,0,0),(1371,178,'南陵县',340223,0,0,0,0),(1372,178,'无为县',340225,0,0,0,0),(1373,179,'龙子湖区',340302,0,0,0,0),(1374,179,'蚌山区',340303,0,0,0,0),(1375,179,'禹会区',340304,0,0,0,0),(1376,179,'淮上区',340311,0,0,0,0),(1377,179,'怀远县',340321,0,0,0,0),(1378,179,'五河县',340322,0,0,0,0),(1379,179,'固镇县',340323,0,0,0,0),(1380,180,'大通区',340402,0,0,0,0),(1381,180,'田家庵区',340403,0,0,0,0),(1382,180,'谢家集区',340404,0,0,0,0),(1383,180,'八公山区',340405,0,0,0,0),(1384,180,'潘集区',340406,0,0,0,0),(1385,180,'凤台县',340421,0,0,0,0),(1386,181,'花山区',340503,0,0,0,0),(1387,181,'雨山区',340504,0,0,0,0),(1388,181,'博望区',340506,0,0,0,0),(1389,181,'当涂县',340521,0,0,0,0),(1390,181,'含山县',340522,0,0,0,0),(1391,181,'和县',340523,0,0,0,0),(1392,182,'杜集区',340602,0,0,0,0),(1393,182,'相山区',340603,0,0,0,0),(1394,182,'烈山区',340604,0,0,0,0),(1395,182,'濉溪县',340621,0,0,0,0),(1396,183,'铜官山区',340702,0,0,0,0),(1397,183,'狮子山区',340703,0,0,0,0),(1398,183,'郊区',340711,0,0,0,0),(1399,183,'铜陵县',340721,0,0,0,0),(1400,184,'迎江区',340802,0,0,0,0),(1401,184,'大观区',340803,0,0,0,0),(1402,184,'宜秀区',340811,0,0,0,0),(1403,184,'怀宁县',340822,0,0,0,0),(1404,184,'枞阳县',340823,0,0,0,0),(1405,184,'潜山县',340824,0,0,0,0),(1406,184,'太湖县',340825,0,0,0,0),(1407,184,'宿松县',340826,0,0,0,0),(1408,184,'望江县',340827,0,0,0,0),(1409,184,'岳西县',340828,0,0,0,0),(1410,184,'桐城市',340881,0,0,0,0),(1411,185,'屯溪区',341002,0,0,0,0),(1412,185,'黄山区',341003,0,0,0,0),(1413,185,'徽州区',341004,0,0,0,0),(1414,185,'歙县',341021,0,0,0,0),(1415,185,'休宁县',341022,0,0,0,0),(1416,185,'黟县',341023,0,0,0,0),(1417,185,'祁门县',341024,0,0,0,0),(1418,186,'琅琊区',341102,0,0,0,0),(1419,186,'南谯区',341103,0,0,0,0),(1420,186,'来安县',341122,0,0,0,0),(1421,186,'全椒县',341124,0,0,0,0),(1422,186,'定远县',341125,0,0,0,0),(1423,186,'凤阳县',341126,0,0,0,0),(1424,186,'天长市',341181,0,0,0,0),(1425,186,'明光市',341182,0,0,0,0),(1426,187,'颍州区',341202,0,0,0,0),(1427,187,'颍东区',341203,0,0,0,0),(1428,187,'颍泉区',341204,0,0,0,0),(1429,187,'临泉县',341221,0,0,0,0),(1430,187,'太和县',341222,0,0,0,0),(1431,187,'阜南县',341225,0,0,0,0),(1432,187,'颍上县',341226,0,0,0,0),(1433,187,'界首市',341282,0,0,0,0),(1434,188,'埇桥区',341302,0,0,0,0),(1435,188,'砀山县',341321,0,0,0,0),(1436,188,'萧县',341322,0,0,0,0),(1437,188,'灵璧县',341323,0,0,0,0),(1438,188,'泗县',341324,0,0,0,0),(1439,189,'金安区',341502,0,0,0,0),(1440,189,'裕安区',341503,0,0,0,0),(1441,189,'寿县',341521,0,0,0,0),(1442,189,'霍邱县',341522,0,0,0,0),(1443,189,'舒城县',341523,0,0,0,0),(1444,189,'金寨县',341524,0,0,0,0),(1445,189,'霍山县',341525,0,0,0,0),(1446,190,'谯城区',341602,0,0,0,0),(1447,190,'涡阳县',341621,0,0,0,0),(1448,190,'蒙城县',341622,0,0,0,0),(1449,190,'利辛县',341623,0,0,0,0),(1450,191,'贵池区',341702,0,0,0,0),(1451,191,'东至县',341721,0,0,0,0),(1452,191,'石台县',341722,0,0,0,0),(1453,191,'青阳县',341723,0,0,0,0),(1454,192,'宣州区',341802,0,0,0,0),(1455,192,'郎溪县',341821,0,0,0,0),(1456,192,'广德县',341822,0,0,0,0),(1457,192,'泾县',341823,0,0,0,0),(1458,192,'绩溪县',341824,0,0,0,0),(1459,192,'旌德县',341825,0,0,0,0),(1460,192,'宁国市',341881,0,0,0,0),(1461,193,'鼓楼区',350102,0,0,0,0),(1462,193,'台江区',350103,0,0,0,0),(1463,193,'仓山区',350104,0,0,0,0),(1464,193,'马尾区',350105,0,0,0,0),(1465,193,'晋安区',350111,0,0,0,0),(1466,193,'闽侯县',350121,0,0,0,0),(1467,193,'连江县',350122,0,0,0,0),(1468,193,'罗源县',350123,0,0,0,0),(1469,193,'闽清县',350124,0,0,0,0),(1470,193,'永泰县',350125,0,0,0,0),(1471,193,'平潭县',350128,0,0,0,0),(1472,193,'福清市',350181,0,0,0,0),(1473,193,'长乐市',350182,0,0,0,0),(1474,194,'思明区',350203,0,0,0,0),(1475,194,'海沧区',350205,0,0,0,0),(1476,194,'湖里区',350206,0,0,0,0),(1477,194,'集美区',350211,0,0,0,0),(1478,194,'同安区',350212,0,0,0,0),(1479,194,'翔安区',350213,0,0,0,0),(1480,195,'城厢区',350302,0,0,0,0),(1481,195,'涵江区',350303,0,0,0,0),(1482,195,'荔城区',350304,0,0,0,0),(1483,195,'秀屿区',350305,0,0,0,0),(1484,195,'仙游县',350322,0,0,0,0),(1485,196,'梅列区',350402,0,0,0,0),(1486,196,'三元区',350403,0,0,0,0),(1487,196,'明溪县',350421,0,0,0,0),(1488,196,'清流县',350423,0,0,0,0),(1489,196,'宁化县',350424,0,0,0,0),(1490,196,'大田县',350425,0,0,0,0),(1491,196,'尤溪县',350426,0,0,0,0),(1492,196,'沙县',350427,0,0,0,0),(1493,196,'将乐县',350428,0,0,0,0),(1494,196,'泰宁县',350429,0,0,0,0),(1495,196,'建宁县',350430,0,0,0,0),(1496,196,'永安市',350481,0,0,0,0),(1497,197,'鲤城区',350502,0,0,0,0),(1498,197,'丰泽区',350503,0,0,0,0),(1499,197,'洛江区',350504,0,0,0,0),(1500,197,'泉港区',350505,0,0,0,0),(1501,197,'惠安县',350521,0,0,0,0),(1502,197,'安溪县',350524,0,0,0,0),(1503,197,'永春县',350525,0,0,0,0),(1504,197,'德化县',350526,0,0,0,0),(1505,197,'金门县',350527,0,0,0,0),(1506,197,'石狮市',350581,0,0,0,0),(1507,197,'晋江市',350582,0,0,0,0),(1508,197,'南安市',350583,0,0,0,0),(1509,198,'芗城区',350602,0,0,0,0),(1510,198,'龙文区',350603,0,0,0,0),(1511,198,'云霄县',350622,0,0,0,0),(1512,198,'漳浦县',350623,0,0,0,0),(1513,198,'诏安县',350624,0,0,0,0),(1514,198,'长泰县',350625,0,0,0,0),(1515,198,'东山县',350626,0,0,0,0),(1516,198,'南靖县',350627,0,0,0,0),(1517,198,'平和县',350628,0,0,0,0),(1518,198,'华安县',350629,0,0,0,0),(1519,198,'龙海市',350681,0,0,0,0),(1520,199,'延平区',350702,0,0,0,0),(1521,199,'建阳区',350703,0,0,0,0),(1522,199,'顺昌县',350721,0,0,0,0),(1523,199,'浦城县',350722,0,0,0,0),(1524,199,'光泽县',350723,0,0,0,0),(1525,199,'松溪县',350724,0,0,0,0),(1526,199,'政和县',350725,0,0,0,0),(1527,199,'邵武市',350781,0,0,0,0),(1528,199,'武夷山市',350782,0,0,0,0),(1529,199,'建瓯市',350783,0,0,0,0),(1530,200,'新罗区',350802,0,0,0,0),(1531,200,'永定区',350803,0,0,0,0),(1532,200,'长汀县',350821,0,0,0,0),(1533,200,'上杭县',350823,0,0,0,0),(1534,200,'武平县',350824,0,0,0,0),(1535,200,'连城县',350825,0,0,0,0),(1536,200,'漳平市',350881,0,0,0,0),(1537,201,'蕉城区',350902,0,0,0,0),(1538,201,'霞浦县',350921,0,0,0,0),(1539,201,'古田县',350922,0,0,0,0),(1540,201,'屏南县',350923,0,0,0,0),(1541,201,'寿宁县',350924,0,0,0,0),(1542,201,'周宁县',350925,0,0,0,0),(1543,201,'柘荣县',350926,0,0,0,0),(1544,201,'福安市',350981,0,0,0,0),(1545,201,'福鼎市',350982,0,0,0,0),(1546,202,'东湖区',360102,0,0,0,0),(1547,202,'西湖区',360103,0,0,0,0),(1548,202,'青云谱区',360104,0,0,0,0),(1549,202,'湾里区',360105,0,0,0,0),(1550,202,'青山湖区',360111,0,0,0,0),(1551,202,'南昌县',360121,0,0,0,0),(1552,202,'新建县',360122,0,0,0,0),(1553,202,'安义县',360123,0,0,0,0),(1554,202,'进贤县',360124,0,0,0,0),(1555,203,'昌江区',360202,0,0,0,0),(1556,203,'珠山区',360203,0,0,0,0),(1557,203,'浮梁县',360222,0,0,0,0),(1558,203,'乐平市',360281,0,0,0,0),(1559,204,'安源区',360302,0,0,0,0),(1560,204,'湘东区',360313,0,0,0,0),(1561,204,'莲花县',360321,0,0,0,0),(1562,204,'上栗县',360322,0,0,0,0),(1563,204,'芦溪县',360323,0,0,0,0),(1564,205,'庐山区',360402,0,0,0,0),(1565,205,'浔阳区',360403,0,0,0,0),(1566,205,'九江县',360421,0,0,0,0),(1567,205,'武宁县',360423,0,0,0,0),(1568,205,'修水县',360424,0,0,0,0),(1569,205,'永修县',360425,0,0,0,0),(1570,205,'德安县',360426,0,0,0,0),(1571,205,'星子县',360427,0,0,0,0),(1572,205,'都昌县',360428,0,0,0,0),(1573,205,'湖口县',360429,0,0,0,0),(1574,205,'彭泽县',360430,0,0,0,0),(1575,205,'瑞昌市',360481,0,0,0,0),(1576,205,'共青城市',360482,0,0,0,0),(1577,206,'渝水区',360502,0,0,0,0),(1578,206,'分宜县',360521,0,0,0,0),(1579,207,'月湖区',360602,0,0,0,0),(1580,207,'余江县',360622,0,0,0,0),(1581,207,'贵溪市',360681,0,0,0,0),(1582,208,'章贡区',360702,0,0,0,0),(1583,208,'南康区',360703,0,0,0,0),(1584,208,'赣县',360721,0,0,0,0),(1585,208,'信丰县',360722,0,0,0,0),(1586,208,'大余县',360723,0,0,0,0),(1587,208,'上犹县',360724,0,0,0,0),(1588,208,'崇义县',360725,0,0,0,0),(1589,208,'安远县',360726,0,0,0,0),(1590,208,'龙南县',360727,0,0,0,0),(1591,208,'定南县',360728,0,0,0,0),(1592,208,'全南县',360729,0,0,0,0),(1593,208,'宁都县',360730,0,0,0,0),(1594,208,'于都县',360731,0,0,0,0),(1595,208,'兴国县',360732,0,0,0,0),(1596,208,'会昌县',360733,0,0,0,0),(1597,208,'寻乌县',360734,0,0,0,0),(1598,208,'石城县',360735,0,0,0,0),(1599,208,'瑞金市',360781,0,0,0,0),(1600,209,'吉州区',360802,0,0,0,0),(1601,209,'青原区',360803,0,0,0,0),(1602,209,'吉安县',360821,0,0,0,0),(1603,209,'吉水县',360822,0,0,0,0),(1604,209,'峡江县',360823,0,0,0,0),(1605,209,'新干县',360824,0,0,0,0),(1606,209,'永丰县',360825,0,0,0,0),(1607,209,'泰和县',360826,0,0,0,0),(1608,209,'遂川县',360827,0,0,0,0),(1609,209,'万安县',360828,0,0,0,0),(1610,209,'安福县',360829,0,0,0,0),(1611,209,'永新县',360830,0,0,0,0),(1612,209,'井冈山市',360881,0,0,0,0),(1613,210,'袁州区',360902,0,0,0,0),(1614,210,'奉新县',360921,0,0,0,0),(1615,210,'万载县',360922,0,0,0,0),(1616,210,'上高县',360923,0,0,0,0),(1617,210,'宜丰县',360924,0,0,0,0),(1618,210,'靖安县',360925,0,0,0,0),(1619,210,'铜鼓县',360926,0,0,0,0),(1620,210,'丰城市',360981,0,0,0,0),(1621,210,'樟树市',360982,0,0,0,0),(1622,210,'高安市',360983,0,0,0,0),(1623,211,'临川区',361002,0,0,0,0),(1624,211,'南城县',361021,0,0,0,0),(1625,211,'黎川县',361022,0,0,0,0),(1626,211,'南丰县',361023,0,0,0,0),(1627,211,'崇仁县',361024,0,0,0,0),(1628,211,'乐安县',361025,0,0,0,0),(1629,211,'宜黄县',361026,0,0,0,0),(1630,211,'金溪县',361027,0,0,0,0),(1631,211,'资溪县',361028,0,0,0,0),(1632,211,'东乡县',361029,0,0,0,0),(1633,211,'广昌县',361030,0,0,0,0),(1634,212,'信州区',361102,0,0,0,0),(1635,212,'广丰区',361103,0,0,0,0),(1636,212,'上饶县',361121,0,0,0,0),(1637,212,'玉山县',361123,0,0,0,0),(1638,212,'铅山县',361124,0,0,0,0),(1639,212,'横峰县',361125,0,0,0,0),(1640,212,'弋阳县',361126,0,0,0,0),(1641,212,'余干县',361127,0,0,0,0),(1642,212,'鄱阳县',361128,0,0,0,0),(1643,212,'万年县',361129,0,0,0,0),(1644,212,'婺源县',361130,0,0,0,0),(1645,212,'德兴市',361181,0,0,0,0),(1646,213,'历下区',370102,0,0,0,0),(1647,213,'市中区',370103,0,0,0,0),(1648,213,'槐荫区',370104,0,0,0,0),(1649,213,'天桥区',370105,0,0,0,0),(1650,213,'历城区',370112,0,0,0,0),(1651,213,'长清区',370113,0,0,0,0),(1652,213,'平阴县',370124,0,0,0,0),(1653,213,'济阳县',370125,0,0,0,0),(1654,213,'商河县',370126,0,0,0,0),(1655,213,'章丘市',370181,0,0,0,0),(1656,214,'市南区',370202,0,0,0,0),(1657,214,'市北区',370203,0,0,0,0),(1658,214,'黄岛区',370211,0,0,0,0),(1659,214,'崂山区',370212,0,0,0,0),(1660,214,'李沧区',370213,0,0,0,0),(1661,214,'城阳区',370214,0,0,0,0),(1662,214,'胶州市',370281,0,0,0,0),(1663,214,'即墨市',370282,0,0,0,0),(1664,214,'平度市',370283,0,0,0,0),(1665,214,'莱西市',370285,0,0,0,0),(1666,215,'淄川区',370302,0,0,0,0),(1667,215,'张店区',370303,0,0,0,0),(1668,215,'博山区',370304,0,0,0,0),(1669,215,'临淄区',370305,0,0,0,0),(1670,215,'周村区',370306,0,0,0,0),(1671,215,'桓台县',370321,0,0,0,0),(1672,215,'高青县',370322,0,0,0,0),(1673,215,'沂源县',370323,0,0,0,0),(1674,216,'市中区',370402,0,0,0,0),(1675,216,'薛城区',370403,0,0,0,0),(1676,216,'峄城区',370404,0,0,0,0),(1677,216,'台儿庄区',370405,0,0,0,0),(1678,216,'山亭区',370406,0,0,0,0),(1679,216,'滕州市',370481,0,0,0,0),(1680,217,'东营区',370502,0,0,0,0),(1681,217,'河口区',370503,0,0,0,0),(1682,217,'垦利县',370521,0,0,0,0),(1683,217,'利津县',370522,0,0,0,0),(1684,217,'广饶县',370523,0,0,0,0),(1685,218,'芝罘区',370602,0,0,0,0),(1686,218,'福山区',370611,0,0,0,0),(1687,218,'牟平区',370612,0,0,0,0),(1688,218,'莱山区',370613,0,0,0,0),(1689,218,'长岛县',370634,0,0,0,0),(1690,218,'龙口市',370681,0,0,0,0),(1691,218,'莱阳市',370682,0,0,0,0),(1692,218,'莱州市',370683,0,0,0,0),(1693,218,'蓬莱市',370684,0,0,0,0),(1694,218,'招远市',370685,0,0,0,0),(1695,218,'栖霞市',370686,0,0,0,0),(1696,218,'海阳市',370687,0,0,0,0),(1697,219,'潍城区',370702,0,0,0,0),(1698,219,'寒亭区',370703,0,0,0,0),(1699,219,'坊子区',370704,0,0,0,0),(1700,219,'奎文区',370705,0,0,0,0),(1701,219,'临朐县',370724,0,0,0,0),(1702,219,'昌乐县',370725,0,0,0,0),(1703,219,'青州市',370781,0,0,0,0),(1704,219,'诸城市',370782,0,0,0,0),(1705,219,'寿光市',370783,0,0,0,0),(1706,219,'安丘市',370784,0,0,0,0),(1707,219,'高密市',370785,0,0,0,0),(1708,219,'昌邑市',370786,0,0,0,0),(1709,220,'任城区',370811,0,0,0,0),(1710,220,'兖州区',370812,0,0,0,0),(1711,220,'微山县',370826,0,0,0,0),(1712,220,'鱼台县',370827,0,0,0,0),(1713,220,'金乡县',370828,0,0,0,0),(1714,220,'嘉祥县',370829,0,0,0,0),(1715,220,'汶上县',370830,0,0,0,0),(1716,220,'泗水县',370831,0,0,0,0),(1717,220,'梁山县',370832,0,0,0,0),(1718,220,'曲阜市',370881,0,0,0,0),(1719,220,'邹城市',370883,0,0,0,0),(1720,221,'泰山区',370902,0,0,0,0),(1721,221,'岱岳区',370911,0,0,0,0),(1722,221,'宁阳县',370921,0,0,0,0),(1723,221,'东平县',370923,0,0,0,0),(1724,221,'新泰市',370982,0,0,0,0),(1725,221,'肥城市',370983,0,0,0,0),(1726,222,'环翠区',371002,0,0,0,0),(1727,222,'文登区',371003,0,0,0,0),(1728,222,'荣成市',371082,0,0,0,0),(1729,222,'乳山市',371083,0,0,0,0),(1730,223,'东港区',371102,0,0,0,0),(1731,223,'岚山区',371103,0,0,0,0),(1732,223,'五莲县',371121,0,0,0,0),(1733,223,'莒县',371122,0,0,0,0),(1734,224,'莱城区',371202,0,0,0,0),(1735,224,'钢城区',371203,0,0,0,0),(1736,225,'兰山区',371302,0,0,0,0),(1737,225,'罗庄区',371311,0,0,0,0),(1738,225,'河东区',371312,0,0,0,0),(1739,225,'沂南县',371321,0,0,0,0),(1740,225,'郯城县',371322,0,0,0,0),(1741,225,'沂水县',371323,0,0,0,0),(1742,225,'兰陵县',371324,0,0,0,0),(1743,225,'费县',371325,0,0,0,0),(1744,225,'平邑县',371326,0,0,0,0),(1745,225,'莒南县',371327,0,0,0,0),(1746,225,'蒙阴县',371328,0,0,0,0),(1747,225,'临沭县',371329,0,0,0,0),(1748,226,'德城区',371402,0,0,0,0),(1749,226,'陵城区',371403,0,0,0,0),(1750,226,'宁津县',371422,0,0,0,0),(1751,226,'庆云县',371423,0,0,0,0),(1752,226,'临邑县',371424,0,0,0,0),(1753,226,'齐河县',371425,0,0,0,0),(1754,226,'平原县',371426,0,0,0,0),(1755,226,'夏津县',371427,0,0,0,0),(1756,226,'武城县',371428,0,0,0,0),(1757,226,'乐陵市',371481,0,0,0,0),(1758,226,'禹城市',371482,0,0,0,0),(1759,227,'东昌府区',371502,0,0,0,0),(1760,227,'阳谷县',371521,0,0,0,0),(1761,227,'莘县',371522,0,0,0,0),(1762,227,'茌平县',371523,0,0,0,0),(1763,227,'东阿县',371524,0,0,0,0),(1764,227,'冠县',371525,0,0,0,0),(1765,227,'高唐县',371526,0,0,0,0),(1766,227,'临清市',371581,0,0,0,0),(1767,228,'滨城区',371602,0,0,0,0),(1768,228,'沾化区',371603,0,0,0,0),(1769,228,'惠民县',371621,0,0,0,0),(1770,228,'阳信县',371622,0,0,0,0),(1771,228,'无棣县',371623,0,0,0,0),(1772,228,'博兴县',371625,0,0,0,0),(1773,228,'邹平县',371626,0,0,0,0),(1774,229,'牡丹区',371702,0,0,0,0),(1775,229,'曹县',371721,0,0,0,0),(1776,229,'单县',371722,0,0,0,0),(1777,229,'成武县',371723,0,0,0,0),(1778,229,'巨野县',371724,0,0,0,0),(1779,229,'郓城县',371725,0,0,0,0),(1780,229,'鄄城县',371726,0,0,0,0),(1781,229,'定陶县',371727,0,0,0,0),(1782,229,'东明县',371728,0,0,0,0),(1783,230,'中原区',410102,0,0,0,0),(1784,230,'二七区',410103,0,0,0,0),(1785,230,'管城回族区',410104,0,0,0,0),(1786,230,'金水区',410105,0,0,0,0),(1787,230,'上街区',410106,0,0,0,0),(1788,230,'惠济区',410108,0,0,0,0),(1789,230,'中牟县',410122,0,0,0,0),(1790,230,'巩义市',410181,0,0,0,0),(1791,230,'荥阳市',410182,0,0,0,0),(1792,230,'新密市',410183,0,0,0,0),(1793,230,'新郑市',410184,0,0,0,0),(1794,230,'登封市',410185,0,0,0,0),(1795,231,'龙亭区',410202,0,0,0,0),(1796,231,'顺河回族区',410203,0,0,0,0),(1797,231,'鼓楼区',410204,0,0,0,0),(1798,231,'禹王台区',410205,0,0,0,0),(1799,231,'祥符区',410212,0,0,0,0),(1800,231,'杞县',410221,0,0,0,0),(1801,231,'通许县',410222,0,0,0,0),(1802,231,'尉氏县',410223,0,0,0,0),(1803,231,'兰考县',410225,0,0,0,0),(1804,232,'老城区',410302,0,0,0,0),(1805,232,'西工区',410303,0,0,0,0),(1806,232,'瀍河回族区',410304,0,0,0,0),(1807,232,'涧西区',410305,0,0,0,0),(1808,232,'吉利区',410306,0,0,0,0),(1809,232,'洛龙区',410311,0,0,0,0),(1810,232,'孟津县',410322,0,0,0,0),(1811,232,'新安县',410323,0,0,0,0),(1812,232,'栾川县',410324,0,0,0,0),(1813,232,'嵩县',410325,0,0,0,0),(1814,232,'汝阳县',410326,0,0,0,0),(1815,232,'宜阳县',410327,0,0,0,0),(1816,232,'洛宁县',410328,0,0,0,0),(1817,232,'伊川县',410329,0,0,0,0),(1818,232,'偃师市',410381,0,0,0,0),(1819,233,'新华区',410402,0,0,0,0),(1820,233,'卫东区',410403,0,0,0,0),(1821,233,'石龙区',410404,0,0,0,0),(1822,233,'湛河区',410411,0,0,0,0),(1823,233,'宝丰县',410421,0,0,0,0),(1824,233,'叶县',410422,0,0,0,0),(1825,233,'鲁山县',410423,0,0,0,0),(1826,233,'郏县',410425,0,0,0,0),(1827,233,'舞钢市',410481,0,0,0,0),(1828,233,'汝州市',410482,0,0,0,0),(1829,234,'文峰区',410502,0,0,0,0),(1830,234,'北关区',410503,0,0,0,0),(1831,234,'殷都区',410505,0,0,0,0),(1832,234,'龙安区',410506,0,0,0,0),(1833,234,'安阳县',410522,0,0,0,0),(1834,234,'汤阴县',410523,0,0,0,0),(1835,234,'滑县',410526,0,0,0,0),(1836,234,'内黄县',410527,0,0,0,0),(1837,234,'林州市',410581,0,0,0,0),(1838,235,'鹤山区',410602,0,0,0,0),(1839,235,'山城区',410603,0,0,0,0),(1840,235,'淇滨区',410611,0,0,0,0),(1841,235,'浚县',410621,0,0,0,0),(1842,235,'淇县',410622,0,0,0,0),(1843,236,'红旗区',410702,0,0,0,0),(1844,236,'卫滨区',410703,0,0,0,0),(1845,236,'凤泉区',410704,0,0,0,0),(1846,236,'牧野区',410711,0,0,0,0),(1847,236,'新乡县',410721,0,0,0,0),(1848,236,'获嘉县',410724,0,0,0,0),(1849,236,'原阳县',410725,0,0,0,0),(1850,236,'延津县',410726,0,0,0,0),(1851,236,'封丘县',410727,0,0,0,0),(1852,236,'长垣县',410728,0,0,0,0),(1853,236,'卫辉市',410781,0,0,0,0),(1854,236,'辉县市',410782,0,0,0,0),(1855,237,'解放区',410802,0,0,0,0),(1856,237,'中站区',410803,0,0,0,0),(1857,237,'马村区',410804,0,0,0,0),(1858,237,'山阳区',410811,0,0,0,0),(1859,237,'修武县',410821,0,0,0,0),(1860,237,'博爱县',410822,0,0,0,0),(1861,237,'武陟县',410823,0,0,0,0),(1862,237,'温县',410825,0,0,0,0),(1863,237,'沁阳市',410882,0,0,0,0),(1864,237,'孟州市',410883,0,0,0,0),(1865,238,'华龙区',410902,0,0,0,0),(1866,238,'清丰县',410922,0,0,0,0),(1867,238,'南乐县',410923,0,0,0,0),(1868,238,'范县',410926,0,0,0,0),(1869,238,'台前县',410927,0,0,0,0),(1870,238,'濮阳县',410928,0,0,0,0),(1871,239,'魏都区',411002,0,0,0,0),(1872,239,'许昌县',411023,0,0,0,0),(1873,239,'鄢陵县',411024,0,0,0,0),(1874,239,'襄城县',411025,0,0,0,0),(1875,239,'禹州市',411081,0,0,0,0),(1876,239,'长葛市',411082,0,0,0,0),(1877,240,'源汇区',411102,0,0,0,0),(1878,240,'郾城区',411103,0,0,0,0),(1879,240,'召陵区',411104,0,0,0,0),(1880,240,'舞阳县',411121,0,0,0,0),(1881,240,'临颍县',411122,0,0,0,0),(1882,241,'湖滨区',411202,0,0,0,0),(1883,241,'陕州区',411203,0,0,0,0),(1884,241,'渑池县',411221,0,0,0,0),(1885,241,'卢氏县',411224,0,0,0,0),(1886,241,'义马市',411281,0,0,0,0),(1887,241,'灵宝市',411282,0,0,0,0),(1888,242,'宛城区',411302,0,0,0,0),(1889,242,'卧龙区',411303,0,0,0,0),(1890,242,'南召县',411321,0,0,0,0),(1891,242,'方城县',411322,0,0,0,0),(1892,242,'西峡县',411323,0,0,0,0),(1893,242,'镇平县',411324,0,0,0,0),(1894,242,'内乡县',411325,0,0,0,0),(1895,242,'淅川县',411326,0,0,0,0),(1896,242,'社旗县',411327,0,0,0,0),(1897,242,'唐河县',411328,0,0,0,0),(1898,242,'新野县',411329,0,0,0,0),(1899,242,'桐柏县',411330,0,0,0,0),(1900,242,'邓州市',411381,0,0,0,0),(1901,243,'梁园区',411402,0,0,0,0),(1902,243,'睢阳区',411403,0,0,0,0),(1903,243,'民权县',411421,0,0,0,0),(1904,243,'睢县',411422,0,0,0,0),(1905,243,'宁陵县',411423,0,0,0,0),(1906,243,'柘城县',411424,0,0,0,0),(1907,243,'虞城县',411425,0,0,0,0),(1908,243,'夏邑县',411426,0,0,0,0),(1909,243,'永城市',411481,0,0,0,0),(1910,244,'浉河区',411502,0,0,0,0),(1911,244,'平桥区',411503,0,0,0,0),(1912,244,'罗山县',411521,0,0,0,0),(1913,244,'光山县',411522,0,0,0,0),(1914,244,'新县',411523,0,0,0,0),(1915,244,'商城县',411524,0,0,0,0),(1916,244,'固始县',411525,0,0,0,0),(1917,244,'潢川县',411526,0,0,0,0),(1918,244,'淮滨县',411527,0,0,0,0),(1919,244,'息县',411528,0,0,0,0),(1920,245,'川汇区',411602,0,0,0,0),(1921,245,'扶沟县',411621,0,0,0,0),(1922,245,'西华县',411622,0,0,0,0),(1923,245,'商水县',411623,0,0,0,0),(1924,245,'沈丘县',411624,0,0,0,0),(1925,245,'郸城县',411625,0,0,0,0),(1926,245,'淮阳县',411626,0,0,0,0),(1927,245,'太康县',411627,0,0,0,0),(1928,245,'鹿邑县',411628,0,0,0,0),(1929,245,'项城市',411681,0,0,0,0),(1930,246,'驿城区',411702,0,0,0,0),(1931,246,'西平县',411721,0,0,0,0),(1932,246,'上蔡县',411722,0,0,0,0),(1933,246,'平舆县',411723,0,0,0,0),(1934,246,'正阳县',411724,0,0,0,0),(1935,246,'确山县',411725,0,0,0,0),(1936,246,'泌阳县',411726,0,0,0,0),(1937,246,'汝南县',411727,0,0,0,0),(1938,246,'遂平县',411728,0,0,0,0),(1939,246,'新蔡县',411729,0,0,0,0),(1940,248,'江岸区',420102,0,0,0,0),(1941,248,'江汉区',420103,0,0,0,0),(1942,248,'硚口区',420104,0,0,0,0),(1943,248,'汉阳区',420105,0,0,0,0),(1944,248,'武昌区',420106,0,0,0,0),(1945,248,'青山区',420107,0,0,0,0),(1946,248,'洪山区',420111,0,0,0,0),(1947,248,'东西湖区',420112,0,0,0,0),(1948,248,'汉南区',420113,0,0,0,0),(1949,248,'蔡甸区',420114,0,0,0,0),(1950,248,'江夏区',420115,0,0,0,0),(1951,248,'黄陂区',420116,0,0,0,0),(1952,248,'新洲区',420117,0,0,0,0),(1953,249,'黄石港区',420202,0,0,0,0),(1954,249,'西塞山区',420203,0,0,0,0),(1955,249,'下陆区',420204,0,0,0,0),(1956,249,'铁山区',420205,0,0,0,0),(1957,249,'阳新县',420222,0,0,0,0),(1958,249,'大冶市',420281,0,0,0,0),(1959,250,'茅箭区',420302,0,0,0,0),(1960,250,'张湾区',420303,0,0,0,0),(1961,250,'郧阳区',420304,0,0,0,0),(1962,250,'郧西县',420322,0,0,0,0),(1963,250,'竹山县',420323,0,0,0,0),(1964,250,'竹溪县',420324,0,0,0,0),(1965,250,'房县',420325,0,0,0,0),(1966,250,'丹江口市',420381,0,0,0,0),(1967,251,'西陵区',420502,0,0,0,0),(1968,251,'伍家岗区',420503,0,0,0,0),(1969,251,'点军区',420504,0,0,0,0),(1970,251,'猇亭区',420505,0,0,0,0),(1971,251,'夷陵区',420506,0,0,0,0),(1972,251,'远安县',420525,0,0,0,0),(1973,251,'兴山县',420526,0,0,0,0),(1974,251,'秭归县',420527,0,0,0,0),(1975,251,'长阳土家族',420528,0,0,0,0),(1976,251,'五峰土家族',420529,0,0,0,0),(1977,251,'宜都市',420581,0,0,0,0),(1978,251,'当阳市',420582,0,0,0,0),(1979,251,'枝江市',420583,0,0,0,0),(1980,252,'襄城区',420602,0,0,0,0),(1981,252,'樊城区',420606,0,0,0,0),(1982,252,'襄州区',420607,0,0,0,0),(1983,252,'南漳县',420624,0,0,0,0),(1984,252,'谷城县',420625,0,0,0,0),(1985,252,'保康县',420626,0,0,0,0),(1986,252,'老河口市',420682,0,0,0,0),(1987,252,'枣阳市',420683,0,0,0,0),(1988,252,'宜城市',420684,0,0,0,0),(1989,253,'梁子湖区',420702,0,0,0,0),(1990,253,'华容区',420703,0,0,0,0),(1991,253,'鄂城区',420704,0,0,0,0),(1992,254,'东宝区',420802,0,0,0,0),(1993,254,'掇刀区',420804,0,0,0,0),(1994,254,'京山县',420821,0,0,0,0),(1995,254,'沙洋县',420822,0,0,0,0),(1996,254,'钟祥市',420881,0,0,0,0),(1997,255,'孝南区',420902,0,0,0,0),(1998,255,'孝昌县',420921,0,0,0,0),(1999,255,'大悟县',420922,0,0,0,0),(2000,255,'云梦县',420923,0,0,0,0),(2001,255,'应城市',420981,0,0,0,0),(2002,255,'安陆市',420982,0,0,0,0),(2003,255,'汉川市',420984,0,0,0,0),(2004,256,'沙市区',421002,0,0,0,0),(2005,256,'荆州区',421003,0,0,0,0),(2006,256,'公安县',421022,0,0,0,0),(2007,256,'监利县',421023,0,0,0,0),(2008,256,'江陵县',421024,0,0,0,0),(2009,256,'石首市',421081,0,0,0,0),(2010,256,'洪湖市',421083,0,0,0,0),(2011,256,'松滋市',421087,0,0,0,0),(2012,257,'黄州区',421102,0,0,0,0),(2013,257,'团风县',421121,0,0,0,0),(2014,257,'红安县',421122,0,0,0,0),(2015,257,'罗田县',421123,0,0,0,0),(2016,257,'英山县',421124,0,0,0,0),(2017,257,'浠水县',421125,0,0,0,0),(2018,257,'蕲春县',421126,0,0,0,0),(2019,257,'黄梅县',421127,0,0,0,0),(2020,257,'麻城市',421181,0,0,0,0),(2021,257,'武穴市',421182,0,0,0,0),(2022,258,'咸安区',421202,0,0,0,0),(2023,258,'嘉鱼县',421221,0,0,0,0),(2024,258,'通城县',421222,0,0,0,0),(2025,258,'崇阳县',421223,0,0,0,0),(2026,258,'通山县',421224,0,0,0,0),(2027,258,'赤壁市',421281,0,0,0,0),(2028,259,'曾都区',421303,0,0,0,0),(2029,259,'随县',421321,0,0,0,0),(2030,259,'广水市',421381,0,0,0,0),(2031,260,'恩施市',422801,0,0,0,0),(2032,260,'利川市',422802,0,0,0,0),(2033,260,'建始县',422822,0,0,0,0),(2034,260,'巴东县',422823,0,0,0,0),(2035,260,'宣恩县',422825,0,0,0,0),(2036,260,'咸丰县',422826,0,0,0,0),(2037,260,'来凤县',422827,0,0,0,0),(2038,260,'鹤峰县',422828,0,0,0,0),(2039,265,'芙蓉区',430102,0,0,0,0),(2040,265,'天心区',430103,0,0,0,0),(2041,265,'岳麓区',430104,0,0,0,0),(2042,265,'开福区',430105,0,0,0,0),(2043,265,'雨花区',430111,0,0,0,0),(2044,265,'望城区',430112,0,0,0,0),(2045,265,'长沙县',430121,0,0,0,0),(2046,265,'宁乡县',430124,0,0,0,0),(2047,265,'浏阳市',430181,0,0,0,0),(2048,266,'荷塘区',430202,0,0,0,0),(2049,266,'芦淞区',430203,0,0,0,0),(2050,266,'石峰区',430204,0,0,0,0),(2051,266,'天元区',430211,0,0,0,0),(2052,266,'株洲县',430221,0,0,0,0),(2053,266,'攸县',430223,0,0,0,0),(2054,266,'茶陵县',430224,0,0,0,0),(2055,266,'炎陵县',430225,0,0,0,0),(2056,266,'醴陵市',430281,0,0,0,0),(2057,267,'雨湖区',430302,0,0,0,0),(2058,267,'岳塘区',430304,0,0,0,0),(2059,267,'湘潭县',430321,0,0,0,0),(2060,267,'湘乡市',430381,0,0,0,0),(2061,267,'韶山市',430382,0,0,0,0),(2062,268,'珠晖区',430405,0,0,0,0),(2063,268,'雁峰区',430406,0,0,0,0),(2064,268,'石鼓区',430407,0,0,0,0),(2065,268,'蒸湘区',430408,0,0,0,0),(2066,268,'南岳区',430412,0,0,0,0),(2067,268,'衡阳县',430421,0,0,0,0),(2068,268,'衡南县',430422,0,0,0,0),(2069,268,'衡山县',430423,0,0,0,0),(2070,268,'衡东县',430424,0,0,0,0),(2071,268,'祁东县',430426,0,0,0,0),(2072,268,'耒阳市',430481,0,0,0,0),(2073,268,'常宁市',430482,0,0,0,0),(2074,269,'双清区',430502,0,0,0,0),(2075,269,'大祥区',430503,0,0,0,0),(2076,269,'北塔区',430511,0,0,0,0),(2077,269,'邵东县',430521,0,0,0,0),(2078,269,'新邵县',430522,0,0,0,0),(2079,269,'邵阳县',430523,0,0,0,0),(2080,269,'隆回县',430524,0,0,0,0),(2081,269,'洞口县',430525,0,0,0,0),(2082,269,'绥宁县',430527,0,0,0,0),(2083,269,'新宁县',430528,0,0,0,0),(2084,269,'城步苗族',430529,0,0,0,0),(2085,269,'武冈市',430581,0,0,0,0),(2086,270,'岳阳楼区',430602,0,0,0,0),(2087,270,'云溪区',430603,0,0,0,0),(2088,270,'君山区',430611,0,0,0,0),(2089,270,'岳阳县',430621,0,0,0,0),(2090,270,'华容县',430623,0,0,0,0),(2091,270,'湘阴县',430624,0,0,0,0),(2092,270,'平江县',430626,0,0,0,0),(2093,270,'汨罗市',430681,0,0,0,0),(2094,270,'临湘市',430682,0,0,0,0),(2095,271,'武陵区',430702,0,0,0,0),(2096,271,'鼎城区',430703,0,0,0,0),(2097,271,'安乡县',430721,0,0,0,0),(2098,271,'汉寿县',430722,0,0,0,0),(2099,271,'澧县',430723,0,0,0,0),(2100,271,'临澧县',430724,0,0,0,0),(2101,271,'桃源县',430725,0,0,0,0),(2102,271,'石门县',430726,0,0,0,0),(2103,271,'津市市',430781,0,0,0,0),(2104,272,'永定区',430802,0,0,0,0),(2105,272,'武陵源区',430811,0,0,0,0),(2106,272,'慈利县',430821,0,0,0,0),(2107,272,'桑植县',430822,0,0,0,0),(2108,273,'资阳区',430902,0,0,0,0),(2109,273,'赫山区',430903,0,0,0,0),(2110,273,'南县',430921,0,0,0,0),(2111,273,'桃江县',430922,0,0,0,0),(2112,273,'安化县',430923,0,0,0,0),(2113,273,'沅江市',430981,0,0,0,0),(2114,274,'北湖区',431002,0,0,0,0),(2115,274,'苏仙区',431003,0,0,0,0),(2116,274,'桂阳县',431021,0,0,0,0),(2117,274,'宜章县',431022,0,0,0,0),(2118,274,'永兴县',431023,0,0,0,0),(2119,274,'嘉禾县',431024,0,0,0,0),(2120,274,'临武县',431025,0,0,0,0),(2121,274,'汝城县',431026,0,0,0,0),(2122,274,'桂东县',431027,0,0,0,0),(2123,274,'安仁县',431028,0,0,0,0),(2124,274,'资兴市',431081,0,0,0,0),(2125,275,'零陵区',431102,0,0,0,0),(2126,275,'冷水滩区',431103,0,0,0,0),(2127,275,'祁阳县',431121,0,0,0,0),(2128,275,'东安县',431122,0,0,0,0),(2129,275,'双牌县',431123,0,0,0,0),(2130,275,'道县',431124,0,0,0,0),(2131,275,'江永县',431125,0,0,0,0),(2132,275,'宁远县',431126,0,0,0,0),(2133,275,'蓝山县',431127,0,0,0,0),(2134,275,'新田县',431128,0,0,0,0),(2135,275,'江华瑶族',431129,0,0,0,0),(2136,276,'鹤城区',431202,0,0,0,0),(2137,276,'中方县',431221,0,0,0,0),(2138,276,'沅陵县',431222,0,0,0,0),(2139,276,'辰溪县',431223,0,0,0,0),(2140,276,'溆浦县',431224,0,0,0,0),(2141,276,'会同县',431225,0,0,0,0),(2142,276,'麻阳苗族',431226,0,0,0,0),(2143,276,'新晃侗族',431227,0,0,0,0),(2144,276,'芷江侗族',431228,0,0,0,0),(2145,276,'靖州苗族侗族',431229,0,0,0,0),(2146,276,'通道侗族',431230,0,0,0,0),(2147,276,'洪江市',431281,0,0,0,0),(2148,277,'娄星区',431302,0,0,0,0),(2149,277,'双峰县',431321,0,0,0,0),(2150,277,'新化县',431322,0,0,0,0),(2151,277,'冷水江市',431381,0,0,0,0),(2152,277,'涟源市',431382,0,0,0,0),(2153,278,'吉首市',433101,0,0,0,0),(2154,278,'泸溪县',433122,0,0,0,0),(2155,278,'凤凰县',433123,0,0,0,0),(2156,278,'花垣县',433124,0,0,0,0),(2157,278,'保靖县',433125,0,0,0,0),(2158,278,'古丈县',433126,0,0,0,0),(2159,278,'永顺县',433127,0,0,0,0),(2160,278,'龙山县',433130,0,0,0,0),(2161,279,'荔湾区',440103,0,0,0,0),(2162,279,'越秀区',440104,0,0,0,0),(2163,279,'海珠区',440105,0,0,0,0),(2164,279,'天河区',440106,0,0,0,0),(2165,279,'白云区',440111,0,0,0,0),(2166,279,'黄埔区',440112,0,0,0,0),(2167,279,'番禺区',440113,0,0,0,0),(2168,279,'花都区',440114,0,0,0,0),(2169,279,'南沙区',440115,0,0,0,0),(2170,279,'从化区',440117,0,0,0,0),(2171,279,'增城区',440118,0,0,0,0),(2172,280,'武江区',440203,0,0,0,0),(2173,280,'浈江区',440204,0,0,0,0),(2174,280,'曲江区',440205,0,0,0,0),(2175,280,'始兴县',440222,0,0,0,0),(2176,280,'仁化县',440224,0,0,0,0),(2177,280,'翁源县',440229,0,0,0,0),(2178,280,'乳源瑶族',440232,0,0,0,0),(2179,280,'新丰县',440233,0,0,0,0),(2180,280,'乐昌市',440281,0,0,0,0),(2181,280,'南雄市',440282,0,0,0,0),(2182,281,'罗湖区',440303,0,0,0,0),(2183,281,'福田区',440304,0,0,0,0),(2184,281,'南山区',440305,0,0,0,0),(2185,281,'宝安区',440306,0,0,0,0),(2186,281,'龙岗区',440307,0,0,0,0),(2187,281,'盐田区',440308,0,0,0,0),(2188,282,'香洲区',440402,0,0,0,0),(2189,282,'斗门区',440403,0,0,0,0),(2190,282,'金湾区',440404,0,0,0,0),(2191,283,'龙湖区',440507,0,0,0,0),(2192,283,'金平区',440511,0,0,0,0),(2193,283,'濠江区',440512,0,0,0,0),(2194,283,'潮阳区',440513,0,0,0,0),(2195,283,'潮南区',440514,0,0,0,0),(2196,283,'澄海区',440515,0,0,0,0),(2197,283,'南澳县',440523,0,0,0,0),(2198,284,'禅城区',440604,0,0,0,0),(2199,284,'南海区',440605,0,0,0,0),(2200,284,'顺德区',440606,0,0,0,0),(2201,284,'三水区',440607,0,0,0,0),(2202,284,'高明区',440608,0,0,0,0),(2203,285,'蓬江区',440703,0,0,0,0),(2204,285,'江海区',440704,0,0,0,0),(2205,285,'新会区',440705,0,0,0,0),(2206,285,'台山市',440781,0,0,0,0),(2207,285,'开平市',440783,0,0,0,0),(2208,285,'鹤山市',440784,0,0,0,0),(2209,285,'恩平市',440785,0,0,0,0),(2210,286,'赤坎区',440802,0,0,0,0),(2211,286,'霞山区',440803,0,0,0,0),(2212,286,'坡头区',440804,0,0,0,0),(2213,286,'麻章区',440811,0,0,0,0),(2214,286,'遂溪县',440823,0,0,0,0),(2215,286,'徐闻县',440825,0,0,0,0),(2216,286,'廉江市',440881,0,0,0,0),(2217,286,'雷州市',440882,0,0,0,0),(2218,286,'吴川市',440883,0,0,0,0),(2219,287,'茂南区',440902,0,0,0,0),(2220,287,'电白区',440904,0,0,0,0),(2221,287,'高州市',440981,0,0,0,0),(2222,287,'化州市',440982,0,0,0,0),(2223,287,'信宜市',440983,0,0,0,0),(2224,288,'端州区',441202,0,0,0,0),(2225,288,'鼎湖区',441203,0,0,0,0),(2226,288,'广宁县',441223,0,0,0,0),(2227,288,'怀集县',441224,0,0,0,0),(2228,288,'封开县',441225,0,0,0,0),(2229,288,'德庆县',441226,0,0,0,0),(2230,288,'高要区',441283,0,0,0,0),(2231,288,'四会市',441284,0,0,0,0),(2232,289,'惠城区',441302,0,0,0,0),(2233,289,'惠阳区',441303,0,0,0,0),(2234,289,'博罗县',441322,0,0,0,0),(2235,289,'惠东县',441323,0,0,0,0),(2236,289,'龙门县',441324,0,0,0,0),(2237,290,'梅江区',441402,0,0,0,0),(2238,290,'梅县区',441403,0,0,0,0),(2239,290,'大埔县',441422,0,0,0,0),(2240,290,'丰顺县',441423,0,0,0,0),(2241,290,'五华县',441424,0,0,0,0),(2242,290,'平远县',441426,0,0,0,0),(2243,290,'蕉岭县',441427,0,0,0,0),(2244,290,'兴宁市',441481,0,0,0,0),(2245,291,'城区',441502,0,0,0,0),(2246,291,'海丰县',441521,0,0,0,0),(2247,291,'陆河县',441523,0,0,0,0),(2248,291,'陆丰市',441581,0,0,0,0),(2249,292,'源城区',441602,0,0,0,0),(2250,292,'紫金县',441621,0,0,0,0),(2251,292,'龙川县',441622,0,0,0,0),(2252,292,'连平县',441623,0,0,0,0),(2253,292,'和平县',441624,0,0,0,0),(2254,292,'东源县',441625,0,0,0,0),(2255,293,'江城区',441702,0,0,0,0),(2256,293,'阳东区',441704,0,0,0,0),(2257,293,'阳西县',441721,0,0,0,0),(2258,293,'阳春市',441781,0,0,0,0),(2259,294,'清城区',441802,0,0,0,0),(2260,294,'清新区',441803,0,0,0,0),(2261,294,'佛冈县',441821,0,0,0,0),(2262,294,'阳山县',441823,0,0,0,0),(2263,294,'连山壮族瑶族',441825,0,0,0,0),(2264,294,'连南瑶族',441826,0,0,0,0),(2265,294,'英德市',441881,0,0,0,0),(2266,294,'连州市',441882,0,0,0,0),(2267,295,'三元里',441900,0,0,0,0),(2268,296,'湖滨北路',442000,0,0,0,0),(2269,297,'湘桥区',445102,0,0,0,0),(2270,297,'潮安区',445103,0,0,0,0),(2271,297,'饶平县',445122,0,0,0,0),(2272,298,'榕城区',445202,0,0,0,0),(2273,298,'揭东区',445203,0,0,0,0),(2274,298,'揭西县',445222,0,0,0,0),(2275,298,'惠来县',445224,0,0,0,0),(2276,298,'普宁市',445281,0,0,0,0),(2277,299,'云城区',445302,0,0,0,0),(2278,299,'云安区',445303,0,0,0,0),(2279,299,'新兴县',445321,0,0,0,0),(2280,299,'郁南县',445322,0,0,0,0),(2281,299,'罗定市',445381,0,0,0,0),(2282,300,'兴宁区',450102,0,0,0,0),(2283,300,'青秀区',450103,0,0,0,0),(2284,300,'江南区',450105,0,0,0,0),(2285,300,'西乡塘区',450107,0,0,0,0),(2286,300,'良庆区',450108,0,0,0,0),(2287,300,'邕宁区',450109,0,0,0,0),(2288,300,'武鸣区',450110,0,0,0,0),(2289,300,'隆安县',450123,0,0,0,0),(2290,300,'马山县',450124,0,0,0,0),(2291,300,'上林县',450125,0,0,0,0),(2292,300,'宾阳县',450126,0,0,0,0),(2293,300,'横县',450127,0,0,0,0),(2294,301,'城中区',450202,0,0,0,0),(2295,301,'鱼峰区',450203,0,0,0,0),(2296,301,'柳南区',450204,0,0,0,0),(2297,301,'柳北区',450205,0,0,0,0),(2298,301,'柳江县',450221,0,0,0,0),(2299,301,'柳城县',450222,0,0,0,0),(2300,301,'鹿寨县',450223,0,0,0,0),(2301,301,'融安县',450224,0,0,0,0),(2302,301,'融水苗族',450225,0,0,0,0),(2303,301,'三江侗族',450226,0,0,0,0),(2304,302,'秀峰区',450302,0,0,0,0),(2305,302,'叠彩区',450303,0,0,0,0),(2306,302,'象山区',450304,0,0,0,0),(2307,302,'七星区',450305,0,0,0,0),(2308,302,'雁山区',450311,0,0,0,0),(2309,302,'临桂区',450312,0,0,0,0),(2310,302,'阳朔县',450321,0,0,0,0),(2311,302,'灵川县',450323,0,0,0,0),(2312,302,'全州县',450324,0,0,0,0),(2313,302,'兴安县',450325,0,0,0,0),(2314,302,'永福县',450326,0,0,0,0),(2315,302,'灌阳县',450327,0,0,0,0),(2316,302,'龙胜各族',450328,0,0,0,0),(2317,302,'资源县',450329,0,0,0,0),(2318,302,'平乐县',450330,0,0,0,0),(2319,302,'荔浦县',450331,0,0,0,0),(2320,302,'恭城瑶族',450332,0,0,0,0),(2321,303,'万秀区',450403,0,0,0,0),(2322,303,'长洲区',450405,0,0,0,0),(2323,303,'龙圩区',450406,0,0,0,0),(2324,303,'苍梧县',450421,0,0,0,0),(2325,303,'藤县',450422,0,0,0,0),(2326,303,'蒙山县',450423,0,0,0,0),(2327,303,'岑溪市',450481,0,0,0,0),(2328,304,'海城区',450502,0,0,0,0),(2329,304,'银海区',450503,0,0,0,0),(2330,304,'铁山港区',450512,0,0,0,0),(2331,304,'合浦县',450521,0,0,0,0),(2332,305,'港口区',450602,0,0,0,0),(2333,305,'防城区',450603,0,0,0,0),(2334,305,'上思县',450621,0,0,0,0),(2335,305,'东兴市',450681,0,0,0,0),(2336,306,'钦南区',450702,0,0,0,0),(2337,306,'钦北区',450703,0,0,0,0),(2338,306,'灵山县',450721,0,0,0,0),(2339,306,'浦北县',450722,0,0,0,0),(2340,307,'港北区',450802,0,0,0,0),(2341,307,'港南区',450803,0,0,0,0),(2342,307,'覃塘区',450804,0,0,0,0),(2343,307,'平南县',450821,0,0,0,0),(2344,307,'桂平市',450881,0,0,0,0),(2345,308,'玉州区',450902,0,0,0,0),(2346,308,'福绵区',450903,0,0,0,0),(2347,308,'容县',450921,0,0,0,0),(2348,308,'陆川县',450922,0,0,0,0),(2349,308,'博白县',450923,0,0,0,0),(2350,308,'兴业县',450924,0,0,0,0),(2351,308,'北流市',450981,0,0,0,0),(2352,309,'右江区',451002,0,0,0,0),(2353,309,'田阳县',451021,0,0,0,0),(2354,309,'田东县',451022,0,0,0,0),(2355,309,'平果县',451023,0,0,0,0),(2356,309,'德保县',451024,0,0,0,0),(2357,309,'靖西县',451025,0,0,0,0),(2358,309,'那坡县',451026,0,0,0,0),(2359,309,'凌云县',451027,0,0,0,0),(2360,309,'乐业县',451028,0,0,0,0),(2361,309,'田林县',451029,0,0,0,0),(2362,309,'西林县',451030,0,0,0,0),(2363,309,'隆林各族',451031,0,0,0,0),(2364,310,'八步区',451102,0,0,0,0),(2365,310,'昭平县',451121,0,0,0,0),(2366,310,'钟山县',451122,0,0,0,0),(2367,310,'富川瑶族',451123,0,0,0,0),(2368,311,'金城江区',451202,0,0,0,0),(2369,311,'南丹县',451221,0,0,0,0),(2370,311,'天峨县',451222,0,0,0,0),(2371,311,'凤山县',451223,0,0,0,0),(2372,311,'东兰县',451224,0,0,0,0),(2373,311,'罗城仫佬族',451225,0,0,0,0),(2374,311,'环江毛南族',451226,0,0,0,0),(2375,311,'巴马瑶族',451227,0,0,0,0),(2376,311,'都安瑶族',451228,0,0,0,0),(2377,311,'大化瑶族',451229,0,0,0,0),(2378,311,'宜州市',451281,0,0,0,0),(2379,312,'兴宾区',451302,0,0,0,0),(2380,312,'忻城县',451321,0,0,0,0),(2381,312,'象州县',451322,0,0,0,0),(2382,312,'武宣县',451323,0,0,0,0),(2383,312,'金秀瑶族',451324,0,0,0,0),(2384,312,'合山市',451381,0,0,0,0),(2385,313,'江州区',451402,0,0,0,0),(2386,313,'扶绥县',451421,0,0,0,0),(2387,313,'宁明县',451422,0,0,0,0),(2388,313,'龙州县',451423,0,0,0,0),(2389,313,'大新县',451424,0,0,0,0),(2390,313,'天等县',451425,0,0,0,0),(2391,313,'凭祥市',451481,0,0,0,0),(2392,314,'秀英区',460105,0,0,0,0),(2393,314,'龙华区',460106,0,0,0,0),(2394,314,'琼山区',460107,0,0,0,0),(2395,314,'美兰区',460108,0,0,0,0),(2396,315,'三亚湾',460200,0,0,0,0),(2397,315,'海棠区',460202,0,0,0,0),(2398,315,'吉阳区',460203,0,0,0,0),(2399,315,'天涯区',460204,0,0,0,0),(2400,315,'崖州区',460205,0,0,0,0),(2401,316,'西沙群岛',460321,0,0,0,0),(2402,316,'南沙群岛',460322,0,0,0,0),(2403,316,'中沙群岛的岛礁及其海域',460323,0,0,0,0),(2404,371,'南明区',520102,0,0,0,0),(2405,371,'云岩区',520103,0,0,0,0),(2406,371,'花溪区',520111,0,0,0,0),(2407,371,'乌当区',520112,0,0,0,0),(2408,371,'白云区',520113,0,0,0,0),(2409,371,'观山湖区',520115,0,0,0,0),(2410,371,'开阳县',520121,0,0,0,0),(2411,371,'息烽县',520122,0,0,0,0),(2412,371,'修文县',520123,0,0,0,0),(2413,371,'清镇市',520181,0,0,0,0),(2414,372,'钟山区',520201,0,0,0,0),(2415,372,'六枝特区',520203,0,0,0,0),(2416,372,'水城县',520221,0,0,0,0),(2417,372,'盘县',520222,0,0,0,0),(2418,373,'红花岗区',520302,0,0,0,0),(2419,373,'汇川区',520303,0,0,0,0),(2420,373,'遵义县',520321,0,0,0,0),(2421,373,'桐梓县',520322,0,0,0,0),(2422,373,'绥阳县',520323,0,0,0,0),(2423,373,'正安县',520324,0,0,0,0),(2424,373,'道真仡佬族苗族',520325,0,0,0,0),(2425,373,'务川仡佬族苗族',520326,0,0,0,0),(2426,373,'凤冈县',520327,0,0,0,0),(2427,373,'湄潭县',520328,0,0,0,0),(2428,373,'余庆县',520329,0,0,0,0),(2429,373,'习水县',520330,0,0,0,0),(2430,373,'赤水市',520381,0,0,0,0),(2431,373,'仁怀市',520382,0,0,0,0),(2432,374,'西秀区',520402,0,0,0,0),(2433,374,'平坝区',520403,0,0,0,0),(2434,374,'普定县',520422,0,0,0,0),(2435,374,'镇宁布依族苗族',520423,0,0,0,0),(2436,374,'关岭布依族苗族',520424,0,0,0,0),(2437,374,'紫云苗族布依族',520425,0,0,0,0),(2438,375,'七星关区',520502,0,0,0,0),(2439,375,'大方县',520521,0,0,0,0),(2440,375,'黔西县',520522,0,0,0,0),(2441,375,'金沙县',520523,0,0,0,0),(2442,375,'织金县',520524,0,0,0,0),(2443,375,'纳雍县',520525,0,0,0,0),(2444,375,'威宁彝族回族苗族',520526,0,0,0,0),(2445,375,'赫章县',520527,0,0,0,0),(2446,376,'碧江区',520602,0,0,0,0),(2447,376,'万山区',520603,0,0,0,0),(2448,376,'江口县',520621,0,0,0,0),(2449,376,'玉屏侗族',520622,0,0,0,0),(2450,376,'石阡县',520623,0,0,0,0),(2451,376,'思南县',520624,0,0,0,0),(2452,376,'印江土家族苗族',520625,0,0,0,0),(2453,376,'德江县',520626,0,0,0,0),(2454,376,'沿河土家族',520627,0,0,0,0),(2455,376,'松桃苗族',520628,0,0,0,0),(2456,377,'兴义市',522301,0,0,0,0),(2457,377,'兴仁县',522322,0,0,0,0),(2458,377,'普安县',522323,0,0,0,0),(2459,377,'晴隆县',522324,0,0,0,0),(2460,377,'贞丰县',522325,0,0,0,0),(2461,377,'望谟县',522326,0,0,0,0),(2462,377,'册亨县',522327,0,0,0,0),(2463,377,'安龙县',522328,0,0,0,0),(2464,378,'凯里市',522601,0,0,0,0),(2465,378,'黄平县',522622,0,0,0,0),(2466,378,'施秉县',522623,0,0,0,0),(2467,378,'三穗县',522624,0,0,0,0),(2468,378,'镇远县',522625,0,0,0,0),(2469,378,'岑巩县',522626,0,0,0,0),(2470,378,'天柱县',522627,0,0,0,0),(2471,378,'锦屏县',522628,0,0,0,0),(2472,378,'剑河县',522629,0,0,0,0),(2473,378,'台江县',522630,0,0,0,0),(2474,378,'黎平县',522631,0,0,0,0),(2475,378,'榕江县',522632,0,0,0,0),(2476,378,'从江县',522633,0,0,0,0),(2477,378,'雷山县',522634,0,0,0,0),(2478,378,'麻江县',522635,0,0,0,0),(2479,378,'丹寨县',522636,0,0,0,0),(2480,379,'都匀市',522701,0,0,0,0),(2481,379,'福泉市',522702,0,0,0,0),(2482,379,'荔波县',522722,0,0,0,0),(2483,379,'贵定县',522723,0,0,0,0),(2484,379,'瓮安县',522725,0,0,0,0),(2485,379,'独山县',522726,0,0,0,0),(2486,379,'平塘县',522727,0,0,0,0),(2487,379,'罗甸县',522728,0,0,0,0),(2488,379,'长顺县',522729,0,0,0,0),(2489,379,'龙里县',522730,0,0,0,0),(2490,379,'惠水县',522731,0,0,0,0),(2491,379,'三都水族',522732,0,0,0,0),(2492,380,'五华区',530102,0,0,0,0),(2493,380,'盘龙区',530103,0,0,0,0),(2494,380,'官渡区',530111,0,0,0,0),(2495,380,'西山区',530112,0,0,0,0),(2496,380,'东川区',530113,0,0,0,0),(2497,380,'呈贡区',530114,0,0,0,0),(2498,380,'晋宁县',530122,0,0,0,0),(2499,380,'富民县',530124,0,0,0,0),(2500,380,'宜良县',530125,0,0,0,0),(2501,380,'石林彝族',530126,0,0,0,0),(2502,380,'嵩明县',530127,0,0,0,0),(2503,380,'禄劝彝族苗族',530128,0,0,0,0),(2504,380,'寻甸回族彝族',530129,0,0,0,0),(2505,380,'安宁市',530181,0,0,0,0),(2506,381,'麒麟区',530302,0,0,0,0),(2507,381,'马龙县',530321,0,0,0,0),(2508,381,'陆良县',530322,0,0,0,0),(2509,381,'师宗县',530323,0,0,0,0),(2510,381,'罗平县',530324,0,0,0,0),(2511,381,'富源县',530325,0,0,0,0),(2512,381,'会泽县',530326,0,0,0,0),(2513,381,'沾益县',530328,0,0,0,0),(2514,381,'宣威市',530381,0,0,0,0),(2515,382,'红塔区',530402,0,0,0,0),(2516,382,'江川县',530421,0,0,0,0),(2517,382,'澄江县',530422,0,0,0,0),(2518,382,'通海县',530423,0,0,0,0),(2519,382,'华宁县',530424,0,0,0,0),(2520,382,'易门县',530425,0,0,0,0),(2521,382,'峨山彝族',530426,0,0,0,0),(2522,382,'新平彝族傣族',530427,0,0,0,0),(2523,382,'元江哈尼族彝族傣族',530428,0,0,0,0),(2524,383,'隆阳区',530502,0,0,0,0),(2525,383,'施甸县',530521,0,0,0,0),(2526,383,'腾冲县',530522,0,0,0,0),(2527,383,'龙陵县',530523,0,0,0,0),(2528,383,'昌宁县',530524,0,0,0,0),(2529,384,'昭阳区',530602,0,0,0,0),(2530,384,'鲁甸县',530621,0,0,0,0),(2531,384,'巧家县',530622,0,0,0,0),(2532,384,'盐津县',530623,0,0,0,0),(2533,384,'大关县',530624,0,0,0,0),(2534,384,'永善县',530625,0,0,0,0),(2535,384,'绥江县',530626,0,0,0,0),(2536,384,'镇雄县',530627,0,0,0,0),(2537,384,'彝良县',530628,0,0,0,0),(2538,384,'威信县',530629,0,0,0,0),(2539,384,'水富县',530630,0,0,0,0),(2540,385,'古城区',530702,0,0,0,0),(2541,385,'玉龙纳西族',530721,0,0,0,0),(2542,385,'永胜县',530722,0,0,0,0),(2543,385,'华坪县',530723,0,0,0,0),(2544,385,'宁蒗彝族',530724,0,0,0,0),(2545,386,'思茅区',530802,0,0,0,0),(2546,386,'宁洱哈尼族彝族',530821,0,0,0,0),(2547,386,'墨江哈尼族',530822,0,0,0,0),(2548,386,'景东彝族',530823,0,0,0,0),(2549,386,'景谷傣族彝族',530824,0,0,0,0),(2550,386,'镇沅彝族哈尼族拉祜族',530825,0,0,0,0),(2551,386,'江城哈尼族彝族',530826,0,0,0,0),(2552,386,'孟连傣族拉祜族佤族',530827,0,0,0,0),(2553,386,'澜沧拉祜族',530828,0,0,0,0),(2554,386,'西盟佤族',530829,0,0,0,0),(2555,387,'临翔区',530902,0,0,0,0),(2556,387,'凤庆县',530921,0,0,0,0),(2557,387,'云县',530922,0,0,0,0),(2558,387,'永德县',530923,0,0,0,0),(2559,387,'镇康县',530924,0,0,0,0),(2560,387,'双江拉祜族佤族布朗族傣族',530925,0,0,0,0),(2561,387,'耿马傣族佤族',530926,0,0,0,0),(2562,387,'沧源佤族',530927,0,0,0,0),(2563,388,'楚雄市',532301,0,0,0,0),(2564,388,'双柏县',532322,0,0,0,0),(2565,388,'牟定县',532323,0,0,0,0),(2566,388,'南华县',532324,0,0,0,0),(2567,388,'姚安县',532325,0,0,0,0),(2568,388,'大姚县',532326,0,0,0,0),(2569,388,'永仁县',532327,0,0,0,0),(2570,388,'元谋县',532328,0,0,0,0),(2571,388,'武定县',532329,0,0,0,0),(2572,388,'禄丰县',532331,0,0,0,0),(2573,389,'个旧市',532501,0,0,0,0),(2574,389,'开远市',532502,0,0,0,0),(2575,389,'蒙自市',532503,0,0,0,0),(2576,389,'弥勒市',532504,0,0,0,0),(2577,389,'屏边苗族',532523,0,0,0,0),(2578,389,'建水县',532524,0,0,0,0),(2579,389,'石屏县',532525,0,0,0,0),(2580,389,'泸西县',532527,0,0,0,0),(2581,389,'元阳县',532528,0,0,0,0),(2582,389,'红河县',532529,0,0,0,0),(2583,389,'金平苗族瑶族傣族',532530,0,0,0,0),(2584,389,'绿春县',532531,0,0,0,0),(2585,389,'河口瑶族',532532,0,0,0,0),(2586,390,'文山市',532601,0,0,0,0),(2587,390,'砚山县',532622,0,0,0,0),(2588,390,'西畴县',532623,0,0,0,0),(2589,390,'麻栗坡县',532624,0,0,0,0),(2590,390,'马关县',532625,0,0,0,0),(2591,390,'丘北县',532626,0,0,0,0),(2592,390,'广南县',532627,0,0,0,0),(2593,390,'富宁县',532628,0,0,0,0),(2594,391,'景洪市',532801,0,0,0,0),(2595,391,'勐海县',532822,0,0,0,0),(2596,391,'勐腊县',532823,0,0,0,0),(2597,392,'大理市',532901,0,0,0,0),(2598,392,'漾濞彝族',532922,0,0,0,0),(2599,392,'祥云县',532923,0,0,0,0),(2600,392,'宾川县',532924,0,0,0,0),(2601,392,'弥渡县',532925,0,0,0,0),(2602,392,'南涧彝族',532926,0,0,0,0),(2603,392,'巍山彝族回族',532927,0,0,0,0),(2604,392,'永平县',532928,0,0,0,0),(2605,392,'云龙县',532929,0,0,0,0),(2606,392,'洱源县',532930,0,0,0,0),(2607,392,'剑川县',532931,0,0,0,0),(2608,392,'鹤庆县',532932,0,0,0,0),(2609,393,'瑞丽市',533102,0,0,0,0),(2610,393,'芒市',533103,0,0,0,0),(2611,393,'梁河县',533122,0,0,0,0),(2612,393,'盈江县',533123,0,0,0,0),(2613,393,'陇川县',533124,0,0,0,0),(2614,394,'泸水县',533321,0,0,0,0),(2615,394,'福贡县',533323,0,0,0,0),(2616,394,'贡山独龙族怒族',533324,0,0,0,0),(2617,394,'兰坪白族普米族',533325,0,0,0,0),(2618,395,'香格里拉市',533401,0,0,0,0),(2619,395,'德钦县',533422,0,0,0,0),(2620,395,'维西傈僳族',533423,0,0,0,0),(2621,396,'城关区',540102,0,0,0,0),(2622,396,'林周县',540121,0,0,0,0),(2623,396,'当雄县',540122,0,0,0,0),(2624,396,'尼木县',540123,0,0,0,0),(2625,396,'曲水县',540124,0,0,0,0),(2626,396,'堆龙德庆县',540125,0,0,0,0),(2627,396,'达孜县',540126,0,0,0,0),(2628,396,'墨竹工卡县',540127,0,0,0,0),(2629,397,'桑珠孜区',540202,0,0,0,0),(2630,397,'南木林县',540221,0,0,0,0),(2631,397,'江孜县',540222,0,0,0,0),(2632,397,'定日县',540223,0,0,0,0),(2633,397,'萨迦县',540224,0,0,0,0),(2634,397,'拉孜县',540225,0,0,0,0),(2635,397,'昂仁县',540226,0,0,0,0),(2636,397,'谢通门县',540227,0,0,0,0),(2637,397,'白朗县',540228,0,0,0,0),(2638,397,'仁布县',540229,0,0,0,0),(2639,397,'康马县',540230,0,0,0,0),(2640,397,'定结县',540231,0,0,0,0),(2641,397,'仲巴县',540232,0,0,0,0),(2642,397,'亚东县',540233,0,0,0,0),(2643,397,'吉隆县',540234,0,0,0,0),(2644,397,'聂拉木县',540235,0,0,0,0),(2645,397,'萨嘎县',540236,0,0,0,0),(2646,397,'岗巴县',540237,0,0,0,0),(2647,398,'卡若区',540302,0,0,0,0),(2648,398,'江达县',540321,0,0,0,0),(2649,398,'贡觉县',540322,0,0,0,0),(2650,398,'类乌齐县',540323,0,0,0,0),(2651,398,'丁青县',540324,0,0,0,0),(2652,398,'察雅县',540325,0,0,0,0),(2653,398,'八宿县',540326,0,0,0,0),(2654,398,'左贡县',540327,0,0,0,0),(2655,398,'芒康县',540328,0,0,0,0),(2656,398,'洛隆县',540329,0,0,0,0),(2657,398,'边坝县',540330,0,0,0,0),(2658,399,'乃东县',542221,0,0,0,0),(2659,399,'扎囊县',542222,0,0,0,0),(2660,399,'贡嘎县',542223,0,0,0,0),(2661,399,'桑日县',542224,0,0,0,0),(2662,399,'琼结县',542225,0,0,0,0),(2663,399,'曲松县',542226,0,0,0,0),(2664,399,'措美县',542227,0,0,0,0),(2665,399,'洛扎县',542228,0,0,0,0),(2666,399,'加查县',542229,0,0,0,0),(2667,399,'隆子县',542231,0,0,0,0),(2668,399,'错那县',542232,0,0,0,0),(2669,399,'浪卡子县',542233,0,0,0,0),(2670,400,'那曲县',542421,0,0,0,0),(2671,400,'嘉黎县',542422,0,0,0,0),(2672,400,'比如县',542423,0,0,0,0),(2673,400,'聂荣县',542424,0,0,0,0),(2674,400,'安多县',542425,0,0,0,0),(2675,400,'申扎县',542426,0,0,0,0),(2676,400,'索县',542427,0,0,0,0),(2677,400,'班戈县',542428,0,0,0,0),(2678,400,'巴青县',542429,0,0,0,0),(2679,400,'尼玛县',542430,0,0,0,0),(2680,400,'双湖县',542431,0,0,0,0),(2681,401,'普兰县',542521,0,0,0,0),(2682,401,'札达县',542522,0,0,0,0),(2683,401,'噶尔县',542523,0,0,0,0),(2684,401,'日土县',542524,0,0,0,0),(2685,401,'革吉县',542525,0,0,0,0),(2686,401,'改则县',542526,0,0,0,0),(2687,401,'措勤县',542527,0,0,0,0),(2688,402,'巴宜区',542621,0,0,0,0),(2689,402,'工布江达县',542622,0,0,0,0),(2690,402,'米林县',542623,0,0,0,0),(2691,402,'墨脱县',542624,0,0,0,0),(2692,402,'波密县',542625,0,0,0,0),(2693,402,'察隅县',542626,0,0,0,0),(2694,402,'朗县',542627,0,0,0,0),(2695,403,'新城区',610102,0,0,0,0),(2696,403,'碑林区',610103,0,0,0,0),(2697,403,'莲湖区',610104,0,0,0,0),(2698,403,'灞桥区',610111,0,0,0,0),(2699,403,'未央区',610112,0,0,0,0),(2700,403,'雁塔区',610113,0,0,0,0),(2701,403,'阎良区',610114,0,0,0,0),(2702,403,'临潼区',610115,0,0,0,0),(2703,403,'长安区',610116,0,0,0,0),(2704,403,'高陵区',610117,0,0,0,0),(2705,403,'蓝田县',610122,0,0,0,0),(2706,403,'周至县',610124,0,0,0,0),(2707,403,'户县',610125,0,0,0,0),(2708,404,'王益区',610202,0,0,0,0),(2709,404,'印台区',610203,0,0,0,0),(2710,404,'耀州区',610204,0,0,0,0),(2711,404,'宜君县',610222,0,0,0,0),(2712,405,'渭滨区',610302,0,0,0,0),(2713,405,'金台区',610303,0,0,0,0),(2714,405,'陈仓区',610304,0,0,0,0),(2715,405,'凤翔县',610322,0,0,0,0),(2716,405,'岐山县',610323,0,0,0,0),(2717,405,'扶风县',610324,0,0,0,0),(2718,405,'眉县',610326,0,0,0,0),(2719,405,'陇县',610327,0,0,0,0),(2720,405,'千阳县',610328,0,0,0,0),(2721,405,'麟游县',610329,0,0,0,0),(2722,405,'凤县',610330,0,0,0,0),(2723,405,'太白县',610331,0,0,0,0),(2724,406,'秦都区',610402,0,0,0,0),(2725,406,'杨陵区',610403,0,0,0,0),(2726,406,'渭城区',610404,0,0,0,0),(2727,406,'三原县',610422,0,0,0,0),(2728,406,'泾阳县',610423,0,0,0,0),(2729,406,'乾县',610424,0,0,0,0),(2730,406,'礼泉县',610425,0,0,0,0),(2731,406,'永寿县',610426,0,0,0,0),(2732,406,'彬县',610427,0,0,0,0),(2733,406,'长武县',610428,0,0,0,0),(2734,406,'旬邑县',610429,0,0,0,0),(2735,406,'淳化县',610430,0,0,0,0),(2736,406,'武功县',610431,0,0,0,0),(2737,406,'兴平市',610481,0,0,0,0),(2738,407,'临渭区',610502,0,0,0,0),(2739,407,'华县',610521,0,0,0,0),(2740,407,'潼关县',610522,0,0,0,0),(2741,407,'大荔县',610523,0,0,0,0),(2742,407,'合阳县',610524,0,0,0,0),(2743,407,'澄城县',610525,0,0,0,0),(2744,407,'蒲城县',610526,0,0,0,0),(2745,407,'白水县',610527,0,0,0,0),(2746,407,'富平县',610528,0,0,0,0),(2747,407,'韩城市',610581,0,0,0,0),(2748,407,'华阴市',610582,0,0,0,0),(2749,408,'宝塔区',610602,0,0,0,0),(2750,408,'延长县',610621,0,0,0,0),(2751,408,'延川县',610622,0,0,0,0),(2752,408,'子长县',610623,0,0,0,0),(2753,408,'安塞县',610624,0,0,0,0),(2754,408,'志丹县',610625,0,0,0,0),(2755,408,'吴起县',610626,0,0,0,0),(2756,408,'甘泉县',610627,0,0,0,0),(2757,408,'富县',610628,0,0,0,0),(2758,408,'洛川县',610629,0,0,0,0),(2759,408,'宜川县',610630,0,0,0,0),(2760,408,'黄龙县',610631,0,0,0,0),(2761,408,'黄陵县',610632,0,0,0,0),(2762,409,'汉台区',610702,0,0,0,0),(2763,409,'南郑县',610721,0,0,0,0),(2764,409,'城固县',610722,0,0,0,0),(2765,409,'洋县',610723,0,0,0,0),(2766,409,'西乡县',610724,0,0,0,0),(2767,409,'勉县',610725,0,0,0,0),(2768,409,'宁强县',610726,0,0,0,0),(2769,409,'略阳县',610727,0,0,0,0),(2770,409,'镇巴县',610728,0,0,0,0),(2771,409,'留坝县',610729,0,0,0,0),(2772,409,'佛坪县',610730,0,0,0,0),(2773,410,'榆阳区',610802,0,0,0,0),(2774,410,'神木县',610821,0,0,0,0),(2775,410,'府谷县',610822,0,0,0,0),(2776,410,'横山县',610823,0,0,0,0),(2777,410,'靖边县',610824,0,0,0,0),(2778,410,'定边县',610825,0,0,0,0),(2779,410,'绥德县',610826,0,0,0,0),(2780,410,'米脂县',610827,0,0,0,0),(2781,410,'佳县',610828,0,0,0,0),(2782,410,'吴堡县',610829,0,0,0,0),(2783,410,'清涧县',610830,0,0,0,0),(2784,410,'子洲县',610831,0,0,0,0),(2785,411,'汉滨区',610902,0,0,0,0),(2786,411,'汉阴县',610921,0,0,0,0),(2787,411,'石泉县',610922,0,0,0,0),(2788,411,'宁陕县',610923,0,0,0,0),(2789,411,'紫阳县',610924,0,0,0,0),(2790,411,'岚皋县',610925,0,0,0,0),(2791,411,'平利县',610926,0,0,0,0),(2792,411,'镇坪县',610927,0,0,0,0),(2793,411,'旬阳县',610928,0,0,0,0),(2794,411,'白河县',610929,0,0,0,0),(2795,412,'商州区',611002,0,0,0,0),(2796,412,'洛南县',611021,0,0,0,0),(2797,412,'丹凤县',611022,0,0,0,0),(2798,412,'商南县',611023,0,0,0,0),(2799,412,'山阳县',611024,0,0,0,0),(2800,412,'镇安县',611025,0,0,0,0),(2801,412,'柞水县',611026,0,0,0,0),(2802,413,'城关区',620102,0,0,0,0),(2803,413,'七里河区',620103,0,0,0,0),(2804,413,'西固区',620104,0,0,0,0),(2805,413,'安宁区',620105,0,0,0,0),(2806,413,'红古区',620111,0,0,0,0),(2807,413,'永登县',620121,0,0,0,0),(2808,413,'皋兰县',620122,0,0,0,0),(2809,413,'榆中县',620123,0,0,0,0),(2810,415,'金川区',620302,0,0,0,0),(2811,415,'永昌县',620321,0,0,0,0),(2812,416,'白银区',620402,0,0,0,0),(2813,416,'平川区',620403,0,0,0,0),(2814,416,'靖远县',620421,0,0,0,0),(2815,416,'会宁县',620422,0,0,0,0),(2816,416,'景泰县',620423,0,0,0,0),(2817,417,'秦州区',620502,0,0,0,0),(2818,417,'麦积区',620503,0,0,0,0),(2819,417,'清水县',620521,0,0,0,0),(2820,417,'秦安县',620522,0,0,0,0),(2821,417,'甘谷县',620523,0,0,0,0),(2822,417,'武山县',620524,0,0,0,0),(2823,417,'张家川回族',620525,0,0,0,0),(2824,418,'凉州区',620602,0,0,0,0),(2825,418,'民勤县',620621,0,0,0,0),(2826,418,'古浪县',620622,0,0,0,0),(2827,418,'天祝藏族',620623,0,0,0,0),(2828,419,'甘州区',620702,0,0,0,0),(2829,419,'肃南裕固族',620721,0,0,0,0),(2830,419,'民乐县',620722,0,0,0,0),(2831,419,'临泽县',620723,0,0,0,0),(2832,419,'高台县',620724,0,0,0,0),(2833,419,'山丹县',620725,0,0,0,0),(2834,420,'崆峒区',620802,0,0,0,0),(2835,420,'泾川县',620821,0,0,0,0),(2836,420,'灵台县',620822,0,0,0,0),(2837,420,'崇信县',620823,0,0,0,0),(2838,420,'华亭县',620824,0,0,0,0),(2839,420,'庄浪县',620825,0,0,0,0),(2840,420,'静宁县',620826,0,0,0,0),(2841,421,'肃州区',620902,0,0,0,0),(2842,421,'金塔县',620921,0,0,0,0),(2843,421,'瓜州县',620922,0,0,0,0),(2844,421,'肃北蒙古族',620923,0,0,0,0),(2845,421,'阿克塞哈萨克族',620924,0,0,0,0),(2846,421,'玉门市',620981,0,0,0,0),(2847,421,'敦煌市',620982,0,0,0,0),(2848,422,'西峰区',621002,0,0,0,0),(2849,422,'庆城县',621021,0,0,0,0),(2850,422,'环县',621022,0,0,0,0),(2851,422,'华池县',621023,0,0,0,0),(2852,422,'合水县',621024,0,0,0,0),(2853,422,'正宁县',621025,0,0,0,0),(2854,422,'宁县',621026,0,0,0,0),(2855,422,'镇原县',621027,0,0,0,0),(2856,423,'安定区',621102,0,0,0,0),(2857,423,'通渭县',621121,0,0,0,0),(2858,423,'陇西县',621122,0,0,0,0),(2859,423,'渭源县',621123,0,0,0,0),(2860,423,'临洮县',621124,0,0,0,0),(2861,423,'漳县',621125,0,0,0,0),(2862,423,'岷县',621126,0,0,0,0),(2863,424,'武都区',621202,0,0,0,0),(2864,424,'成县',621221,0,0,0,0),(2865,424,'文县',621222,0,0,0,0),(2866,424,'宕昌县',621223,0,0,0,0),(2867,424,'康县',621224,0,0,0,0),(2868,424,'西和县',621225,0,0,0,0),(2869,424,'礼县',621226,0,0,0,0),(2870,424,'徽县',621227,0,0,0,0),(2871,424,'两当县',621228,0,0,0,0),(2872,425,'临夏市',622901,0,0,0,0),(2873,425,'临夏县',622921,0,0,0,0),(2874,425,'康乐县',622922,0,0,0,0),(2875,425,'永靖县',622923,0,0,0,0),(2876,425,'广河县',622924,0,0,0,0),(2877,425,'和政县',622925,0,0,0,0),(2878,425,'东乡族',622926,0,0,0,0),(2879,425,'积石山保安族东乡族撒拉族',622927,0,0,0,0),(2880,426,'合作市',623001,0,0,0,0),(2881,426,'临潭县',623021,0,0,0,0),(2882,426,'卓尼县',623022,0,0,0,0),(2883,426,'舟曲县',623023,0,0,0,0),(2884,426,'迭部县',623024,0,0,0,0),(2885,426,'玛曲县',623025,0,0,0,0),(2886,426,'碌曲县',623026,0,0,0,0),(2887,426,'夏河县',623027,0,0,0,0),(2888,427,'城东区',630102,0,0,0,0),(2889,427,'城中区',630103,0,0,0,0),(2890,427,'城西区',630104,0,0,0,0),(2891,427,'城北区',630105,0,0,0,0),(2892,427,'大通回族土族',630121,0,0,0,0),(2893,427,'湟中县',630122,0,0,0,0),(2894,427,'湟源县',630123,0,0,0,0),(2895,428,'乐都区',630202,0,0,0,0),(2896,428,'平安区',630203,0,0,0,0),(2897,428,'民和回族土族',630222,0,0,0,0),(2898,428,'互助土族',630223,0,0,0,0),(2899,428,'化隆回族',630224,0,0,0,0),(2900,428,'循化撒拉族',630225,0,0,0,0),(2901,429,'门源回族',632221,0,0,0,0),(2902,429,'祁连县',632222,0,0,0,0),(2903,429,'海晏县',632223,0,0,0,0),(2904,429,'刚察县',632224,0,0,0,0),(2905,430,'同仁县',632321,0,0,0,0),(2906,430,'尖扎县',632322,0,0,0,0),(2907,430,'泽库县',632323,0,0,0,0),(2908,430,'河南蒙古族',632324,0,0,0,0),(2909,431,'共和县',632521,0,0,0,0),(2910,431,'同德县',632522,0,0,0,0),(2911,431,'贵德县',632523,0,0,0,0),(2912,431,'兴海县',632524,0,0,0,0),(2913,431,'贵南县',632525,0,0,0,0),(2914,432,'玛沁县',632621,0,0,0,0),(2915,432,'班玛县',632622,0,0,0,0),(2916,432,'甘德县',632623,0,0,0,0),(2917,432,'达日县',632624,0,0,0,0),(2918,432,'久治县',632625,0,0,0,0),(2919,432,'玛多县',632626,0,0,0,0),(2920,433,'玉树市',632701,0,0,0,0),(2921,433,'杂多县',632722,0,0,0,0),(2922,433,'称多县',632723,0,0,0,0),(2923,433,'治多县',632724,0,0,0,0),(2924,433,'囊谦县',632725,0,0,0,0),(2925,433,'曲麻莱县',632726,0,0,0,0),(2926,434,'格尔木市',632801,0,0,0,0),(2927,434,'德令哈市',632802,0,0,0,0),(2928,434,'乌兰县',632821,0,0,0,0),(2929,434,'都兰县',632822,0,0,0,0),(2930,434,'天峻县',632823,0,0,0,0),(2931,434,'海西蒙古族藏族',632825,0,0,0,0),(2932,435,'兴庆区',640104,0,0,0,0),(2933,435,'西夏区',640105,0,0,0,0),(2934,435,'金凤区',640106,0,0,0,0),(2935,435,'永宁县',640121,0,0,0,0),(2936,435,'贺兰县',640122,0,0,0,0),(2937,435,'灵武市',640181,0,0,0,0),(2938,436,'大武口区',640202,0,0,0,0),(2939,436,'惠农区',640205,0,0,0,0),(2940,436,'平罗县',640221,0,0,0,0),(2941,437,'利通区',640302,0,0,0,0),(2942,437,'红寺堡区',640303,0,0,0,0),(2943,437,'盐池县',640323,0,0,0,0),(2944,437,'同心县',640324,0,0,0,0),(2945,437,'青铜峡市',640381,0,0,0,0),(2946,438,'原州区',640402,0,0,0,0),(2947,438,'西吉县',640422,0,0,0,0),(2948,438,'隆德县',640423,0,0,0,0),(2949,438,'泾源县',640424,0,0,0,0),(2950,438,'彭阳县',640425,0,0,0,0),(2951,439,'沙坡头区',640502,0,0,0,0),(2952,439,'中宁县',640521,0,0,0,0),(2953,439,'海原县',640522,0,0,0,0),(2954,440,'天山区',650102,0,0,0,0),(2955,440,'沙依巴克区',650103,0,0,0,0),(2956,440,'新市区',650104,0,0,0,0),(2957,440,'水磨沟区',650105,0,0,0,0),(2958,440,'头屯河区',650106,0,0,0,0),(2959,440,'达坂城区',650107,0,0,0,0),(2960,440,'米东区',650109,0,0,0,0),(2961,440,'乌鲁木齐县',650121,0,0,0,0),(2962,441,'独山子区',650202,0,0,0,0),(2963,441,'克拉玛依区',650203,0,0,0,0),(2964,441,'白碱滩区',650204,0,0,0,0),(2965,441,'乌尔禾区',650205,0,0,0,0),(2966,442,'高昌区',652101,0,0,0,0),(2967,442,'鄯善县',652122,0,0,0,0),(2968,442,'托克逊县',652123,0,0,0,0),(2969,443,'哈密市',652201,0,0,0,0),(2970,443,'巴里坤哈萨克',652222,0,0,0,0),(2971,443,'伊吾县',652223,0,0,0,0),(2972,444,'昌吉市',652301,0,0,0,0),(2973,444,'阜康市',652302,0,0,0,0),(2974,444,'呼图壁县',652323,0,0,0,0),(2975,444,'玛纳斯县',652324,0,0,0,0),(2976,444,'奇台县',652325,0,0,0,0),(2977,444,'吉木萨尔县',652327,0,0,0,0),(2978,444,'木垒哈萨克',652328,0,0,0,0),(2979,445,'博乐市',652701,0,0,0,0),(2980,445,'阿拉山口市',652702,0,0,0,0),(2981,445,'精河县',652722,0,0,0,0),(2982,445,'温泉县',652723,0,0,0,0),(2983,446,'库尔勒市',652801,0,0,0,0),(2984,446,'轮台县',652822,0,0,0,0),(2985,446,'尉犁县',652823,0,0,0,0),(2986,446,'若羌县',652824,0,0,0,0),(2987,446,'且末县',652825,0,0,0,0),(2988,446,'焉耆回族',652826,0,0,0,0),(2989,446,'和静县',652827,0,0,0,0),(2990,446,'和硕县',652828,0,0,0,0),(2991,446,'博湖县',652829,0,0,0,0),(2992,447,'阿克苏市',652901,0,0,0,0),(2993,447,'温宿县',652922,0,0,0,0),(2994,447,'库车县',652923,0,0,0,0),(2995,447,'沙雅县',652924,0,0,0,0),(2996,447,'新和县',652925,0,0,0,0),(2997,447,'拜城县',652926,0,0,0,0),(2998,447,'乌什县',652927,0,0,0,0),(2999,447,'阿瓦提县',652928,0,0,0,0),(3000,447,'柯坪县',652929,0,0,0,0),(3001,448,'阿图什市',653001,0,0,0,0),(3002,448,'阿克陶县',653022,0,0,0,0),(3003,448,'阿合奇县',653023,0,0,0,0),(3004,448,'乌恰县',653024,0,0,0,0),(3005,449,'喀什市',653101,0,0,0,0),(3006,449,'疏附县',653121,0,0,0,0),(3007,449,'疏勒县',653122,0,0,0,0),(3008,449,'英吉沙县',653123,0,0,0,0),(3009,449,'泽普县',653124,0,0,0,0),(3010,449,'莎车县',653125,0,0,0,0),(3011,449,'叶城县',653126,0,0,0,0),(3012,449,'麦盖提县',653127,0,0,0,0),(3013,449,'岳普湖县',653128,0,0,0,0),(3014,449,'伽师县',653129,0,0,0,0),(3015,449,'巴楚县',653130,0,0,0,0),(3016,449,'塔什库尔干塔吉克',653131,0,0,0,0),(3017,450,'和田市',653201,0,0,0,0),(3018,450,'和田县',653221,0,0,0,0),(3019,450,'墨玉县',653222,0,0,0,0),(3020,450,'皮山县',653223,0,0,0,0),(3021,450,'洛浦县',653224,0,0,0,0),(3022,450,'策勒县',653225,0,0,0,0),(3023,450,'于田县',653226,0,0,0,0),(3024,450,'民丰县',653227,0,0,0,0),(3025,451,'伊宁市',654002,0,0,0,0),(3026,451,'奎屯市',654003,0,0,0,0),(3027,451,'霍尔果斯市',654004,0,0,0,0),(3028,451,'伊宁县',654021,0,0,0,0),(3029,451,'察布查尔锡伯',654022,0,0,0,0),(3030,451,'霍城县',654023,0,0,0,0),(3031,451,'巩留县',654024,0,0,0,0),(3032,451,'新源县',654025,0,0,0,0),(3033,451,'昭苏县',654026,0,0,0,0),(3034,451,'特克斯县',654027,0,0,0,0),(3035,451,'尼勒克县',654028,0,0,0,0),(3036,452,'塔城市',654201,0,0,0,0),(3037,452,'乌苏市',654202,0,0,0,0),(3038,452,'额敏县',654221,0,0,0,0),(3039,452,'沙湾县',654223,0,0,0,0),(3040,452,'托里县',654224,0,0,0,0),(3041,452,'裕民县',654225,0,0,0,0),(3042,452,'和布克赛尔蒙古',654226,0,0,0,0),(3043,453,'阿勒泰市',654301,0,0,0,0),(3044,453,'布尔津县',654321,0,0,0,0),(3045,453,'富蕴县',654322,0,0,0,0),(3046,453,'福海县',654323,0,0,0,0),(3047,453,'哈巴河县',654324,0,0,0,0),(3048,453,'青河县',654325,0,0,0,0),(3049,453,'吉木乃县',654326,0,0,0,0);
/*!40000 ALTER TABLE `bs_citys` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_designs`
--

DROP TABLE IF EXISTS `bs_designs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_designs` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '设计名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '供求类型：1个人供应，2个人需求，3企业供应，4企业需求，',
  `cate` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '设计类型：房产，效果图，平面，漫游',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布者id',
  `intro` varchar(255) NOT NULL COMMENT '简介',
  `detail` varchar(1000) NOT NULL COMMENT '详情',
  `money` float unsigned NOT NULL DEFAULT '0' COMMENT '价格，单位元',
  `thumb` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '缩略图id',
  `click` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '点击量',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='设计表 bs_designs';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_designs`
--

LOCK TABLES `bs_designs` WRITE;
/*!40000 ALTER TABLE `bs_designs` DISABLE KEYS */;
INSERT INTO `bs_designs` VALUES (1,'嘎嘎嘎',1,1,1,'而过的风格吧而过的风格吧而过的风格吧而过的风格吧而过的风格吧而过的风格吧而过的风格吧而过的风格吧','<p>而地方吧</p>',55,0,0,10,0,1470573399,1470574616),(2,'设计001',3,1,1,'ggggggggggg','<p>gggggggggggggggggggggg</p>',11,0,0,10,0,1470816620,0);
/*!40000 ALTER TABLE `bs_designs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_designs_pic`
--

DROP TABLE IF EXISTS `bs_designs_pic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_designs_pic` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `design_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '设计id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='设计图片关联表 bs_designs_pic';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_designs_pic`
--

LOCK TABLES `bs_designs_pic` WRITE;
/*!40000 ALTER TABLE `bs_designs_pic` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_designs_pic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_entertain_pic`
--

DROP TABLE IF EXISTS `bs_entertain_pic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_entertain_pic` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `entertain_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '娱乐id',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='娱乐图片关联表 bs_entertain_pic';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_entertain_pic`
--

LOCK TABLES `bs_entertain_pic` WRITE;
/*!40000 ALTER TABLE `bs_entertain_pic` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_entertain_pic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_entertains`
--

DROP TABLE IF EXISTS `bs_entertains`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_entertains` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL COMMENT '娱乐标题',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '供求列表：1企业供应，2企业需求',
  `intro` varchar(2000) NOT NULL COMMENT '内容',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布方id',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '控制是否显示：0不显示，1显示',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0为不放入回收站，1为放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='娱乐表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_entertains`
--

LOCK TABLES `bs_entertains` WRITE;
/*!40000 ALTER TABLE `bs_entertains` DISABLE KEYS */;
INSERT INTO `bs_entertains` VALUES (1,'娱乐001',1,'rthyngrthgggggggggggggggggggggggggggggggggggggggggggggggggggggggghhhhhhhhhhhhhhh',1,10,1,0,20160322,20160322);
/*!40000 ALTER TABLE `bs_entertains` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_goods`
--

DROP TABLE IF EXISTS `bs_goods`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_goods` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '视频名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '片源类型：1产品系列，2花絮系列',
  `type` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '产品主体：1个人需求，2设计师供应，3企业需求，4企业供应',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '样片类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13节日聚会，14个人短片，',
  `intro` varchar(1000) NOT NULL COMMENT '视频简介',
  `title` varchar(255) NOT NULL COMMENT '鼠标移动的文字',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片链接id，关联图片表bs_pics',
  `video_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '视频链接id，链接视频表bs_videos',
  `money` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '预报价，单位元',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布人：需求用户，设计师，公司',
  `uname` varchar(255) NOT NULL COMMENT '发布人名称',
  `click` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '点击自增，与会员无关，象征性的',
  `recommend` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否推荐：0不推荐，1推荐，默认0',
  `newest` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '是否最新的：0不是，1是',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '前台列表是否显示：0不显示，1显示，默认1',
  `isshow2` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '用户企业控制前台列表是否显示：0不显示，1显示，默认1',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='产品表（上传的视频）：供应方提供的产品、需求方提供的需求样片';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_goods`
--

LOCK TABLES `bs_goods` WRITE;
/*!40000 ALTER TABLE `bs_goods` DISABLE KEYS */;
INSERT INTO `bs_goods` VALUES (1,'个人需求001',1,1,5,'宣传片','宣传片',4,1,0,1,'jiuge',0,0,1,10,1,1,0,1474253357,0);
/*!40000 ALTER TABLE `bs_goods` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_goodsCus`
--

DROP TABLE IF EXISTS `bs_goodsCus`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_goodsCus` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL COMMENT '视频名称',
  `intro` varchar(1000) NOT NULL COMMENT '制作要求',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布用户',
  `money1` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '客户准备预算，单位元',
  `supply` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '供应方的uid',
  `money2` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '最终定价，单位元',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='视频定制要求表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_goodsCus`
--

LOCK TABLES `bs_goodsCus` WRITE;
/*!40000 ALTER TABLE `bs_goodsCus` DISABLE KEYS */;
INSERT INTO `bs_goodsCus` VALUES (1,'个人需求001','hrtjmntyjm',1,1000,1,0,1474253357,0);
/*!40000 ALTER TABLE `bs_goodsCus` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_goodsCus_users`
--

DROP TABLE IF EXISTS `bs_goodsCus_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_goodsCus_users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `cus_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '片源定制id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '竞选用户',
  `link` varchar(255) NOT NULL COMMENT '参考样片',
  `intro` varchar(255) NOT NULL COMMENT '竞选说明',
  `money` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '参考价格，单位元',
  `makeTime` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '制作周期，单位天',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='用户作品竞选表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_goodsCus_users`
--

LOCK TABLES `bs_goodsCus_users` WRITE;
/*!40000 ALTER TABLE `bs_goodsCus_users` DISABLE KEYS */;
INSERT INTO `bs_goodsCus_users` VALUES (1,1,2,'','',0,0,1474253357,0);
/*!40000 ALTER TABLE `bs_goodsCus_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_goods_click`
--

DROP TABLE IF EXISTS `bs_goods_click`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_goods_click` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `gid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '商品id，视频为主',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='视频点击表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_goods_click`
--

LOCK TABLES `bs_goods_click` WRITE;
/*!40000 ALTER TABLE `bs_goods_click` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_goods_click` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_goods_like`
--

DROP TABLE IF EXISTS `bs_goods_like`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_goods_like` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `gid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '商品id，视频为主',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='视频喜欢表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_goods_like`
--

LOCK TABLES `bs_goods_like` WRITE;
/*!40000 ALTER TABLE `bs_goods_like` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_goods_like` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_ideas`
--

DROP TABLE IF EXISTS `bs_ideas`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_ideas` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '供求类型：1供应，2需求',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '0' COMMENT '创意类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13节日聚会，14个人短片，',
  `thumb` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '缩略图id',
  `intro` varchar(255) NOT NULL COMMENT '简介',
  `content` text NOT NULL COMMENT '创意内容',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布的用户id',
  `money` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '价格，单位元',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '前台列表是否显示：0前台列表不显示，1前台列表显示',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='创意表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_ideas`
--

LOCK TABLES `bs_ideas` WRITE;
/*!40000 ALTER TABLE `bs_ideas` DISABLE KEYS */;
INSERT INTO `bs_ideas` VALUES (1,'创意1',1,4,0,'efrbgrdfbg','<p>而非v代表</p>',1,0,10,1,0,20160417,20160417),(2,'创意部分的白癜风',1,4,0,'wefdgbefdv','<p>不辜负你发个你突然发红包让头发的非v别的人副本二本的日本</p>',1,0,10,1,0,20160421,0),(3,'创意123456',1,4,0,'fngbvrrthgfbrthf','<p>不同功能同一个男人太烦恼吧 不同人反复给你发给你发的吧v辅导班该方法v表单v废话么放入后天就能GV干嘛换个号部分或讲不出的生物科技获得鼠标不同人还能听任何人挺好投入和</p>',1,10,10,1,0,20160421,0);
/*!40000 ALTER TABLE `bs_ideas` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_ideas_click`
--

DROP TABLE IF EXISTS `bs_ideas_click`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_ideas_click` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ideaid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创意id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='创意点赞表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_ideas_click`
--

LOCK TABLES `bs_ideas_click` WRITE;
/*!40000 ALTER TABLE `bs_ideas_click` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_ideas_click` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_ideas_collect`
--

DROP TABLE IF EXISTS `bs_ideas_collect`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_ideas_collect` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ideaid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创意id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='创意收藏表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_ideas_collect`
--

LOCK TABLES `bs_ideas_collect` WRITE;
/*!40000 ALTER TABLE `bs_ideas_collect` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_ideas_collect` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_ideas_read`
--

DROP TABLE IF EXISTS `bs_ideas_read`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_ideas_read` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ideaid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创意id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 COMMENT='创意阅读表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_ideas_read`
--

LOCK TABLES `bs_ideas_read` WRITE;
/*!40000 ALTER TABLE `bs_ideas_read` DISABLE KEYS */;
INSERT INTO `bs_ideas_read` VALUES (1,0,2,20160703,0),(2,0,2,20160703,0),(3,0,2,20160703,0),(4,0,2,20160703,0),(5,0,2,20160703,0),(6,0,2,20160703,0),(7,0,2,20160703,0),(8,0,2,20160703,0),(9,0,2,20160703,0),(10,0,2,20160703,0),(11,0,2,20160703,0),(12,0,2,20160703,0),(13,0,2,20160703,0),(14,0,2,20160705,0),(15,0,2,20160705,0),(16,0,2,20160705,0),(17,0,2,20160705,0),(18,0,2,20160705,0),(19,0,2,20160705,0),(20,0,2,20160705,0),(21,0,2,20160705,0),(22,0,2,20160705,0),(23,0,2,20160705,0),(24,0,2,20160705,0),(25,0,2,20160705,0),(26,0,2,20160705,0),(27,0,2,20160705,0),(28,0,2,20160705,0),(29,0,2,20160707,0),(30,0,2,20160707,0),(31,0,2,20160707,0),(32,0,2,20160707,0),(33,0,2,20160707,0),(34,0,2,20160707,0),(35,0,2,20160707,0),(36,0,2,20160707,0),(37,0,2,20160707,0),(38,0,2,20160707,0),(39,0,2,20160707,0),(40,0,2,2016,0),(41,0,2,2016,0),(42,0,2,2016,0),(43,0,2,2016,0),(44,0,2,2016,0),(45,0,2,2016,0),(46,0,2,2016,0),(47,0,2,2016,0),(48,0,2,2016,0),(49,0,2,2016,0),(50,0,2,2016,0),(51,0,2,2016,0);
/*!40000 ALTER TABLE `bs_ideas_read` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_links`
--

DROP TABLE IF EXISTS `bs_links`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_links` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '链接名称',
  `cid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '企业id，0代表本站',
  `title` varchar(255) NOT NULL COMMENT '鼠标移动的提示文字',
  `type_id` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '页面的哪个部位：1header，2navigate，3footer',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片id，关联bs_pics',
  `intro` varchar(500) NOT NULL COMMENT '链接介绍',
  `link` varchar(255) NOT NULL COMMENT '访问地址链接：前台(cid==0，/XXX)，企业前台(cid!=0，/c/{cid}/XXX)',
  `display_way` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '显示方式：1文字链接，2图片链接',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '在前台页面是否显示：0不显示，1显示',
  `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '父id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8 COMMENT='网站链接表：包含header头部链接、navigate菜单导航栏链接、footer脚部链接等';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_links`
--

LOCK TABLES `bs_links` WRITE;
/*!40000 ALTER TABLE `bs_links` DISABLE KEYS */;
INSERT INTO `bs_links` VALUES (1,'首页',0,'',2,0,'','/',1,20,1,0,20160113,0),(2,'产品样片',0,'',2,0,'','/product',1,20,1,0,20160417,0),(3,'在线作品',0,'',2,0,'','/creation',1,20,1,0,20160417,0),(4,'供应企业',0,'',2,0,'','/supply',1,10,1,0,20160417,0),(5,'需求信息',0,'',2,0,'','/demand',1,10,1,0,20160417,0),(6,'娱乐频道',0,'',2,0,'','/entertain',1,10,1,0,20160417,0),(7,'租赁频道',0,'',2,0,'','/rent',1,10,1,0,20160417,0),(8,'设计频道',0,'',2,0,'','/design',1,10,1,0,20160417,0),(9,'关于本站',0,'',2,0,'','/about',1,10,1,0,20160417,0),(10,'创意点子',0,'',2,0,'','/idea',1,10,1,0,20160417,0),(11,'用户意见',0,'请留下您的宝贵意见哦',2,0,'','/opinion',1,10,1,0,20160417,0),(12,'首页',0,'底部链接，此链接带修改',3,0,'','/',1,10,1,0,20160417,20160417),(13,'友情链接',0,'此链接带修改',3,0,'','/',1,10,1,0,20160417,20160417),(14,'安全网盾',0,'此链接带修改',3,0,'','/',1,10,1,0,20160417,0),(15,'链接1',0,'此链接带修改',3,0,'','/',1,10,1,0,20160417,0),(16,'链接2',0,'此链接带修改',3,0,'','/',1,10,1,0,20160417,0),(17,'链接3',0,'此链接带修改',3,0,'','/',1,10,1,0,20160417,0),(18,'首页',1,'',2,0,'','/c/1',1,10,1,0,20160506,20160506),(19,'关于公司',1,'',2,0,'','/c/1/about',1,10,1,0,20160506,0),(20,'产品',1,'',2,0,'','/c/1/product',1,10,1,0,20160506,0),(21,'花絮',1,'',2,0,'','/c/1/part',1,10,1,0,20160506,0),(22,'服务',1,'',2,0,'','/c/1/firm',1,10,1,0,20160506,0),(23,'团队',1,'',2,0,'','/c/1/team',1,10,1,0,20160506,0),(24,'招聘',1,'',2,0,'','/c/1/recruit',1,10,1,0,20160506,0),(25,'联系方式',1,'',2,0,'','/c/1/contact',1,10,1,0,20160506,0),(26,'故事分镜',0,'分镜画面列表',2,0,'','/storyboard',1,20,1,0,20160624,0);
/*!40000 ALTER TABLE `bs_links` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_menu_auths`
--

DROP TABLE IF EXISTS `bs_menu_auths`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_menu_auths` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `auth` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '类型：0普通用户,1个人会员，2普通企业，3设计师，4广告公司，5影视公司，6租赁公司',
  `menu` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '功能id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8 COMMENT='权限表 bs_authorization（用户权限分配）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_menu_auths`
--

LOCK TABLES `bs_menu_auths` WRITE;
/*!40000 ALTER TABLE `bs_menu_auths` DISABLE KEYS */;
INSERT INTO `bs_menu_auths` VALUES (2,1,4,1476866636,0),(4,1,8,1476866643,0),(5,1,6,1476866644,0),(10,1,43,1476868176,0),(11,1,1,1476924977,0),(14,0,3,1476925043,0),(15,0,1,1476925111,0),(17,0,37,1476925149,0),(20,0,36,1476925170,0);
/*!40000 ALTER TABLE `bs_menu_auths` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_menus`
--

DROP TABLE IF EXISTS `bs_menus`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_menus` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '权限名称',
  `type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '菜单类型：1会员后台member，2个人后台person，3企业后台company',
  `intro` varchar(255) NOT NULL COMMENT '权限说明',
  `namespace` varchar(255) NOT NULL COMMENT '命名空间',
  `controller_prefix` varchar(255) NOT NULL DEFAULT '' COMMENT '控制器名称',
  `platUrl` varchar(255) NOT NULL COMMENT '平台路由',
  `url` varchar(255) NOT NULL COMMENT '访问路径的部分 url',
  `action` varchar(255) NOT NULL COMMENT '操作方法名称',
  `style_class` varchar(255) DEFAULT NULL COMMENT 'class样式名称',
  `pid` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '上级ID',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '2' COMMENT '前台是否显示：1不显示，2显示',
  `isshow2` tinyint(1) unsigned NOT NULL DEFAULT '2' COMMENT '用户企业前台是否显示：1不显示，2显示',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序，默认10',
  `sort2` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '用户企业后台排序，值越大越靠前，默认10',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 COMMENT='前台左侧菜单控制表 bs_menus';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_menus`
--

LOCK TABLES `bs_menus` WRITE;
/*!40000 ALTER TABLE `bs_menus` DISABLE KEYS */;
INSERT INTO `bs_menus` VALUES (1,'账户首页',1,'会员后台左侧菜单控制','App\\Http\\Controllers\\Member','Home','member','home','index','',0,2,2,10,10,20160306,20160306),(2,'会员账户',1,'','App\\Http\\Controllers\\Member','Setting','member','setting','index','',0,2,2,10,10,20160229,20160412),(3,'在线创作',1,'','App\\Http\\Controllers\\Member','Product','member','product','index','',0,2,2,10,10,20160312,20160314),(4,'供求管理',1,'','App\\Http\\Controllers\\Member','PersonD','member','goods','index','',0,2,2,10,10,20160229,1479431301),(5,'企业供求',1,'','App\\Http\\Controllers\\Member','CompanyD','member','companyD','index','',0,1,2,10,10,20160312,20160319),(6,'视频管理',1,'','App\\Http\\Controllers\\Member','Goods','member','goods','index','',4,2,2,10,10,20160312,1479440336),(7,'视频作品',1,'','App\\Http\\Controllers\\Member','GoodsS','member','goodsS','index','',4,1,2,10,10,20160312,1479440109),(8,'企业需求',1,'','App\\Http\\Controllers\\Member','CompanyD','member','companyD','index','',4,1,2,10,10,20160312,1479431725),(9,'企业作品',1,'','App\\Http\\Controllers\\Member','CompanyS','member','companyS','index','',4,1,2,10,10,20160312,1479431746),(10,'租赁管理',1,'','App\\Http\\Controllers\\Member','Rent','member','rent','index','',4,2,2,10,10,20160312,1479431864),(11,'娱乐管理',1,'','App\\Http\\Controllers\\Member','Entertain','member','entertain','index','',4,2,2,10,10,20160312,1479432012),(12,'基本管理',1,'','App\\Http\\Controllers\\Member','Pic','member','pic','index','',0,2,2,10,10,20160313,1479432274),(13,'话题管理',1,'','App\\Http\\Controllers\\Member','Talk','member','talk','index','',0,2,2,0,10,20160313,20160319),(14,'创意管理',1,'','App\\Http\\Controllers\\Member','Idea','member','idea','index','',4,2,2,10,10,20160416,1479948831),(15,'个人主页',1,'','App\\Http\\Controllers\\Person','Home','person','s','index','',4,2,2,20,10,20160417,20160422),(16,'企业后台',1,'','App\\Http\\Controllers\\Company','Home','company/admin','home','index','',4,2,2,20,10,20160417,1479431623),(17,'艺人管理',1,'','App\\Http\\Controllers\\Member','Actor','member','actor','index','',4,2,2,10,10,20160423,1479431952),(18,'我的图片',1,'','App\\Http\\Controllers\\Member','Pic','member','pic','index','',12,2,2,20,10,20160424,20160424),(19,'我的视频',1,'','App\\Http\\Controllers\\Member','Videos','member','video','index','',12,2,2,20,10,20160424,20160424),(20,'首页',3,'','App\\Http\\Controllers\\Company','Home','company/admin','home','index','',0,2,2,10,10,20160426,0),(21,'后台权限',3,'页面布局','App\\Http\\Controllers\\Company','Auth','company/admin','auth','index','',0,1,2,10,10,20160426,20160426),(22,'公司信息',3,'','App\\Http\\Controllers\\Company','Info','company/admin','info','index','',0,2,2,10,10,20160426,20160426),(23,'内容设置',3,'','App\\Http\\Controllers\\Company','Content','company/admin','content','index','',0,2,2,10,10,20160426,20160426),(24,'页面布局',3,'','App\\Http\\Controllers\\Company','Layout','company/admin','layout','index','',22,2,2,10,10,20160426,20160426),(25,'基本设置',3,'','App\\Http\\Controllers\\Company','Basic','company/admin','basic','index','',22,2,2,10,10,20160426,20160426),(26,'其他页面',3,'','App\\Http\\Controllers\\Company','Single','company/admin','single','index','',22,2,2,10,10,20160426,20160426),(27,'广告编辑',3,'','App\\Http\\Controllers\\Company','Ppt','company/admin','ppt','index','',37,2,2,5,5,20160426,0),(28,'产品编辑',3,'','App\\Http\\Controllers\\Company','Product','company/admin','product','index','',23,2,2,10,10,20160426,0),(29,'团队编辑',3,'','App\\Http\\Controllers\\Company','Team','company/admin','team','index','',23,2,2,10,10,20160426,20160429),(30,'招聘编辑',3,'','App\\Http\\Controllers\\Company','Job','company/admin','job','index','',23,2,2,10,10,20160426,0),(31,'联系编辑',3,'','App\\Http\\Controllers\\Company','Contact','company/admin','contact','index','',23,2,2,10,10,20160426,20160428),(32,'花絮编辑',3,'','App\\Http\\Controllers\\Company','Part','company/admin','part','index','',23,2,2,10,10,20160428,20160428),(33,'图片管理',3,'','App\\Http\\Controllers\\Company','Pic','company/admin','pic','index','',37,2,2,10,5,20160428,20160428),(34,'视频管理',3,'','App\\Http\\Controllers\\Company','Video','company/admin','video','index','',37,2,2,10,5,20160428,20160428),(35,'关于公司',3,'','App\\Http\\Controllers\\Company','About','company/admin','about','index','',23,2,2,10,20,20160428,20160429),(36,'服务编辑',3,'','App\\Http\\Controllers\\Company','Firm','company/admin','firm','index','',23,2,2,10,10,20160428,20160429),(37,'综合应用',3,'','App\\Http\\Controllers\\Company','General','company/admin','general','index','',0,2,2,10,10,20160428,20160429),(38,'链接管理',3,'','App\\Http\\Controllers\\Company','Link','company/admin','link','index','',22,2,2,10,10,20160506,0),(39,'会员福利',1,'','App\\Http\\Controllers\\Member','Wallet','member','wallet','index','',0,2,2,5,10,20160513,20160513),(40,'创作定制',1,'','App\\Http\\Controllers\\Member','OrderVideo','member','orderVideo','index','',42,1,2,5,10,20160513,0),(41,'在线动画',1,'','App\\Http\\Controllers\\Member','Product','member','product','index','',3,2,2,10,10,20160513,20160513),(42,'订单管理',1,'','App\\Http\\Controllers\\Member','Order','member','order','index','',0,2,2,10,10,20160524,20160524),(43,'订单管理',1,'','App\\Http\\Controllers\\Member','Order','member','order','index','',42,2,2,10,10,20160524,0),(44,'离线动画',1,'','App\\Http\\Controllers\\Member','ProductVideo','member','proVideo','index','',3,2,2,10,10,20160524,0),(45,'创作订单',1,'','App\\Http\\Controllers\\Member','OrderProduct','member','orderpro','index','',42,2,2,10,10,20160524,0),(46,'分镜管理',1,'','App\\Http\\Controllers\\Member','StoryBoard','member','storyboard','index','',4,2,2,10,10,20160524,1479432155),(47,'设计管理',1,'','App\\Http\\Controllers\\Member','Design','member','design','index','',4,2,2,10,10,2016,1470818534),(48,'企业主页',1,'','App\\Http\\Controllers\\Member','Home','c','home','index','',4,2,2,10,10,1470818610,1479949724),(49,'话题列表',1,'','App\\Http\\Controllers\\Member','Talk','member','talk','index','',13,2,2,10,10,1470819935,0),(50,'片源定制',1,'','App\\Http\\Controllers\\Member','ProductCus','member','proCus','index','',4,2,2,10,10,1479036907,1479432063),(51,'消息管理',1,'','App\\Http\\Controllers\\Member','Message','member','message','index','',12,2,2,10,10,1479037234,0);
/*!40000 ALTER TABLE `bs_menus` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_message`
--

DROP TABLE IF EXISTS `bs_message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_message` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL COMMENT '消息标题',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '消息主体：1个人消息，2企业消息',
  `genre2` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '类型：1离线消息，2实时在线消息',
  `intro` varchar(3000) NOT NULL COMMENT '消息内容',
  `sender` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发件人id',
  `senderTime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发送时间',
  `accept` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '收件人id',
  `acceptTime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '收件时间',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '消息状态：1未发送，2已发送未接收，3已接收未读，4已读',
  `del` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='消息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_message`
--

LOCK TABLES `bs_message` WRITE;
/*!40000 ALTER TABLE `bs_message` DISABLE KEYS */;
INSERT INTO `bs_message` VALUES (1,'二等分地方',2,1,'发给你发干嘛你发给你发给你发个',2,1471499872,1,0,2,0,1471488573,1471491613),(2,'在线聊天',1,2,'123',1,1479026547,2,1479388153,4,0,1479026547,0),(3,'',1,2,'办法的年后发货\n                    <img src=\"/assets-home/emoticons/bq_6.gif\">',1,1479352211,2,1479388155,4,0,1479352211,0);
/*!40000 ALTER TABLE `bs_message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_opinions待处理`
--

DROP TABLE IF EXISTS `bs_opinions待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_opinions待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL COMMENT '标题',
  `intro` varchar(2000) NOT NULL COMMENT '内容',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '意见状态：1新意见，2处理中，3不满意，4满意',
  `remarks` varchar(255) NOT NULL COMMENT '留言：不满意时必填',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '2' COMMENT '在前台列表是否显示：1不显示，2显示，',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='用户意见表 (bs_opinions)：用户对本站的意见';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_opinions待处理`
--

LOCK TABLES `bs_opinions待处理` WRITE;
/*!40000 ALTER TABLE `bs_opinions待处理` DISABLE KEYS */;
INSERT INTO `bs_opinions待处理` VALUES (1,'意见11','<p>v表弟粪便规范化干玫瑰花吗</p>',1,2,'如果人比人11111111111',2,1476106254,1476106799),(2,'gbrthrthnrt','<p>hntrgfnhtgngtn</p>',1,4,'',2,1476440299,1476440384);
/*!40000 ALTER TABLE `bs_opinions待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_orders`
--

DROP TABLE IF EXISTS `bs_orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '订单名称',
  `serial` varchar(50) NOT NULL DEFAULT '0' COMMENT '订单编号',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '订单来源：1创意供应，2创意需求，3分镜供应，4分镜需求，5视频供应，6视频需求，7娱乐供应，8娱乐需求，9演员供应，10演员需求，1租赁供应，12租赁需求',
  `fromid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '订单来源表中的id',
  `seller` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '卖家id ',
  `sellerName` varchar(255) NOT NULL COMMENT '卖家名称',
  `buyer` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '买家id',
  `buyerName` varchar(255) NOT NULL COMMENT '买家名称',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '订单状态：创意订单状态：1新的创意，2确定创意，3拒绝创意，4创意免费，5创意收费，6办理订单，7确认收到，12订单成功，13订单失败。\r\n分镜订单状态：1新的分镜，2确定分镜，3拒绝分镜，4分镜免费，5分镜收费，6办理订单，7确认收到，12订单成功，13订单失败。\r\n视频制作订单状态：1新的样片，2确认制作，3拒绝制作，4分期收费，5效果协商，6二期收费，7确定成片，8三期收费，9出片交付，10尾款结清，11确认完成，12订单成功，13订单失败。',
  `remarks` varchar(255) NOT NULL COMMENT '拒绝理由',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '前台列表是否显示：0不显示，1显示，默认1',
  `del` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0不删除，1删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '确定时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='订单表 bs_orders';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_orders`
--

LOCK TABLES `bs_orders` WRITE;
/*!40000 ALTER TABLE `bs_orders` DISABLE KEYS */;
INSERT INTO `bs_orders` VALUES (2,'创意123456','201607031309426817',1,3,1,'jiuge',2,'jiuge2',12,'',1,0,20160703,20160703),(4,'ergth','201607071804515298',3,1,1,'jiuge',2,'jiuge2',5,'',1,0,20160707,1474005529);
/*!40000 ALTER TABLE `bs_orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_orders_firm`
--

DROP TABLE IF EXISTS `bs_orders_firm`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_orders_firm` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '售后订单名称',
  `orderid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '订单id',
  `genre` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '订单类型：1(创意，分镜，商品)，2(娱乐，演员，租赁)',
  `seller` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '供应方，用户id',
  `sellerName` varchar(255) NOT NULL COMMENT '供应方用户名称',
  `buyer` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '需求方，用户id',
  `buyerName` varchar(255) NOT NULL COMMENT '需求方名称',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '服务状态：1新申请，2拒绝，3同意，4开始办理，5完成办理，6确定完成，交易成功，交易失败',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '前台是否显示：0不显示，1显示',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0不删除，1删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='售后服务表 bs_orders_firm';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_orders_firm`
--

LOCK TABLES `bs_orders_firm` WRITE;
/*!40000 ALTER TABLE `bs_orders_firm` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_orders_firm` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_orders_pro`
--

DROP TABLE IF EXISTS `bs_orders_pro`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_orders_pro` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `productid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '在线创作产品id',
  `serial` varchar(20) NOT NULL DEFAULT '0' COMMENT '订单编号',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '类型：1有在线模板，2只有离线模板，3无模板',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '样片类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13节日聚会，14个人短片，',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `uname` varchar(50) NOT NULL COMMENT '用户名称，便于搜索',
  `seller` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '供应方id',
  `format` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '输出格式：',
  `record` varchar(3000) NOT NULL COMMENT '在线模板》更新的记录，序列化存储：\r\n动画设置的添加layerAdd、更新layerEdit；\r\n关键帧的添加layerAttrAdd、更新layerAttrEdit；\r\n内容得添加conAdd、更新conEdit；\r\n属性样式更新attrEdit；\r\n离线模板、无模板》视频的修改要求',
  `video_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '视频id',
  `is_new` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '视频是否最新：0没有，1最新，2非最新',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '订单状态：1待定价，待打款，款不对或过期，已付款处理中，已处理待评价，评价不好，好评并返利',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '2' COMMENT '前台列表是否显示：1不显示，2显示，默认2',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8 COMMENT='订单（在线创作订单）表 bs_orders_pro';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_orders_pro`
--

LOCK TABLES `bs_orders_pro` WRITE;
/*!40000 ALTER TABLE `bs_orders_pro` DISABLE KEYS */;
INSERT INTO `bs_orders_pro` VALUES (1,10,'201610051408034436',1,1,1,'jiuge',0,1,'',2,2,7,2,1475647683,1475805230),(7,10,'201610160928136080',2,1,1,'jiuge',1,1,'更换图片',0,0,2,2,1476581293,0),(10,14,'201610171742188306',3,1,1,'jiuge',1,1,'fbfgbnfgnhgfn',0,0,2,2,1476697338,0);
/*!40000 ALTER TABLE `bs_orders_pro` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pay`
--

DROP TABLE IF EXISTS `bs_pay`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pay` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '来自哪一张订单表：1orders，2orders_firm，3orders_pro，',
  `order_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '订单id',
  `uid` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '支付方',
  `money` float unsigned NOT NULL DEFAULT '0' COMMENT '支付金额，单位元',
  `weal` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '福利数量，单位元',
  `isfine` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否延时赔付，视频制作订单专用，赔付付款额的10%：0不延时，1延时罚款，2罚款已经到位',
  `ispay` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '付款是否到位：0未到支付宝或款不对，1支付宝已收款',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='订单支付表 bs_pay';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pay`
--

LOCK TABLES `bs_pay` WRITE;
/*!40000 ALTER TABLE `bs_pay` DISABLE KEYS */;
INSERT INTO `bs_pay` VALUES (1,1,4,1,100,0,0,1,1474005529,1474024833),(2,3,1,1,65,0,0,0,1475647683,0),(3,3,7,1,70,0,0,0,1476581293,0),(5,3,10,1,120,20,0,0,1476699760,0);
/*!40000 ALTER TABLE `bs_pay` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pics`
--

DROP TABLE IF EXISTS `bs_pics`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pics` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `name` varchar(255) NOT NULL COMMENT '图片名称',
  `urlSel` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '图片地址选择：1上传的，2外部的',
  `url` varchar(255) NOT NULL COMMENT '图片路径',
  `url2` varchar(255) NOT NULL COMMENT '外部地址',
  `width` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '图片宽度，单位px',
  `height` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '图片高度，单位px',
  `intro` varchar(255) NOT NULL COMMENT '图片介绍',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0不删除，1删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='图片管理表（暂用QQ空间相册）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pics`
--

LOCK TABLES `bs_pics` WRITE;
/*!40000 ALTER TABLE `bs_pics` DISABLE KEYS */;
INSERT INTO `bs_pics` VALUES (1,1,'图片111',1,'/uploads/images/2016/ppt.png','',1920,400,'ergdfbghrgtfh\r\n111111111111\r\n0000000000000',0,0,2016),(2,1,'图片2',1,'/uploads/images/2016/ppt2.png','',1920,400,'',0,20160529,20160529),(3,1,'图片3',1,'/uploads/images/2016/online1.png','',300,300,'',0,20160529,20160529),(4,1,'图片4',1,'http://i0.letvimg.com/lc09_yunzhuanma/201606/08/16/46/af5d92d3e90c0f86894c8a3a13eb600b_NTg1MDEzMDg=/thumb/2.jpg','',120,90,'',0,20160529,1473754267),(5,1,'图片5',1,'/assets/images/icon.png','',150,150,'',0,20160529,20160529);
/*!40000 ALTER TABLE `bs_pics` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pro_attr`
--

DROP TABLE IF EXISTS `bs_pro_attr`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pro_attr` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `productid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '产品表id，关联bs_products',
  `layerid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '动画设置id',
  `name` varchar(255) NOT NULL COMMENT '样式简称',
  `style_name` varchar(20) NOT NULL COMMENT '类样式名称，加个前缀好区分==》改为自动添加，用户ID+产品id+属性id',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '属性类型：1图层开始，pos图层定位，2dh动画层',
  `padding` varchar(15) NOT NULL COMMENT '内边距，单位px：\r\n类型，0无，1(上下左右)，2(上下、左右)，3(上、下、左、右)；\r\npadType，pad1，pad2，pad3，pad4，pad5，pad6，pad7，',
  `size` varchar(10) NOT NULL COMMENT '宽度，高度，单位px，空则没有，中间逗号隔开',
  `pos` varchar(255) NOT NULL COMMENT '定位方式，左边距离，顶部距离：\r\n定位方式，0没有，1relative相对定位；\r\n左边距离，空则没有，相对定位时有效，单位px；\r\n顶部距离，空则没有，相对定位时有效，单位px',
  `float` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '浮动对齐：0没有，1左对齐，2右对齐',
  `opacity` varchar(5) NOT NULL COMMENT '透明度，格式(判断,值)，中间逗号隔开：判断(0无，1有)，值(透明0-100透明)',
  `border` varchar(50) NOT NULL COMMENT '边框，格式(判断,距离,类型,色值)：判断有无边框(0无1有)，距离单位px，类型选择，色值填写',
  `record` varchar(255) NOT NULL COMMENT '修改过的属性记录，序列化存储，0未修改1已修改：padding，size，pos，float，opacity，border',
  `bg` varchar(20) NOT NULL COMMENT '背景，格式(类型,值)：类型纯色或图片，值色值或pic_id',
  `text` varchar(255) NOT NULL COMMENT '文字属性集合，逗号隔开：\r\ncolor给出几个选项，\r\nfont-size（数值，单位px），\r\ntext-align（left左、中center、右right方式），\r\nline-height（数字，单位px），',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8 COMMENT='在线创作div类样式属性表：在线写的属性';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pro_attr`
--

LOCK TABLES `bs_pro_attr` WRITE;
/*!40000 ALTER TABLE `bs_pro_attr` DISABLE KEYS */;
INSERT INTO `bs_pro_attr` VALUES (1,2,1,'样式11','attr_2_81',1,'','720,405','0,,',1,'0,0','0,,1,1','','','',1474722160,1474872749),(2,2,1,'样式11','attr_2_81',2,'','720,405','1,,405',0,'0,0','0,,1,1','','','',1474723783,1474871935),(3,2,1,'样式11','attr_2_81',3,'',',405','0,,',0,'0,0','0,,1,1','','','',1474808252,1474871954),(25,10,14,'样式11','attr_142555',1,'','720,405','0,,',1,'0,0','0,,1,1','','','',1475032379,0),(26,10,14,'样式11','attr_142555',2,'','720,405','1,,405',0,'0,0','0,,1,1','a:6:{s:4:\"size\";i:0;s:7:\"padding\";i:1;s:6:\"border\";i:1;s:3:\"pos\";i:1;s:5:\"float\";i:0;s:7:\"opacity\";i:1;}','','',1475032379,1475568104),(27,10,14,'样式11','attr_142555',3,'',',405','0,,',0,'0,0','0,,1,1','','','',1475032379,0);
/*!40000 ALTER TABLE `bs_pro_attr` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pro_con`
--

DROP TABLE IF EXISTS `bs_pro_con`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pro_con` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `productid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '产品id',
  `layerid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '动画设置id',
  `genre` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '发布者身份：1图片，2文字',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片，关联图片表bs_pics',
  `name` varchar(255) NOT NULL COMMENT '文字内容',
  `record` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '类型、图片、文字修改记录，0未修改1已修改',
  `is_add` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否也会添加的：0系统添加，1用户首次添加，2用户修改',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '是否显示：0不显示，1显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8 COMMENT='在线创作的图片文字表 bs_products_con';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pro_con`
--

LOCK TABLES `bs_pro_con` WRITE;
/*!40000 ALTER TABLE `bs_pro_con` DISABLE KEYS */;
INSERT INTO `bs_pro_con` VALUES (1,2,1,1,1,'12345',0,0,10,1,1474525576,1474808731),(23,10,14,1,1,'12345',0,0,10,1,1475032379,0);
/*!40000 ALTER TABLE `bs_pro_con` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pro_layer`
--

DROP TABLE IF EXISTS `bs_pro_layer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pro_layer` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '动画层名称',
  `productid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '产品id',
  `a_name` varchar(255) NOT NULL COMMENT '动画名称，系统自动添加，act_+用户id_+产品id_+动画id',
  `timelong` float(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '动画时长，单位秒(s)',
  `func` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '速度曲线：linear匀速，ease默认慢快慢，ease-in低速开始，ease-out低速结束，ease-in-out低速开始和结束，cubic-bezier(n,n,n,n)贝塞尔函数自定义',
  `delay` float(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '开始延时秒数，单位秒s',
  `record` varchar(100) NOT NULL COMMENT '修改的记录，序列化存储，0未修改1已修改：timelong，func，delay',
  `is_add` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否也会添加的：0系统添加，1用户首次添加，2用户修改',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8 COMMENT='在线创作动画层表：在线写的动画';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pro_layer`
--

LOCK TABLES `bs_pro_layer` WRITE;
/*!40000 ALTER TABLE `bs_pro_layer` DISABLE KEYS */;
INSERT INTO `bs_pro_layer` VALUES (1,'动画设置11',2,'layer_2_9930',2.00,1,0.00,'',0,1474714196,1474881677),(14,'动画设置22',10,'layer_2_9930',3.00,1,0.00,'a:3:{s:5:\"delay\";i:0;s:8:\"timelong\";i:0;s:4:\"func\";i:0;}',2,1475032379,1475560153);
/*!40000 ALTER TABLE `bs_pro_layer` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pro_layer_attr`
--

DROP TABLE IF EXISTS `bs_pro_layer_attr`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pro_layer_attr` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `productid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '产品id',
  `layerid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '动画id，关联动画表bs_products_layer',
  `attrSel` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '属性选择：1=》高度，宽度，左边距，顶边距，透明度',
  `per` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '动画点，单位%',
  `val` smallint(5) NOT NULL DEFAULT '0' COMMENT '属性值',
  `record` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '修改的记录，0未修改1已修改',
  `is_add` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '是否也会添加的：0系统添加，1用户首次添加，2用户修改',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8 COMMENT='在线创作动画层表：在线写的动画';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pro_layer_attr`
--

LOCK TABLES `bs_pro_layer_attr` WRITE;
/*!40000 ALTER TABLE `bs_pro_layer_attr` DISABLE KEYS */;
INSERT INTO `bs_pro_layer_attr` VALUES (1,2,1,4,0,405,0,0,1474720357,1474884651),(2,2,1,5,70,100,0,0,1474886792,1474941851),(3,2,1,4,20,0,0,0,1474940463,0),(4,2,1,3,70,0,0,0,1474940585,1474940990),(5,2,1,4,100,0,0,0,1474941119,0),(6,2,1,3,100,-200,0,0,1474941905,0),(7,2,1,5,100,0,0,0,1474942102,0),(43,10,14,4,0,405,0,0,1475032379,0),(44,10,14,5,70,100,0,0,1475032379,0),(45,10,14,4,20,0,0,0,1475032379,0),(46,10,14,3,70,0,1,0,1475032379,0),(47,10,14,4,100,0,0,0,1475032379,0),(48,10,14,3,100,-200,0,0,1475032379,0),(49,10,14,5,100,0,0,0,1475032379,0);
/*!40000 ALTER TABLE `bs_pro_layer_attr` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_pro_videos`
--

DROP TABLE IF EXISTS `bs_pro_videos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_pro_videos` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL COMMENT '视频名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '1动画定制，2效果定制',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '样片类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13节日聚会，14个人短片，',
  `intro` varchar(255) NOT NULL COMMENT '视频介绍',
  `gif` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '缩略图id',
  `video_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '视频id',
  `link` varchar(255) NOT NULL COMMENT '外部视频链接',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '提供者：需求用户，设计师，公司',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8 COMMENT='在线定制视频表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_pro_videos`
--

LOCK TABLES `bs_pro_videos` WRITE;
/*!40000 ALTER TABLE `bs_pro_videos` DISABLE KEYS */;
INSERT INTO `bs_pro_videos` VALUES (2,'产品333',1,1,'而沟通与法规和若干个',1,1,'',1,20160512,1474336724),(10,'产品333',1,1,'而沟通与法规和若干个',2,1,'',1,1475032379,0),(14,'外链000',2,1,'00000000000000',0,0,'http://www.yy.com/54880976/54880976?tempId=16777217',1,1476697338,1476758119);
/*!40000 ALTER TABLE `bs_pro_videos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_products`
--

DROP TABLE IF EXISTS `bs_products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_products` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '视频名称',
  `serial` varchar(20) NOT NULL COMMENT '编号，唯一标识：年月日时分秒+随机值',
  `genre` tinyint(3) unsigned NOT NULL DEFAULT '3' COMMENT '发布者身份：1个人供应，2企业供应，3平台供应',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '样片类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13个人短片，',
  `intro` varchar(1000) NOT NULL COMMENT '视频简介',
  `gif` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '缩略图，关联图片表bs_pics',
  `video_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '预览画面id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '提供者：需求用户，设计师，公司',
  `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '模板父id，0代表新模板',
  `isauth` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '审核：1未审核，2未通过审核，3通过审核',
  `istop` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '是否置顶：0不置顶，2置顶',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '2' COMMENT '前台列表是否显示：1不显示，2显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8 COMMENT='在线视频表：在线写的模板';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_products`
--

LOCK TABLES `bs_products` WRITE;
/*!40000 ALTER TABLE `bs_products` DISABLE KEYS */;
INSERT INTO `bs_products` VALUES (2,'产品333','201609221742345260',3,1,'而沟通与法规和若干个',1,1,2,0,3,0,10,2,20160512,1474336724),(10,'产品333','201609221742345260',3,1,'而沟通与法规和若干个',1,2,1,2,1,0,10,2,1475032379,0);
/*!40000 ALTER TABLE `bs_products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_rent_pic`
--

DROP TABLE IF EXISTS `bs_rent_pic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_rent_pic` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `rent_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '租赁id',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='租赁图片关联表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_rent_pic`
--

LOCK TABLES `bs_rent_pic` WRITE;
/*!40000 ALTER TABLE `bs_rent_pic` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_rent_pic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_rents`
--

DROP TABLE IF EXISTS `bs_rents`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_rents` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL COMMENT '设备名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '类型：1供应，2需求',
  `type` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '设备类型：1=>摄像机，摇臂，转接器，镜头，轨道车，脚轮，脚架，话筒，调音台，监视器，灯光，反光板，柔光板，采集卡，硬盘，',
  `thumb` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '缩略图id',
  `intro` varchar(500) NOT NULL COMMENT '设备介绍',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布者id',
  `area` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '地区id',
  `money` float unsigned NOT NULL DEFAULT '0' COMMENT '价格，单位元',
  `fromtime` int(20) unsigned NOT NULL DEFAULT '0' COMMENT '租赁开始时间',
  `totime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '租赁结束时间',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='租赁表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_rents`
--

LOCK TABLES `bs_rents` WRITE;
/*!40000 ALTER TABLE `bs_rents` DISABLE KEYS */;
INSERT INTO `bs_rents` VALUES (1,'租赁供应0323',1,1,0,'yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy',1,0,0,0,0,10,0,20160323,20160323);
/*!40000 ALTER TABLE `bs_rents` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_search`
--

DROP TABLE IF EXISTS `bs_search`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_search` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `keyword` varchar(2000) NOT NULL COMMENT '关键字',
  `genre` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '检索条件：样片，创意，分镜，设计师，企业，影视，演员，设备，设计，',
  `fromid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '来源表的id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COMMENT='用户搜索表 bs_search';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_search`
--

LOCK TABLES `bs_search` WRITE;
/*!40000 ALTER TABLE `bs_search` DISABLE KEYS */;
INSERT INTO `bs_search` VALUES (1,'产品1',1,1,1474250650,1474255699),(2,'产品333jiuge',1,2,1474250650,1474255699),(3,'创意1广告0元',3,1,1474250650,1474255699),(4,'创意部分的白癜风广告0元',3,2,1474250650,1474255699),(5,'创意123456广告10元',3,3,1474250650,1474255699),(6,'ergth广告3456元',4,1,1474250650,1474255699),(7,'分镜5254电影55元',4,2,1474250650,1474255699),(8,'这是广告公司普通企业江苏省杭州市滨江区滨盛路1870号',5,1,1474250650,1474255699),(9,'',5,2,1474250650,1474255699),(10,'作品26256电视剧',6,1,1474250650,1474255699),(11,'拿斧头男能否规范个人方法小学及以下他人观花',7,1,1474250650,1474255699),(12,'如果它不符合乳房的不过而发表格式的风格小学及以下而对方不改变',7,2,1474250650,1474255699),(13,'租赁供应03230元',8,1,1474250650,1474255699),(14,'嘎嘎嘎房产漫游55元',9,1,1474250650,1474255699),(15,'设计001房产漫游11元',9,2,1474250650,1474255699),(16,'个人需求001jiuge宣传片0元',2,1,1474255699,0);
/*!40000 ALTER TABLE `bs_search` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_search_keyword`
--

DROP TABLE IF EXISTS `bs_search_keyword`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_search_keyword` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `search_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '搜索id',
  `keyword` varchar(20) NOT NULL COMMENT '关键字',
  `rate` int(10) unsigned NOT NULL DEFAULT '1' COMMENT '搜索频率',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='用户搜索表 bs_search';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_search_keyword`
--

LOCK TABLES `bs_search_keyword` WRITE;
/*!40000 ALTER TABLE `bs_search_keyword` DISABLE KEYS */;
INSERT INTO `bs_search_keyword` VALUES (1,16,'需求',17,1474256475,1474272406);
/*!40000 ALTER TABLE `bs_search_keyword` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_staff_pic`
--

DROP TABLE IF EXISTS `bs_staff_pic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_staff_pic` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `staff_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '演员id',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='员工图片关联表 bs_staff_pic';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_staff_pic`
--

LOCK TABLES `bs_staff_pic` WRITE;
/*!40000 ALTER TABLE `bs_staff_pic` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_staff_pic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_staff_works`
--

DROP TABLE IF EXISTS `bs_staff_works`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_staff_works` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `staff_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '演员id，关联 bs_works',
  `works_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '作品id，关联 bs_works',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='员工和影视作品关联表 ba_staff_work';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_staff_works`
--

LOCK TABLES `bs_staff_works` WRITE;
/*!40000 ALTER TABLE `bs_staff_works` DISABLE KEYS */;
INSERT INTO `bs_staff_works` VALUES (1,1,1,20160614,0),(2,2,1,20160614,0);
/*!40000 ALTER TABLE `bs_staff_works` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_staffs`
--

DROP TABLE IF EXISTS `bs_staffs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_staffs` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '人员名称',
  `entertain_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '娱乐id，关联娱乐表bs_entertains',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布人',
  `genre` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '职位类型：1=>演员，导演，摄影师，灯光师，化妆师，21=>剪辑师，特效师，合成师，配音，背景音',
  `thumb` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '缩略图id',
  `sex` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '性别：1男，2女',
  `realname` varchar(255) NOT NULL COMMENT '真实名字',
  `origin` varchar(255) NOT NULL COMMENT '籍贯',
  `education` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '学历',
  `school` varchar(255) NOT NULL COMMENT '毕业学校',
  `hobby` varchar(255) NOT NULL COMMENT '爱好',
  `area` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '所在地',
  `height` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '身高，单位cm',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序，值越大越靠前，默认10',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '前台显示否：0不显示，1显示',
  `del` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0不删除，1删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='娱乐公司员工表 bs_staffs ：主要是供应信息';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_staffs`
--

LOCK TABLES `bs_staffs` WRITE;
/*!40000 ALTER TABLE `bs_staffs` DISABLE KEYS */;
INSERT INTO `bs_staffs` VALUES (1,'拿斧头男',1,1,1,1,1,'能否规范','个人方法',1,'他人观花','',0,172,10,1,0,20160423,0),(2,'如果它不符合',1,1,1,1,1,'乳房的不过','而发表格式的风格',1,'而对方不改变','1,2,3',0,150,10,1,0,20160613,20160613);
/*!40000 ALTER TABLE `bs_staffs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_storyboards`
--

DROP TABLE IF EXISTS `bs_storyboards`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_storyboards` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '名称',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '供求类型：1供应，2需求',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '分镜类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13节日聚会，14个人短片，',
  `thumb` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '分镜缩略图，关联 bs_storyboards_pic',
  `intro` varchar(255) NOT NULL COMMENT '简单介绍',
  `detail` varchar(2000) NOT NULL COMMENT '分镜细节',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布的用户id',
  `uname` varchar(50) NOT NULL COMMENT '用户名称',
  `money` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '价格，单位元',
  `isnew` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '是否是最新的：0不是最新，1最新',
  `ishot` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否最热的：0不是最热，1最热',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序，值越大越靠前，默认10',
  `sort2` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '用户控制排序，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '前台列表是否显示：0前台列表不显示，1前台列表显示',
  `isshow2` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '用户控制前台列表是否显示：0前台列表不显示，1前台列表显示',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='分镜表 bs_storyboards';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_storyboards`
--

LOCK TABLES `bs_storyboards` WRITE;
/*!40000 ALTER TABLE `bs_storyboards` DISABLE KEYS */;
INSERT INTO `bs_storyboards` VALUES (1,'ergth',1,4,1,'','<p><img src=\"/uploads/ueditor/php/upload/image/20160523/1463995780428079.png\" title=\"1463995780428079.png\" alt=\"QQ截图20150906082002.png\"/>ergtghefrgtfgefrdfgh</p>',1,'',3456,0,0,10,10,1,1,0,20160523,20160523),(2,'分镜5254',2,2,1,'如果对方改变人股份','<p>玩儿个地方不热的国防部</p>',0,'',55,0,0,10,10,1,1,0,1471071989,1471072851);
/*!40000 ALTER TABLE `bs_storyboards` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_storyboards_like`
--

DROP TABLE IF EXISTS `bs_storyboards_like`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_storyboards_like` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `sbid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '分镜storyboard的id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='分镜喜欢表 bs_storyboards_like';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_storyboards_like`
--

LOCK TABLES `bs_storyboards_like` WRITE;
/*!40000 ALTER TABLE `bs_storyboards_like` DISABLE KEYS */;
INSERT INTO `bs_storyboards_like` VALUES (1,0,1,20160523);
/*!40000 ALTER TABLE `bs_storyboards_like` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks`
--

DROP TABLE IF EXISTS `bs_talks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '名称',
  `themeid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题主题id',
  `content` text NOT NULL COMMENT '创意内容',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '发布的用户id',
  `uname` varchar(50) NOT NULL COMMENT '用户名称',
  `pid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '上级id',
  `read` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '浏览次数',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '前台是否显示：0前台列表不显示，1前台列表显示',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0不放入回收站，1放入回收站',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='话题表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks`
--

LOCK TABLES `bs_talks` WRITE;
/*!40000 ALTER TABLE `bs_talks` DISABLE KEYS */;
INSERT INTO `bs_talks` VALUES (1,'话题1',0,'<p>而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表而非v代表</p>',1,'',0,0,10,1,0,20160417,20160417),(2,'话题2 222222222222',0,'<p>不服该办法呢GV热豆腐还不太高和今年投入富家女我我的是女附近的八个人工我可v别沮丧的v比对方不能交电费表肯定是你鄙视吧v那地方就不能hiu二个IE人根据IE如何隔日给举动被GV的人覅偶包过户的人发货不固定不v个is独具不</p><p>55555555555555555555555555555</p>',1,'',0,0,10,1,0,20160419,20160422),(3,'话题3333333',0,'<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;这里可以排版文字，插入或粘贴图片\r\n &nbsp; &nbsp;&nbsp;</p><p>5151516515615165156165561562626516516515 &nbsp; &nbsp; &nbsp;&nbsp;</p>',1,'',0,0,10,1,0,20160422,20160422);
/*!40000 ALTER TABLE `bs_talks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks_click`
--

DROP TABLE IF EXISTS `bs_talks_click`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks_click` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talkid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='话题点赞表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks_click`
--

LOCK TABLES `bs_talks_click` WRITE;
/*!40000 ALTER TABLE `bs_talks_click` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_talks_click` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks_collect`
--

DROP TABLE IF EXISTS `bs_talks_collect`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks_collect` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talkid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='话题收藏表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks_collect`
--

LOCK TABLES `bs_talks_collect` WRITE;
/*!40000 ALTER TABLE `bs_talks_collect` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_talks_collect` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks_follow`
--

DROP TABLE IF EXISTS `bs_talks_follow`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks_follow` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talkid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='话题关注表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks_follow`
--

LOCK TABLES `bs_talks_follow` WRITE;
/*!40000 ALTER TABLE `bs_talks_follow` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_talks_follow` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks_report`
--

DROP TABLE IF EXISTS `bs_talks_report`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks_report` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talkid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='话题举报表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks_report`
--

LOCK TABLES `bs_talks_report` WRITE;
/*!40000 ALTER TABLE `bs_talks_report` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_talks_report` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks_share`
--

DROP TABLE IF EXISTS `bs_talks_share`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks_share` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talkid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户的id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='话题分享表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks_share`
--

LOCK TABLES `bs_talks_share` WRITE;
/*!40000 ALTER TABLE `bs_talks_share` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_talks_share` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_talks_thank`
--

DROP TABLE IF EXISTS `bs_talks_thank`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_talks_thank` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `talkid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '话题id',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录用户id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='话题感谢表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_talks_thank`
--

LOCK TABLES `bs_talks_thank` WRITE;
/*!40000 ALTER TABLE `bs_talks_thank` DISABLE KEYS */;
/*!40000 ALTER TABLE `bs_talks_thank` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_theme`
--

DROP TABLE IF EXISTS `bs_theme`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_theme` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '主题名称',
  `intro` varchar(255) NOT NULL COMMENT '内容说明',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id，0代表默认专栏',
  `uname` varchar(50) NOT NULL COMMENT '用户名称',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '前台是否显示：0不显示，1显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='话题主题表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_theme`
--

LOCK TABLES `bs_theme` WRITE;
/*!40000 ALTER TABLE `bs_theme` DISABLE KEYS */;
INSERT INTO `bs_theme` VALUES (1,'视频制作','<p>视频视频视频视频视频视频视频上视频拍摄拍视频视频视频视频视频上刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏是视频视频视频视频说啪啪啪啪啪啪啪啪啪刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏刷屏视频视频视频视频上视频拍摄拍视频视频视频视频视频上</p>',0,'',10,1,1470905599,1470972044),(2,'屏幕','<p>无法对被告人不服管</p>',0,'',10,1,1470972254,0);
/*!40000 ALTER TABLE `bs_theme` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_user_frield待处理`
--

DROP TABLE IF EXISTS `bs_user_frield待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_user_frield待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `frield_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '好友id',
  `isauth` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '好友验证：1申请好友，2拒绝好友，3同意好友',
  `remarks` varchar(255) NOT NULL COMMENT '申请备注',
  `remarks2` varchar(255) NOT NULL COMMENT '拒绝理由',
  `del` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0不删除，1删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='用户好友表 bs_users_frield';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_user_frield待处理`
--

LOCK TABLES `bs_user_frield待处理` WRITE;
/*!40000 ALTER TABLE `bs_user_frield待处理` DISABLE KEYS */;
INSERT INTO `bs_user_frield待处理` VALUES (1,1,2,1,'','',0,1470795559,1471420755),(2,2,1,1,'','',0,1470795559,0);
/*!40000 ALTER TABLE `bs_user_frield待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_user_gold待处理`
--

DROP TABLE IF EXISTS `bs_user_gold待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_user_gold待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `genre` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '金币奖励：\r\n1建议发布奖励，2建议评价奖励，3用户心声奖励，4订单奖励，',
  `gold` tinyint(2) unsigned NOT NULL DEFAULT '0' COMMENT '金币奖励个数，单位个：\r\n意见发布随机1-5个；\r\n意见评价随机10-15个；\r\n心声随机1-5个 ；\r\n订单奖励5个；',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='用户签到表 bs_user_sign';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_user_gold待处理`
--

LOCK TABLES `bs_user_gold待处理` WRITE;
/*!40000 ALTER TABLE `bs_user_gold待处理` DISABLE KEYS */;
INSERT INTO `bs_user_gold待处理` VALUES (1,1,3,0,1472121253,0),(2,1,2,0,1472173411,0),(3,1,1,2,1476440299,0),(4,1,2,15,1476440384,0),(5,1,3,1,1476440608,0),(6,1,4,5,1476691680,0);
/*!40000 ALTER TABLE `bs_user_gold待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_user_sign待处理`
--

DROP TABLE IF EXISTS `bs_user_sign待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_user_sign待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `reward` tinyint(2) unsigned NOT NULL DEFAULT '0' COMMENT '签到奖励，1--10随机',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='用户签到表 bs_user_sign';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_user_sign待处理`
--

LOCK TABLES `bs_user_sign待处理` WRITE;
/*!40000 ALTER TABLE `bs_user_sign待处理` DISABLE KEYS */;
INSERT INTO `bs_user_sign待处理` VALUES (1,1,3,1472121253,0),(2,1,2,1472173411,0);
/*!40000 ALTER TABLE `bs_user_sign待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_user_tip`
--

DROP TABLE IF EXISTS `bs_user_tip`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_user_tip` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `type` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '红包类型：1新人红包',
  `tip` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '额度，单位元',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='用户红包表 bs_user_tip';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_user_tip`
--

LOCK TABLES `bs_user_tip` WRITE;
/*!40000 ALTER TABLE `bs_user_tip` DISABLE KEYS */;
INSERT INTO `bs_user_tip` VALUES (1,1,1,200,1476175074,1476178328);
/*!40000 ALTER TABLE `bs_user_tip` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_user_voice`
--

DROP TABLE IF EXISTS `bs_user_voice`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_user_voice` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL COMMENT '心声标题',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `work` varchar(20) NOT NULL COMMENT '所在职位',
  `intro` varchar(500) NOT NULL COMMENT '心声内容',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '2' COMMENT '在前台页面是否显示：0所有，1不显示，2前台列表显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='用户心声表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_user_voice`
--

LOCK TABLES `bs_user_voice` WRITE;
/*!40000 ALTER TABLE `bs_user_voice` DISABLE KEYS */;
INSERT INTO `bs_user_voice` VALUES (1,'1111',1,'111','11111111',10,2,1476103976,0),(2,'nghnfgnhfgjmfg',1,'hnfgngfn','hngfnfgnfgtjndfmnn',10,2,1476440415,0),(3,'gnmgfnfgng',1,'fgmngm','ghmghmghm',10,2,1476440608,0);
/*!40000 ALTER TABLE `bs_user_voice` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_video_money待处理`
--

DROP TABLE IF EXISTS `bs_video_money待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_video_money待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `clip` varchar(255) NOT NULL DEFAULT '0' COMMENT '剪辑价位，影视广告每5秒，其他的每5分钟',
  `effect` varchar(255) NOT NULL DEFAULT '0' COMMENT '合成价位，影视广告每5秒，其他的每分钟',
  `model` varchar(255) NOT NULL COMMENT '三维',
  `scene` varchar(255) NOT NULL COMMENT '每个价位',
  `texture` varchar(255) NOT NULL COMMENT '材质',
  `animate` varchar(255) NOT NULL COMMENT '三维动画，影视广告每10秒，其他每分钟',
  `liquid` varchar(255) NOT NULL COMMENT '软体液体，每10秒价位',
  `sound` varchar(255) NOT NULL COMMENT '声音，bg背景音(400/30秒)，dub配音(参考价1000)',
  `render` varchar(255) NOT NULL COMMENT '渲染，预览压标，成片无标，640(80/次)，720(100/次)，成片(200/次)',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='视频制作价位表 bs_video_money';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_video_money待处理`
--

LOCK TABLES `bs_video_money待处理` WRITE;
/*!40000 ALTER TABLE `bs_video_money待处理` DISABLE KEYS */;
INSERT INTO `bs_video_money待处理` VALUES (1,4,'0','100','0','0','0','0','0','0','',1474005529,1474024833),(2,1,'0','65','0','0','0','0','0','0','',1475647683,0),(3,7,'0','70','0','0','0','0','0','0','',1476581293,0),(5,10,'0','120','0','0','0','0','0','0','',1476699760,0);
/*!40000 ALTER TABLE `bs_video_money待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_videos`
--

DROP TABLE IF EXISTS `bs_videos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_videos` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id，0代表系统添加',
  `name` varchar(255) NOT NULL COMMENT '视频名称',
  `urlSel` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '视频上传的链接平台：1乐视，2腾讯，3优酷',
  `url` varchar(255) NOT NULL COMMENT '视频链接',
  `url2` varchar(255) NOT NULL COMMENT '地址上的一些参数',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '截图链接id',
  `width` smallint(4) unsigned NOT NULL DEFAULT '640' COMMENT '视频宽度，单位px，默认640',
  `height` smallint(4) unsigned NOT NULL DEFAULT '480' COMMENT '视频高度，单位px，默认480',
  `intro` varchar(500) NOT NULL COMMENT '图片介绍',
  `del` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '回收站功能：0未删除，1已删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='视频表（先将视频链接到优酷或者乐视云）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_videos`
--

LOCK TABLES `bs_videos` WRITE;
/*!40000 ALTER TABLE `bs_videos` DISABLE KEYS */;
INSERT INTO `bs_videos` VALUES (1,1,'视频001',1,'http://yuntv.letv.com/bcloud.swf','uu=1ew2bpfrka&vu=9c87e2e08b&pu=5fc8cd11e6&gpcflag=1',4,640,480,'1111111111111',0,20160611,1475752507),(2,1,'产品333',1,'http://yuntv.letv.com/bcloud.swf','uu=1ew2bpfrka&vu=463cbef6bc&pu=5fc8cd11e6&auto_play=1&gpcflag=1&lang=zh_CN',3,640,480,'',0,1475805230,0);
/*!40000 ALTER TABLE `bs_videos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_visitlog`
--

DROP TABLE IF EXISTS `bs_visitlog`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_visitlog` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `cid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '企业网站企业id',
  `cname` varchar(100) NOT NULL COMMENT '企业名称',
  `visit_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '访问者uid',
  `uname` varchar(100) NOT NULL COMMENT '用户名称',
  `action` varchar(100) NOT NULL,
  `ip` varchar(15) NOT NULL COMMENT '用户端ip',
  `ipaddress` varchar(100) NOT NULL COMMENT '访问用户ip所在城市',
  `serial` varchar(20) NOT NULL COMMENT '序号，唯一标识',
  `dayCount` int(10) unsigned NOT NULL DEFAULT '1' COMMENT '当天访问次数',
  `timeCount` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '当天访问总时长，单位s',
  `loginTime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '第一次登陆时间',
  `logoutTime` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '最后退出时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COMMENT='用户访问公司页面的日志表 bs_visitlog（bs_user_company_visit_log）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_visitlog`
--

LOCK TABLES `bs_visitlog` WRITE;
/*!40000 ALTER TABLE `bs_visitlog` DISABLE KEYS */;
INSERT INTO `bs_visitlog` VALUES (1,1,'这是广告公司',0,'	游客','/c/1','192.168.2.100','浙江省 杭州市 滨江区','201609091654354360',1,0,1473411275,1473421673),(2,1,'这是广告公司',0,'	游客','/c/1','192.168.2.100','浙江省 杭州市 滨江区','201609091657167135',1,0,1473411436,1473421673),(3,1,'这是广告公司',0,'	游客','/c/1','192.168.2.100','浙江省 杭州市 滨江区','201609091704382313',1,0,1473411878,1473421673),(4,1,'这是广告公司',0,'	游客','/c/1/product','192.168.2.100','浙江省 杭州市 滨江区','201609091811281741',2,0,1473415888,1473421938),(5,1,'这是广告公司',0,'	游客','/c/1/part','192.168.2.100','浙江省 杭州市 滨江区','201609091828036412',1,0,1473416883,1473421257),(6,1,'这是广告公司',0,'	游客','/c/1/firm','192.168.2.100','浙江省 杭州市 滨江区','201609091941128083',1,0,1473421272,1473421643),(7,1,'这是广告公司',0,'	游客','/c/1/about','192.168.2.100','浙江省 杭州市 滨江区','20160909195506769',1,0,1473422106,1473422106),(8,1,'这是广告公司',0,'	游客','/c/1/recruit','192.168.2.100','浙江省 杭州市 滨江区','201609091955137876',1,5,1473422113,1473422519),(9,1,'这是广告公司',0,'	游客','/c/1/contact','192.168.2.100','浙江省 杭州市 滨江区','201609091955217864',1,705,1473422121,1473423617),(10,1,'这是广告公司',1,'jiuge','/c/1','192.168.2.100','浙江省 杭州市 滨江区','201609101833306148',3,3020,1473503610,1473571791),(11,1,'这是广告公司',1,'jiuge','/c/1','192.168.2.100','浙江省 杭州市 滨江区','201609110915338538',2,655,1473556533,1473571791),(12,1,'这是广告公司',1,'jiuge','/c/1/about','192.168.2.100','浙江省 杭州市 滨江区','201609111809022085',1,395,1473588542,1473589037),(13,1,'这是广告公司',1,'jiuge','/c/1','192.168.2.100','浙江省 杭州市 滨江区','201609131539132984',1,0,1473752353,1473752353),(14,1,'这是广告公司',1,'jiuge','/c/1/contact','192.168.2.100','浙江省 杭州市 滨江区','201609131539176170',1,40,1473752357,1473752405),(15,1,'',1,'','/c/home','192.168.2.100','浙江省 杭州市 滨江区','201611240923222326',1,160,1479950602,1479951870),(16,1,'',1,'','/c/1/product','192.168.2.100','浙江省 杭州市 滨江区','201611240923596782',1,465,1479950639,1479951573);
/*!40000 ALTER TABLE `bs_visitlog` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_wallet`
--

DROP TABLE IF EXISTS `bs_wallet`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_wallet` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `sign` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '签到总数',
  `gold` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '金币总数，单位个：\r\n用户建议随机奖励1-5；\r\n成功的建议随机奖励10-20；',
  `tip` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '红包总数，单位元',
  `weal` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '福利，单位元：\r\n30签到兑换1元；\r\n10金币兑换1元；',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='用户钱袋(福利)表 bs_user_wallet';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_wallet`
--

LOCK TABLES `bs_wallet` WRITE;
/*!40000 ALTER TABLE `bs_wallet` DISABLE KEYS */;
INSERT INTO `bs_wallet` VALUES (1,1,5,25,200,0,1476063026,1476244316),(2,24,0,0,0,0,1480747905,0);
/*!40000 ALTER TABLE `bs_wallet` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bs_works`
--

DROP TABLE IF EXISTS `bs_works`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bs_works` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '作品名称',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `cid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '娱乐公司id',
  `cate` tinyint(2) unsigned NOT NULL DEFAULT '0' COMMENT '影片类型：1电视剧，2电影，3微电影，4广告，5宣传片，6专题片，7汇报片，8主题片，9纪录片，10晚会，11淘宝视频，12婚纱摄影，13节日聚会，14个人短片，',
  `intro` varchar(255) NOT NULL COMMENT '简介',
  `detail` varchar(1000) NOT NULL COMMENT '详情',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片id，关联bs_pics',
  `video_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '视频链接id，链接视频表bs_videos',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序，值越大越靠前，默认10',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '前台显示否：0不显示，1显示',
  `del` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '回收站：0不删除，1删除',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='影视作品表 works';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bs_works`
--

LOCK TABLES `bs_works` WRITE;
/*!40000 ALTER TABLE `bs_works` DISABLE KEYS */;
INSERT INTO `bs_works` VALUES (1,'作品26256',1,1,1,'gggggggggggggggggggggggggggggggggggggggggggg','<p>efdbgesfsdf</p>',0,0,15,1,0,20160614,0);
/*!40000 ALTER TABLE `bs_works` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `com_funcs`
--

DROP TABLE IF EXISTS `com_funcs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `com_funcs` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '功能名称',
  `cid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '公司id',
  `module_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '所属模块id：1公司信息，2服务，3团队，4招聘，5合作伙伴',
  `type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '功能类型：1简介，2历程，3新闻，4资讯，5服务，6团队，7招聘，8合作伙伴，',
  `pic_id` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '图片id',
  `intro` varchar(2000) NOT NULL COMMENT '详情',
  `small` varchar(255) NOT NULL COMMENT '备用字段：\r\n如果是服务，为小字，多组用|隔开；\r\n如果是招聘，为数字；\r\n如果是合作伙伴，为链接；',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '用户企业排序，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '用户的公司后台控制是否显示：0不显示，1显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='企业功能表 com_funcs';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `com_funcs`
--

LOCK TABLES `com_funcs` WRITE;
/*!40000 ALTER TABLE `com_funcs` DISABLE KEYS */;
INSERT INTO `com_funcs` VALUES (1,'公司简介',1,1,1,1,'<p>公司简单介绍</p>','',10,1,1472474573,1473663705),(2,'公司历程',1,1,2,0,'<p>公司历史</p>','',10,1,1472474631,0),(3,'公司新闻',1,1,3,2,'<p>新闻新闻</p>','',10,1,1472474666,0),(4,'行业资讯',1,1,4,2,'<p>资讯资讯</p>','',10,1,1472474698,1473733267),(5,'服务项目',1,2,5,0,'<p>服务项目服务项目00000000000</p>','小字|小字|小字|小字|',10,1,1472474749,1473733351),(6,'团队',1,3,6,2,'<p>团队成员团队成员</p>','',10,1,1472474821,1473733330),(7,'招聘',1,4,7,0,'<p>招聘人才招聘人才000000000</p>','2',10,1,1472474999,1473733339);
/*!40000 ALTER TABLE `com_funcs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `com_main`
--

DROP TABLE IF EXISTS `com_main`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `com_main` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '公司所在用户id',
  `cid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '公司id',
  `name` varchar(100) NOT NULL COMMENT '公司名称',
  `title` varchar(100) NOT NULL COMMENT '鼠标移动显示',
  `keyword` varchar(255) NOT NULL COMMENT '关键字',
  `description` varchar(255) NOT NULL COMMENT '描述',
  `logo` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '公司logo',
  `layoutHome` varchar(2000) NOT NULL COMMENT '公司页面布局开关，0关闭，1开启：serviceSwitch服务开关，newsSwitch新闻开关，productSwitch产品开关，parternerSwitch合作伙伴，introSwitch公司简介，partSwitch花絮开关，teamSwitch团队开关，recruitSwitch招聘开关，contactSwicth类型开关，footLinkSwitch底部链接，',
  `skin` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '公司页面皮肤颜色值选择',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `istop` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否置顶：0不置定，1置顶',
  `isshow` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '系统后台控制是否显示：0不显示，1显示',
  `visitRate` tinyint(3) unsigned NOT NULL DEFAULT '20' COMMENT '用户对公司页面访问刷新频率，单位秒，值越大频率越小',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='企业信息主表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `com_main`
--

LOCK TABLES `com_main` WRITE;
/*!40000 ALTER TABLE `com_main` DISABLE KEYS */;
INSERT INTO `com_main` VALUES (1,0,0,'某某公司','某某公司','某某关键字','某某描述',5,'',1,10,0,1,5,20160427,20160427),(2,1,1,'这是广告公司','某某公司','某某关键字','某某描述\r\n4444444',2,'a:11:{s:13:\"serviceSwitch\";a:3:{s:3:\"key\";i:1;s:4:\"name\";s:12:\"服务开关\";s:5:\"value\";s:1:\"1\";}s:10:\"newsSwitch\";a:3:{s:3:\"key\";i:2;s:4:\"name\";s:12:\"新闻开关\";s:5:\"value\";i:1;}s:13:\"productSwitch\";a:3:{s:3:\"key\";i:3;s:4:\"name\";s:12:\"产品开关\";s:5:\"value\";i:1;}s:15:\"parternerSwitch\";a:3:{s:3:\"key\";i:4;s:4:\"name\";s:12:\"合作伙伴\";s:5:\"value\";i:1;}s:11:\"introSwitch\";a:3:{s:3:\"key\";i:5;s:4:\"name\";s:12:\"公司简介\";s:5:\"value\";i:1;}s:10:\"partSwitch\";a:3:{s:3:\"key\";i:6;s:4:\"name\";s:12:\"花絮开关\";s:5:\"value\";i:1;}s:10:\"teamSwitch\";a:3:{s:3:\"key\";i:7;s:4:\"name\";s:12:\"团队开关\";s:5:\"value\";i:1;}s:13:\"recruitSwitch\";a:3:{s:3:\"key\";i:8;s:4:\"name\";s:12:\"招聘开关\";s:5:\"value\";i:1;}s:13:\"contactSwicth\";a:3:{s:3:\"key\";i:9;s:4:\"name\";s:12:\"联系开关\";s:5:\"value\";i:1;}s:9:\"pptSwitch\";a:3:{s:3:\"key\";i:10;s:4:\"name\";s:12:\"宣传开关\";s:5:\"value\";i:1;}s:14:\"footLinkSwitch\";a:3:{s:3:\"key\";i:11;s:4:\"name\";s:12:\"底部链接\";s:5:\"value\";i:1;}}',8,10,0,1,5,20160506,20160506);
/*!40000 ALTER TABLE `com_main` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `com_modules`
--

DROP TABLE IF EXISTS `com_modules`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `com_modules` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL COMMENT '模块名称',
  `cid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '公司id',
  `genre` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '功能类型：1公司信息，2服务，3团队，4招聘，',
  `intro` varchar(2000) NOT NULL COMMENT '介绍',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '用户企业排序，值越大越靠前，默认10',
  `isshow` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '用户的公司后台控制是否显示：0不显示，1显示',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COMMENT='企业模块表 com_modules';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `com_modules`
--

LOCK TABLES `com_modules` WRITE;
/*!40000 ALTER TABLE `com_modules` DISABLE KEYS */;
INSERT INTO `com_modules` VALUES (1,'公司信息',0,1,'<p>公司简介、公司历史、公司新闻、行业资讯</p>',10,1,1472473358,0),(2,'服务',0,2,'<p>公司的服务项目</p>',10,1,1472473462,0),(3,'团队',0,3,'<p>公司成员</p>',10,1,1472473539,0),(4,'招聘',0,4,'<p>公司所需人员</p>',10,1,1472473584,0),(5,'合作伙伴',0,5,'<p>合作方名称、介绍、链接、形象图</p>',10,1,1472473618,0),(6,'备用单页',0,6,'<p>公司自定义添加的单页</p>',10,0,1472473699,0);
/*!40000 ALTER TABLE `com_modules` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `companys待处理`
--

DROP TABLE IF EXISTS `companys待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `companys待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '公司名称',
  `genre` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '公司的类型，对应users表的isuser：3普通企业，5广告公司，6影视公司，7租赁公司',
  `area` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '所在地ID',
  `point` varchar(50) NOT NULL COMMENT '地图坐标，格式 (x,y)',
  `address` varchar(255) NOT NULL COMMENT '详细地址',
  `yyzzid` varchar(255) NOT NULL COMMENT '营业执照注册码',
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '会员id',
  `areacode` varchar(4) NOT NULL DEFAULT '0' COMMENT '区号',
  `tel` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '座机',
  `qq` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '企业QQ',
  `web` varchar(255) NOT NULL COMMENT '公司官网',
  `fax` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '传真',
  `zipcode` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '邮编',
  `email` varchar(255) NOT NULL COMMENT '企业邮箱',
  `sort` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '排序字段，值越大越靠前，默认10',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='企业表 bs_companys';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `companys待处理`
--

LOCK TABLES `companys待处理` WRITE;
/*!40000 ALTER TABLE `companys待处理` DISABLE KEYS */;
INSERT INTO `companys待处理` VALUES (1,'这是广告公司',2,10,'120.157806,30.187043','杭州市滨江区滨盛路1870号','0123456789012345',1,'0571',88888888,100000,'www.jiuge.com',12345678,311301,'123@456.com',10,20160428,1473725269),(2,'',0,0,'','','',1,'0',0,0,'',0,0,'',10,1470735629,0);
/*!40000 ALTER TABLE `companys待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `persons待处理`
--

DROP TABLE IF EXISTS `persons待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `persons待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '会员id',
  `realname` varchar(255) NOT NULL COMMENT '真实名称',
  `sex` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '性别：1男，2女',
  `idcard` char(18) NOT NULL COMMENT '身份证号码，18位',
  `idfront` varchar(255) NOT NULL COMMENT '身份证正面照',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='个人表 bs_persons';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `persons待处理`
--

LOCK TABLES `persons待处理` WRITE;
/*!40000 ALTER TABLE `persons待处理` DISABLE KEYS */;
INSERT INTO `persons待处理` VALUES (1,1,'jiuge',1,'123456789012345678','',20160410,0),(2,1,'jiuge',1,'123456789012345678','',20160410,0),(3,1,'九哥',1,'123456789012345678','',20160410,0),(4,1,'九哥',1,'123456789012345678','',20160410,0);
/*!40000 ALTER TABLE `persons待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users待处理`
--

DROP TABLE IF EXISTS `users待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL COMMENT '用户名称',
  `password` varchar(255) NOT NULL COMMENT '登陆密码，hash加密',
  `pwd` varchar(20) NOT NULL COMMENT '原密码',
  `ip` varchar(15) NOT NULL COMMENT '用户注册的电脑ip地址',
  `email` varchar(255) NOT NULL COMMENT '邮箱',
  `qq` varchar(255) NOT NULL COMMENT 'qq号码',
  `tel` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '电话',
  `mobile` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '手机号码',
  `area` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户所在地区id',
  `address` varchar(255) NOT NULL COMMENT '用户所在具体地址',
  `head` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '头像图片id，关联表bs_pics',
  `zfb` varchar(100) NOT NULL COMMENT '支付宝账号',
  `isauth` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '用户认证：1未认证1 ，2认证失败，2认证成功',
  `emailck` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '邮箱认证：0未认证，1认证失败，2认证成功',
  `isuser` int(10) unsigned NOT NULL DEFAULT '1' COMMENT '会员身份：1普通用户，2个人会员，3普通企业，4设计师，5广告公司，6影视公司，7租赁公司，50超级用户',
  `isvip` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '是否vip：0非VIP，1是VIP',
  `limit` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '列表每页记录数，默认10条',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  `lastLogin` int(10) unsigned DEFAULT '0' COMMENT '上次登录时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='用户表 bs_users';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users待处理`
--

LOCK TABLES `users待处理` WRITE;
/*!40000 ALTER TABLE `users待处理` DISABLE KEYS */;
INSERT INTO `users待处理` VALUES (1,'jiuge','$2y$10$b8.ce.ma17MKiuN8iiJMO.QM5fdJ1Zwl7rpMNahjPGfNOKGoC/Kyy','123456','','jiuge@qq.com','946493655',63929131,4294967295,20,'滨江区 浦沿街道 联庄一区 几号 几楼',2,'946493655@qq.com',3,1,50,0,10,1470795559,1471420755,1479950584),(2,'jiuge2','$2y$10$X5BdoH0p0n.E3hxCVag/neinTfiHXbMrCHUEEqf8ZpUQGaeOxUUBe','','','946493655@qq.com','',0,0,30,'',0,'',3,0,50,0,10,1470795559,0,1478499066);
/*!40000 ALTER TABLE `users待处理` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_params待处理`
--

DROP TABLE IF EXISTS `users_params待处理`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_params待处理` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '用户id',
  `limit` int(10) unsigned NOT NULL DEFAULT '10' COMMENT '列表每页记录数，默认10条',
  `foot_switch` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '在线创作的底部链接开关：0关闭，1开启',
  `lecloud` varchar(255) NOT NULL COMMENT '乐视云账户',
  `lepwd` varchar(255) NOT NULL COMMENT '乐视云密码',
  `leplay` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否自动播放：0手动播放，1自动播放',
  `paycode` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '支付二维码',
  `per_top_bg_img` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '个人空间顶部背景图，pic_id',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  `updated_at` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='用户参数表 bs_users_params';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_params待处理`
--

LOCK TABLES `users_params待处理` WRITE;
/*!40000 ALTER TABLE `users_params待处理` DISABLE KEYS */;
INSERT INTO `users_params待处理` VALUES (1,1,15,1,'946493655@qq.com','zwx4074553864',0,0,1,20160406,0);
/*!40000 ALTER TABLE `users_params待处理` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-12-09 19:33:41
